{"author":"Tricky-List-6141","body":"Yeah he's admitted on record he scams his fans multiple times","created_utc":1701942488000,"comment_id":"kcb78hw","parent_id":"t3_18cjd7w","score":32,"submission_id":"18cjd7w"}
{"author":"Yuck_Few","body":"Cringe Lords will always have a following","created_utc":1701939910000,"comment_id":"kcb18aa","parent_id":"t3_18cjd7w","score":14,"submission_id":"18cjd7w"}
{"author":"GhostofEdgarAllanPoe","body":"Why are you gatekeeping what it means to be a real man? \n\nI feel like you're romanticizing traditional masculinity (strong man) and trying to blend it with post-modern progressive ideologies (cry and show emotion) but also trying to draw a line in the sand based on external factors like nail polish and makeup. \n\nWho gives a fuck. \n\nIf you're a big strong man who chops wood and protects the vulnerable but you also want to paint your nails blue...more power to do you dude.\n\nGo outside. Talk to people in the real world. Not everyone needs to fit in a box of classification.","created_utc":1701945406000,"comment_id":"kcbdz3g","parent_id":"t3_18cjd7w","score":44,"submission_id":"18cjd7w"}
{"author":"millerlite585","body":"I mean, a lot of 80s hair metal guys wore makeup and nail polish and were still men. I don't think those things make you less of a man.","created_utc":1701947414000,"comment_id":"kcbihso","parent_id":"t3_18cjd7w","score":13,"submission_id":"18cjd7w"}
{"author":"SeparateMongoose192","body":"I have never seen the appeal of Andrew Tate. He's one of the biggest scumbags I've ever seen.","created_utc":1701944401000,"comment_id":"kcbbnk8","parent_id":"t3_18cjd7w","score":6,"submission_id":"18cjd7w"}
{"author":"tucakeane","body":"I used to give guys like him benefit of the doubt, since they’re essentially conmen saying whatever they need to say to attract people.\n\nBut nowadays, fuck that. If you’re being a misogynist or fascist or whatever “ironically” or “to troll”, I’m just gonna assume you believe it.","created_utc":1701944418000,"comment_id":"kcbboxz","parent_id":"t3_18cjd7w","score":7,"submission_id":"18cjd7w"}
{"author":"Stillwater215","body":"He’s a weak man’s idea of a strong man, and an ignorant man’s idea of a wise man.\n\nBut also, everyone should know to never trust a person who has no chin.","created_utc":1701953026000,"comment_id":"kcbtp0k","parent_id":"t3_18cjd7w","score":6,"submission_id":"18cjd7w"}
{"author":"XBeCoolManX","body":"I'ved looked a little into the different forms of narcissistic personality disorders. It looks to me like he perfectly fits the criteria for petulant narcissism.\nSidenote, there's this woman on YouTube named Doctor Ramani. She is an expert who breaks down the different forms of narcissism, recovery from narcissistic abuse, and a bunch of other things like that. I would really recommend her channel to anyone who might be interested in learning more.","created_utc":1701942299000,"comment_id":"kcb6ss8","parent_id":"t3_18cjd7w","score":4,"submission_id":"18cjd7w"}
{"author":"SniffMySnizz","body":"Andrew Tate is genuinely a horrible person","created_utc":1701944564000,"comment_id":"kcbc0xu","parent_id":"t3_18cjd7w","score":3,"submission_id":"18cjd7w"}
{"author":"Wooden-Many-8509","body":"*tears ran down by face but I did not cry*\n\nThat alone should tell you how ridiculous that man is.","created_utc":1701944662000,"comment_id":"kcbc97n","parent_id":"t3_18cjd7w","score":5,"submission_id":"18cjd7w"}
{"author":"poolpog","body":">\"*Joking or not, saying you h\\*\\*te men and all men should d\\*e is pretty common in left wing circles*\"\n\nis it though? I mean, where do you get this idea from? From a strawman representation of \"the left\" by people on \"the right\"?\n\nAnecdotally, I am very left wing liberal, hang out in pretty much only lefty lib spaces on the web and other media, all my friends are lefty libs, i live in one of the leftiest of lefty lib states, and I can think i literally ZERO people in these spaces that ever say they hate any humans\\[1\\], let alone \"men\"\n\n  \n\\[1\\] Two exceptions being: Donald J Trump and Hitler. Hate those guys.","created_utc":1732252898000,"comment_id":"lyb7a64","parent_id":"t3_1gwpnb8","score":27,"submission_id":"1gwpnb8"}
{"author":"Lolabelle1223","body":"This election really wasnt political. Anyone who voted for a rapist… has really bad morals! My son, only a highschool diploma, has a factory job. Just a few years ago made as much as me. Im a masters degree nurse (started in 1994)Not only did he make about as much as me, but he had 4 weeks more paid vaca a year than i do!! Anyone who voted republican, voted against any female in their lives! Period!!!!!","created_utc":1732266127000,"comment_id":"lycac1x","parent_id":"t3_1gwpnb8","score":5,"submission_id":"1gwpnb8"}
{"author":"XxSpaceGnomexx","body":"Because society has no sympathy for anyone really","created_utc":1732251189000,"comment_id":"lyb1qds","parent_id":"t3_1gwpnb8","score":6,"submission_id":"1gwpnb8"}
{"author":"Affectionate_Lab_131","body":"I'm confused why these so-called political posts always devolve into a post about men not being wanted sexually by women? \n\nDo you think the Republican party will help you find a woman? \n\nI just don't understand why so many of these posts are basically why don't women like me. It must be all the democrats fault posts. \n\nI'm starting to think some of these young men are hoping a handsmaid tale type of society will come about with trump's help, and they will all be given a woman.","created_utc":1732262420000,"comment_id":"lybzx4h","parent_id":"t3_1gwpnb8","score":5,"submission_id":"1gwpnb8"}
{"author":"Various_Succotash_79","body":">Men notoriously struggle on dating apps that are unironically rigged against the vast majority of them \n\nThat has nothing to do with politics.","created_utc":1732251772000,"comment_id":"lyb3mwx","parent_id":"t3_1gwpnb8","score":13,"submission_id":"1gwpnb8"}
{"author":"PantasticUnicorn","body":"When these \"young men\" go around and say shit like YOUR BODY MY CHOICE and complaining about women not having sex with them constantly, it's really hard to have sympathy for them.","created_utc":1732251121000,"comment_id":"lyb1ic2","parent_id":"t3_1gwpnb8","score":38,"submission_id":"1gwpnb8"}
{"author":"actuallyacatmow","body":">I have sympathy for feminism and womens rights but why is hard for many of them and those in the left in general to see some young men and yes even some incels as victims in a changing culture?\n\nCan I turn this on it's head for you a little?\n\nYou're frustrated that women and the left don't see men as 'victims'. I'm figuring this is the reason you and other men struggle to have sympathy for feminism. You feel left behind behind and are frustrated that your plight isn't being heard.\n\nHowever you don't seem to extend this empathy to the other side. If there was a law that came into congress tomorrow that was the equivalent of banning abortion for men, pushed by feminists, you would feel very frustrated correct? Say forced vascetomies for all men above the age of 13. It would make you not want to support feminists, correct? In fact, you'd be very angry at this invasion of your body. Now imagine, after this law was passed, you stumbled across a thread about women complaining about the harm men do and complaints about how they don't do enough to support them. They cite examples that aren't true. You're understandably livid.\n\nCan you maybe see how asking a disfranchized group to be extra special nice to their historical oppressors could be very frustrating and not effective?","created_utc":1732253768000,"comment_id":"lyba3tv","parent_id":"t3_1gwpnb8","score":8,"submission_id":"1gwpnb8"}
{"author":"TK-369","body":"I don't see much sympathy for anybody.\n\nI mean, we will literally bomb you into oblivion\/shoot you full of holes for all sorts of reasons, just straight up kill you. Even if you're a little baby, doesn't matter.","created_utc":1732251481000,"comment_id":"lyb2oxl","parent_id":"t3_1gwpnb8","score":5,"submission_id":"1gwpnb8"}
{"author":"KevinDean4599","body":"Life is a challenge for everyone.  Not just men.  Rent or housing and food etc is the same price no matter what your sex is.  Jobs more often require more skills now. Neither political party can change this reality.","created_utc":1732252288000,"comment_id":"lyb5b3j","parent_id":"t3_1gwpnb8","score":4,"submission_id":"1gwpnb8"}
{"author":"NaturalCard","body":"Those are some really weird circles you're in - I know a ton of left wing girls and guys. Literally none of them unironically say that.\n\nThe problem is the fake news and reactionary politics.\n\nPeople believe that they do - because reactionaries go out there and lie about it.\n\nObviously, there are issues men face. This are real, serious, and need to be delt with. And yes, the left could do a much better job talking about them.\n\nThis doesn't mean that we hate all men lmao","created_utc":1732263461000,"comment_id":"lyc2tsa","parent_id":"t3_1gwpnb8","score":5,"submission_id":"1gwpnb8"}
