{"author":"Jaster22101","created_utc":1744984378000,"id":"1k1xr7t","num_comments":135,"permalink":"\/r\/Discussion\/comments\/1k1xr7t\/i_tried_to_speak_up_about_the_phrase_its_all_men\/","score":34,"selftext":"I just need to get this off my chest because it’s been eating at me.\n\nI joined a TikTok Live recently where the topic was patriarchy and the phrase “it’s all men.” I came in respectfully, calmly, and in full support of the bigger picture—I said straight up that I believe patriarchy exists, that men benefit from it, and that women’s anger and fear are valid.\n\nBut I raised a point about the language being used. I said that when we use phrases like “it’s all men,” we run the risk of alienating people who might actually be open to learning—but aren’t fully informed yet. That kind of broad messaging, while emotionally charged and understandable, often pushes people away who otherwise might have listened.\n\nI said that when people feel lumped in or talked down to, it creates resentment, and that resentment is exactly the kind of thing people like Andrew Tate feed on. He positions himself as the guy who “gets” them when everyone else calls them trash. And sadly, that works.\n\nWhat happened next?\nI got told to shut the fuck up.\nI got lectured on patriarchy like I hadn’t already acknowledged it.\nI got dismissed as “part of the problem” just for suggesting that strategy and communication matter.\n\nAnd here’s the part that really pisses me off: I’ve been hurt by women, too. Manipulated. Lied to. Emotionally torn apart. But I’ve never walked away saying “it’s all women.” I didn’t become bitter. I didn’t stop caring. I stuck around. I tried to be better. And when I finally speak up—calmly, mind you—just to say, “Hey, maybe there’s a more effective way to reach people,” I get shut down like I’m the damn enemy.\n\nApparently, trying to critique the language means I’m tone policing.\nApparently, giving a damn about how the message is received means I’m fragile.\nApparently, caring about the cause but wanting it to actually work means I’m just another guy in denial.\n\nI’m not. I’m just tired.\n\nTired of trying to be thoughtful and getting talked over.\nTired of making space for everyone else’s experience while being told mine doesn’t matter.\nTired of being treated like a punching bag just because I had the nerve to speak from the heart.\n\nCritique is not opposition.\nAsking if the message is effective is not tone policing.\nTrying to reach people who aren’t already in the choir isn’t betrayal—it’s strategy.\n\nAnd here’s the thing a lot of people don’t want to hear: this exact dynamic is part of why so many young men are being pushed into right-wing spaces and even voted for Trump.\nNot because they’re inherently evil or hate women—but because they feel unheard, dismissed, and villainized no matter what they say. When the only people who will “listen” to them are the loudest extremists, it creates a pipeline no one wants to admit exists.\n\nBut it doesn’t stop there.\nThis isn’t just about Tate. It’s not just about Trump.\nThis kind of messaging—and the way criticism of it is shut down—is feeding a broader feedback loop on social media that is actively worsening the gender divide. You can see it everywhere: men and women talking past each other, mocking each other, retreating into increasingly hostile echo chambers.\nAnd it’s not just digital noise. It’s having real-world consequences. Loneliness. Extremism. Distrust. Broken relationships. Polarization. And if we keep pretending that pushing away nuance is the right path forward, things are only going to get worse.\n\nI care about this. I care about people. I care about real change.\n\nBut sometimes, it feels like caring just makes you a target.\n\nThanks for letting me get this off my chest.\n\n\nTL;DR:\nI tried to respectfully critique the phrase “it’s all men” and got shut down, insulted, and labeled part of the problem. I wasn’t denying patriarchy—I was pointing out that this kind of language can alienate potential allies, fuel resentment, and feed toxic figures like Andrew Tate. It’s not tone policing to ask if the message is actually working. This kind of one-sided messaging is worsening the gender divide on social media and in real life, and it’s already having serious consequences. I care—and I’m exhausted from being treated like the enemy just for saying so.","title":"I tried to speak up about the phrase “it’s all men” and got told to shut the f*** up. I’m sick of being treated like the enemy just for caring.","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/1k1xr7t\/i_tried_to_speak_up_about_the_phrase_its_all_men\/"}
