{"author":"deleted","created_utc":1703032022000,"id":"18m5wcg","num_comments":1865,"permalink":"\/r\/Discussion\/comments\/18m5wcg\/there_is_no_shortage_of_people_telling_guys_that\/","score":1079,"selftext":"I'm raising sons. I have to raise them not to suck in a world that constantly tells them that men suck. I 100% understand that most things in society that we detest have been carried out by guys. I don't deny that, nor do I shy away from speaking to my sons about these things. But the messaging to these young men is something that I worry about \n\nI thought of this after seeing that video with 6,000 replies on the TikTokCringe subreddit. The woman basically said men suck, and women don't need to date them because they are now wealthier and more educated. It's a subtle message I hear all the time from married women, as it's pretty chic for them to rip on their husbands (who are standing there) like they aren't there. Kinda awkward. \n\nMen are more likely to kill someone (usually other men), as well as more likely to kill themself. They are more likely to go to war, die in war. They are more likely to be drug addicts and homeless. I don't want to belittle the challenges of women one bit, but I'd like to point out that there are challenges in the men's community, too.\n\nAll this to say that I'm nervous to be bringing up my sons in a society where we haven't quite figured out the changing role of men yet, where there's contempt for them as a gender and limited resources devoted to their issues.","title":"There is no shortage of people telling guys that they suck","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/18m5wcg\/there_is_no_shortage_of_people_telling_guys_that\/"}
{"author":"Always-money-snm","created_utc":1697645835000,"id":"17aljsg","num_comments":3733,"permalink":"\/r\/Discussion\/comments\/17aljsg\/are_women_really_only_looking_for_men_over_6ft_or\/","score":823,"selftext":"Im not 6ft and have been told im good looking but my height lets me down. Im just trying to see what the general public thinks because im 23 and i seem to be able to pull women around the age of 26+ quite easily but the younger ones around my age tend to go for taller individuals. Im 5'6 btw.\n\nEdit: I was literally bored at work so i posted and was only expecting about 3 replies😅😅😅\n\nAgain as I said above this question is not something i constantly think about it was just a way to make conversation whilst at work so all these comments saying this is why I struggle with women are false cause i don't actually struggle or at least i struggle as much as the average guy.\n\nIf there is any fight going on in the comments please stop its jus a post\n\nThank you for all the replies tho","title":"Are women really only looking for men over 6ft or is that just a chilidh notion of gen z?","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/17aljsg\/are_women_really_only_looking_for_men_over_6ft_or\/"}
{"author":"sam_spade_68","created_utc":1701971131000,"id":"18cs60s","num_comments":2335,"permalink":"\/r\/Discussion\/comments\/18cs60s\/if_personal_freedom_is_such_an_important\/","score":479,"selftext":"And some are so uptight about homosexulaity.","title":"If personal freedom is such an important foundational belief for conservatives, why are they so against women having control over their own bodies via abortion and trans people via gender identity?","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/18cs60s\/if_personal_freedom_is_such_an_important\/"}
{"author":"mermaidiamondz","created_utc":1702000694000,"id":"18d1c93","num_comments":2333,"permalink":"\/r\/Discussion\/comments\/18d1c93\/raped_victims_should_have_a_right_to_abortion\/","score":460,"selftext":"People want to put an end to abortion so bad. But what about women who been raped? What makes you think they should be obligated to give birth to a child after being violated by their rapist? You want abortion to end? Okay. But at least think about the women who were raped. If anything, they should be the only ones to have that option without having to feel like a murderer or terrible people.\n\nPersonally, Idc what a woman choose to do with her body. I’m just shock to see some people that rape should be illegal no matter the circumstances.\n\nEDIT: I have never received so much comments on my Reddit posts before.😂 Instead of reading almost 1,000 comments I’m just going to say I respect everyone’s opinions.","title":"Raped Victims Should Have a Right to Abortion","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/18d1c93\/raped_victims_should_have_a_right_to_abortion\/"}
{"author":"Livelaughpunk","created_utc":1703132930000,"id":"18n4d66","num_comments":1686,"permalink":"\/r\/Discussion\/comments\/18n4d66\/research_that_shows_physical_intimate_partner\/","score":378,"selftext":"\n(http:\/\/domesticviolenceresearch.org\/domestic-violence-facts-and-statistics-at-a-glance\/)\n\n\n“Rates of female-perpetrated violence higher than male-perpetrated (28.3% vs. 21.6%)”\n\nThis is actually pretty substantial and I feel like this is something that should be actively talked about.  If we are to look world wide there is evidence to support that Physcal violence is committed more by women or is equal to that of male. \n\n“Rates of physical PV were higher for female perpetration \/male victimization compared to male perpetration\/female victimization, or were the same, in 73 of those comparisons, or 62%”\n\nI also found this interesting \n\n“None of the studies reported that anger\/retaliation was significantly more of a motive for men than women’s violence; instead, two papers indicated that anger was more likely to be a motive for women’s violence as compared to men.”\n\nI feel like men being the main perpetrator is extremely harmful and all of us should work really hard to change it. what are y’all thoughts ?\n\nEdit: because people are questioning the study here is another one that supports it. \n\nhttps:\/\/ajph.aphapublications.org\/doi\/full\/10.2105\/AJPH.2005.079020","title":"Research that shows physical intimate partner violence is committed more by women than men.","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/18n4d66\/research_that_shows_physical_intimate_partner\/"}
{"author":"deleted","created_utc":1703679283000,"id":"18rrhi7","num_comments":1189,"permalink":"\/r\/Discussion\/comments\/18rrhi7\/it_is_not_antitrans_for_women_to_want_femaleonly\/","score":355,"selftext":"Men in general pose a unique risk to women that isn't present the other way around. Men are generally stronger and heavier, and therefore are more likely to be able to overpower us. Men can rape and impregnate us.\n\nNot at men will do this or even want to, but the overall risk remains as we don't know which men are safe and which are not, so this is why we have female-only spaces. The principle is, good men stay out so bad men stand out.\n\nAs for transwomen, the risk that this particular subset of men pose is not decreased compared to men in general. It's also a massive red flag in itself that they demand access to female-only spaces that they know aren't really for them. And it's an imposition on women, to expect us even in the best case to accept our spaces being repurposed as therapeutic settings for dysphoric men.\n\nThe idea that it is \"anti-trans\" or \"transphobic\" to be opposed to this imposition is just a way of attempting to shut women up who object. I won't be guilt tripped. However, I would be interested in hearing your thoughts if you have a reasonable and civil disagreement with this.","title":"It is not \"anti-trans\" for women to want female-only spaces","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/18rrhi7\/it_is_not_antitrans_for_women_to_want_femaleonly\/"}
{"author":"DrunkOnRamen","created_utc":1703207811000,"id":"18ns0ko","num_comments":1622,"permalink":"\/r\/Discussion\/comments\/18ns0ko\/men_get_told_they_suck_here_is_my_experience\/","score":195,"selftext":"To piggyback off the other post since several comments denied ever seeing men being told they suck I decided to just share my own experiences. This is mainly about dating so if that's not of interest to you that's fine but just letting you know ahead of time. About me, I am 34-year-old male living in Chicago, 6'0\", fit, European and my dating history is pretty bad, with my relationships just turning to just using me. I would describe myself as average but I do put in a great deal into how I present myself. This is long so I provided a quick summary at the bottom.\r  \n\r  \nI have tried online dating, singles mixers and speed dating all of which amounted to nothing. I got no real matches, with the only ones interacting with me being scammers\/spammers or one response ghosters or women that just were verbally abusive. Singles mixers weren't any better, if I was lucky, I got to say my name before being told they weren't interested or I was outright ignored.  Speed dating was the worst since the interactions I got was pretty poor.\r  \n\r  \nWhen I spoke about this with other men their response was this was their experience as well. Singles mixers were effectively just like middle school dances with men on one side and women on the other and the few men that tried to approach got rejected.\r  \n\r  \nSo I tried to find a solution and I looked for it on Reddit through various dating subreddits, this was a mistake. My own mental health gotten worse with the responses I got, which either were suggestions to do things I have already done which caused a fight or that they had no idea but were certain I am at fault here.\r  \n\r  \nI also noticed a pattern, men who posted lamenting about their difficulties in finding women were often told that they need to make improvements to themselves, go to the gym, get better clothing, see a barber, etc and more often than not without any sort of additional details or photos of them or their profile. If a man made a generalization how they are no good women, they got skewered, their standards are too high, they aren't putting the effort needed, etc.\r  \n\r  \nWoman posting always got support, even if their post was generalizing such as there are no good men in NYC. There was no suggestions or critique at all. I would comment with questions to try and better understand a woman's perspective or view point as to answer my own dilemma and those were met with hostility. I was called names and some women who responded were oddly very defensive as well accusing me of wanting to change their standards when I just wanted to understand their standards. I never seen any assessment that they were doing something wrong even though there wasn't anything more concrete than that.\r  \n\r  \nAll in all my depression at this point was pretty bad. I have a problem that no one even has a hint as to what the root cause of it is nor any suggestions that I haven't already tried to resolve it.\r  \n\r  \nOne day I learned that certain opinions were considered to be highly problematic, akin to touching the third rail. This was in a post someone made advising users to go to offline events organized by dating apps such as Bumble. Users either thanked the poster for bringing these events to their attention and others posted their experience. A woman made a post was it wasn't a good event for her as she just ended up talking to other women as none of the men were \"below her league\" something that she also applied to all women not just herself, she called the men who did try and approach her and other women to be creeps for not \"reading the room\" and staying away from them. Me and two other men made 3 separate comments how these were essentially middle school dances with the women talking amongst each other, rejecting whatever man came up to them. I added into my comment that it seems like women nowadays are very picky and have set standards that are not just high but also unwilling to compromise on any.\r  \n\r  \nI was pretty quickly attacked for my comment, trying to defend myself I linked the earlier comment from the woman echoing the same experience just from the other side. This was then deleted by the mods for \"linking hateful material\" and so was my other comment referring with a warning not to bring it up. I never got a response from the mods how exactly is mentioning a live comment or referring to it was forbidden but the comment in the same post submission was permitted to stay up. After I made this question public that other comment was eventually taken down.\r  \n\r  \nI was told that the opinion that woman nowadays are very picky is problematic and wrong even though my opinion stems from my own experiences and sort of discussion about it was forbidden. It was maddening, imagine you having a problem, trying to self-reassess to no avail, asking others to provide their assessment but again to no avail and then expressing that perhaps the problem you face isn't something you can address yourself but is more dependent others to only be clapped back and told that it is in fact your fault.\r  \n\r  \nWhat I eventually done is go to my public library, hop on to EBSCO and other research sites and look up whatever if any professional research was made into this and found that it does appear that my experiences and opinions were valid.\r  \n\r  \n**Summary:** I have trouble dating, reached out for help but I was told I was at fault and doing things wrong even though no one knew what. I asked if perhaps women are just picky get told you are wrong, an idiot and at fault and dismissed only for my mental health to go down significantly as a result.\r  \n","title":"Men get told they suck, here is my experience.","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/18ns0ko\/men_get_told_they_suck_here_is_my_experience\/"}
{"author":"Ironwolvessss","created_utc":1701939522000,"id":"18cjd7w","num_comments":573,"permalink":"\/r\/Discussion\/comments\/18cjd7w\/andrew_tate_is_a_disingenuous_narcissist\/","score":185,"selftext":"It's sad that Andrew Tate is so revered by so many in society. I attribute this to the femification of men in today's society. Due to masculinity being attacked. I do think toxic masculinity is a thing and it should be fought against but I believe the fight against toxic masculinity has slowly became a fight against all masculinity. I feel as if this is why so many disinfranchised men are gravitating towards douche bags like Tate. He's a man who's condoned violence towards women and is an out and out liar when it comes to his life. He lied about being a chess champ, he lied about being a kickboxing world champ. He lied about how he made his money. He lied about how much money he has. He lied about abuse allegations, he lied about why he moved from the UK. His most recent lie is that he's a Muslim. Something he's only saying because he's cancelled in the west so he's trying to set up a fan base somewhere else.\n\n\nI think there's a middle ground when it comes to fighting toxic masculinity. We can teach men that it's okay to feel your emotions and even cry. We can teach men that it's okay to embrace traditionally feminine traits like being nurturing and emotive without teaching them that it's okay to wear make up or nail polish. We can fight against mysoginy but at the same time we can also let men know it's okay to be masculine and to embrace being the protector of the house and someone who's in good enough shape to offer some protection in the case of a worse case scenario. No one's saying dedicate yourself to martial arts but I believe a man should be in decent shape. There is a middle ground that should be reached. \n\nThe problem is the pseudo feminists and alt right are so vocal and close minded that they're isolating eachother into echo chambers. They should instead be meeting in the middle. I'm a feminist but not the modern type that cries over man spreading and women having the right to show their breasts in public. I believe in equality and believe there should be more done to tackle issues facing women such as gender based violence and discrimination as well as issues facing men such as stigma around mental health and toxic masculinity. \n\nDue to people on the far left being so quick to cancel people it's driving more and more men towards douchebags like Tate. The far left is inexplicably emboldening the far right. Imagine being a working class man and you finally get into college or uni and all you hear is that everything in the world is your fault and that you should be ashamed of being a man. Rather than trying to educate people are speaking to virtue signal and come off as being right.  \n\nWhile the far left are partly to blame for the isolation of men, men on the far right must realise that those social justice warriors aren't true liberals and that true liberalism isn't about shaming men but about equality and respect for all and that douchebags like Tate are fakes who exploit your feelings for personal gain. They aren't indicative of real men. Real men are kind but strong, real men protect those around them. Real men show their emotions and are a pillar of support for those around them. Real men can wear pink and they can even listen to harry styles and be feminists. What real men can't be are make up wearing, nail polish wearing guilt infused pathetic social justice warrior simps. \n\n\nAnyways my rants over... Ps I'm a liberal centrist 26 year old ex Muslim Asian living in the UK. I love philosophy especially stocisim and Buddhism. I'm not a alt righter nor am I a social justice warrior. I'm just a guy stuck in the middle expressing my thoughts so please don't come at me with attacks.","title":"Andrew Tate is a disingenuous narcissist.","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/18cjd7w\/andrew_tate_is_a_disingenuous_narcissist\/"}
{"author":"Andrukin_Soti","created_utc":1730155511000,"id":"1ge3tfy","num_comments":650,"permalink":"\/r\/Discussion\/comments\/1ge3tfy\/why_are_all_the_hot_white_girls_attracted_to\/","score":183,"selftext":"(18M) I have nothing against different women dating different men, let them be happy with whoever they want to be happy.\n\nIt may be a simple coincidence but literally ALL cute girls I had a crush on, ended up with either black or arab men. And trust me, as a guy that till this day is actively trying to get a gf, I had A LOT of crushes.\n\nI started digging and I found a lot of street interview videos where a guy would come up to random women and ask on their sexual\/dating preferences and black men were always rated above white men: manlier, better smoothtalkers, funnier, stronger, more endowed, etc. While white men were often described as boring, more feminine, weaker, shrimp-dicked, etc.\n\nAs I continued to consume this content, I began to agree with the folks in comments who say that black men are the reason why I can't get a gf. I started to look at black\/arab men differently, like they are enemies, a threat to my bloodline, a threat to Europe's white population because they keep \"stealing\" all the white girls!\n\nI soon started to realized that something was deeply fucked up about my line of thought and I'm trying my best to move on from this blatant internal racism. But everytime I get a crush on a girl just to then find out she is taken by some Mohammed, my inner Klansman is like \"Ha! Told you so!\"\n\nI don't want to be a racist person but everytime this happens it feels like a salt to the wound.","title":"Why are all the hot white girls attracted to black men?","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/1ge3tfy\/why_are_all_the_hot_white_girls_attracted_to\/"}
{"author":"AppropriateGround623","created_utc":1701310448000,"id":"186w1wu","num_comments":733,"permalink":"\/r\/Discussion\/comments\/186w1wu\/i_find_the_concept_of_modesty_absurd_and_men\/","score":173,"selftext":"I'm 23(m). I was born in a muslim country and continue to live in one.\n\nEver since I grew up, I have been hearing what is appropriate for women to wear in public and which parts of the body they can expose. I have seen great diversity in perspectives on modesty. \nThe amusing thing is, no matter where folks set their modesty bar, they always seem to think that whatever parts women choose to show must be for attention. It can be eyes, face, hair, hands, arms(some tolerate exposing half and oppose wearing sleeveless tops), neck, shoulders, midriff, back(depends on how much is exposed), legs(contingent upon length of skirt or short). The conception changes within families and cities. From one individual to the other. It is primarily set by family and then broader culture in addition to being heavily influenced by religiosity and social status. It even varies by events and places.\n\n\nLately, I've been coming across quite a bit of red-pilled and conservative content online regarding this issue. This content is exposed to a diverse audience, so I expected people to differ. However, contrary to my expectation, men from entirely different cultural backgrounds were endorsing the notion that women must dress according to their partner's preferences and show respect for them. What's insane is the fact that many of these men have their female relatives wearing clothes, which would be found immodest by the very same men consuming the same content.\n\n\nI have argued with a lot of them. It just seems that none of them are ready to comprehend the gravity of accepting that their understanding of modesty is subjective and culturally relevant, if they recognise that it is subjective and culturally relevant in the first place. Most of the time, I honestly feel like these morons are throwing punches in air or attacking some boogeyman named immodesty. \n\n\nWhy don't these men let women wear what they want. All women won't choose to dress similarly. They can then choose to marry a woman who they believe dresses per their expectation. Why don't these men work on their insecurity instead of demanding women to alter their apparel. Why don't they ask themselves why they hold certain beliefs and question their validity. \n\nModesty advocates are often trying to force their preferences on others. Be them be religious preachers or individual men. They are also actively shaming those who differ from them.\n\nWhen a man is comfortable with her wife's apparel, the disapproving men claim that he's not caring, loving, lacks self-respect, and acting like a cuckold. Some people have this peculiar belief that one should dress differently before marriage but should start dressing more modestly afterwards. \n\n\nThis is not to say that people can't dress \"modest\" or that I endorse literally going nude in public. But the variance in modesty norms is something I find quite perplexing.","title":"I find the concept of modesty absurd, and men trying to control what women wear obnoxious","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/186w1wu\/i_find_the_concept_of_modesty_absurd_and_men\/"}
{"author":"Hal87526","created_utc":1727390092000,"id":"1fpxof9","num_comments":171,"permalink":"\/r\/Discussion\/comments\/1fpxof9\/why_did_everyone_have_a_problem_with_bill\/","score":166,"selftext":"What Bill Clinton did is not something that should have been shrugged off, and it wasn't. The people of the country, both on the left and the right, spoke out against it.\n\nWhy then is roughly half the country seemingly okay with what Trump has done? I genuinely don't get it.  With Trump, it's a pattern of behavior he's shown throughout his life-- being extremely creepy, talking about assaulting women, being literally convicted of assaulting women.  \n\nIt should not be about right vs left when we're talking about blatantly immoral, criminal acts.  Why someone would support someone with such little integrity is utterly baffling to me.  ","title":"Why did everyone have a problem with Bill Clinton's sex scandal, but are okay with Trump's multiple sex scandles?","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/1fpxof9\/why_did_everyone_have_a_problem_with_bill\/"}
{"author":"Joeylaptop12","created_utc":1741414849000,"id":"1j620df","num_comments":206,"permalink":"\/r\/Discussion\/comments\/1j620df\/trans_women_in_female_sports_is_unpopular_even\/","score":145,"selftext":"I think Newsome isn’t perfect but him coming out against that seems politically smart to me \n\nNewsome, a man who came out early FOR Gay marriage, when it was deeply unpopular. \n\nThe man knows politically whats what. Most other Democrats should follow his example. It’s getting ridiclious healthcare, medicare, and social secruity are now under threat because people believe most Democrats support this crap ","title":"Trans women in female sports is unpopular. Even among Democrats. Newsome is right.","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/1j620df\/trans_women_in_female_sports_is_unpopular_even\/"}
{"author":"Ironwolvessss","created_utc":1701857725000,"id":"18bt97e","num_comments":581,"permalink":"\/r\/Discussion\/comments\/18bt97e\/society_is_morally_bankrupt\/","score":134,"selftext":"So I'm posting on this to vent about how I think society is so morally bankrupt these days. So I'll get the most obvious thing out the way... Yes social media is messed up. Ofcourse it has its good sides but the sheer desperation of individuals trying to be famous online is insane. What's just as insane is the legitimacy that WE the everyday person grants these fame hungry fakers. Shallow influencers aside what about these horrible horrible tik tok challenges that literally has women objectifying their own bodies.  I feel like I can rant on about social media but most people here are probably clued on enough to know about it's shortcomings so I'll leave it be.\n\nAnother example of society and its moral bankruptcy is it's view of relationships. So no I'm not religious nor am I from a conservative country but man seeing how cheap relationships are made to be these days blows my mind. Now it's just a norm that you'll go on an app and join the proverbial meat market. It's also a given now that both guys and girls are entertaining multiple partners these days as they scramble to fill some sort of void or insecurity within themselves whilst distracting themselves with the attention they get from other people.  It's such a cheap way of meeting someone. Dating apps aside, what's with people keeping friends with exes? Why stay with someone who you either broke up with or who broke up with you. Why be friends with someone who literally let you down or you let down when it mattered most? \n\nAnother thing which I feel is a sign of society's moral decay is it's obsession with trends and celebs. Why are we so godamn obsessed with people we don't even know whilst we blindly follow whatever is trending. Are our lives that empty that we have to live vicariously through people we don't even know?! \n\nAnother thing that bothers me is how the world by in large doesn't actually care about a whole lot. Take the BLM movement, remember it trending and remember seeing so many of our friends suddenly become race relations experts? Well what I ask is, where are they now? They obviously don't care anymore because it's not trendy or popular to be speaking about it. Even though much of the issues BLM argued for still exist. Even the Ukraine conflict, remember all the stand with Ukraine posts Initially when it was trendy? Where are they now? Because Ukraine is still being attacked, do we suddenly not care anymore? Most of us never cared we only did it to show off... How disgusting.  It's the same reason why people by in large don't care about the Israel Palestine stuff unless they're either Jewish or Muslim or have some sort of vested interest or sadly hate towards eachother. There's tragedies happening all over the world which require very urgent attention but for some reason people by and large only care about what's trendy to care about. \n\n\nOur society is so godamn fake, not just on a superficial level but on a deeper level. We say we're open minded and value free speech yet cancel opinions we don't agree with and label them using some sort of buzz word to cancel debate. We claim to be understanding and we claim to value personality and intellect over looks yet ask any average or below average guy or girl how much success they have on tinder.  We say we value indvidiualsim and how we should all be ourselves yet base life of off what we see others doing. In this in age almost every view is just a regurgitated talking point rather than a view we actually did research on and came to based on our thoughts and experiences.\n\n\nWe are a fake society who's seemingly only obsessed with looking the part rather than being the part. No one seems to actually care about eachother but so long as they can look like they care then they're happy. No one seems to actually value indvidiualsim because everything they do is based of off what they see online, what their friends are doing or what their so called clique should typically be doing. It's a dog eat dog world? Nah it's a dog pretend to be cat world. No one seems to actually believe in what they stand for. \n\nThe world is cheap and morally bankrupt.\n\n\n\n\nEDIT- To everyone calling me old or saying i don't go outside or that I'm hateful or even racist.... As I've stated on this posts comments. I'm 26 university educated and Asian  living in the UK.  It's very rich those attacking this post by attacking me are accusing me of being on the internet but you are the ones acting like entitled and rude individuals by hurling personal attacks something which people usually only do online. It's you that needs to go out and spend less time on the internet so you can perhaps learn some manners. \n\nI posted this as a discussion point. I didn't post to attack anyone, if I'm wrong then politely state your case and let's have a rational discussion because it I'm wrong then I'd love to be corrected. I'm not here to be right and force people to agree with me, I'm here to learn and have a discussion with individuals all over the world. The internet has bad and good uses, I thought I'd try to make a good use of it because my friends say I often get carried away with politics, social issues and religion so I've made this account to just rant about stuff and see different perspectives to mines. ","title":"Society is morally bankrupt..","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/18bt97e\/society_is_morally_bankrupt\/"}
{"author":"JetTheMaster1","created_utc":1708384922000,"id":"1aupspd","num_comments":146,"permalink":"\/r\/Discussion\/comments\/1aupspd\/154_presidential_scholars_rank_biden_14th_best\/","score":130,"selftext":"\nhttp:\/\/www.brandonrottinghaus.com\/uploads\/1\/0\/8\/7\/108798321\/presidential_greatness_white_paper_2024.pdf\n\nr\/conservative is FUMING right now. They seem very confused as to why he is ranked as one of the worst presidents in history, I guess they are willfully forgetting\/ignoring that he \n\n•\t⁠Fomented a coup on January 6th\n\n•\t⁠Tried to kill democracy in the leadup to, and including January 6th\n\n•\t⁠Killed hundreds of thousands of Americans with his lies on the pandemic\n\n•\t⁠Tried to deliberately harm blue states during the pandemic\n\n•\t⁠Deliberately caged children at the border by deliberately separating them from their parents, and wouldn't back down from the caging for several weeks\n\n•\t⁠Calls political opponents \"vermin,\" remnicsent of another famous dictator from the 1940s, and routintely praises modern day dictators\n\n•\t⁠Cowered in front of Putin while standing next to him at Helsinki. Said he believed Putin over actual Americans working in his own intelligence agency, while next to Putin in Helsinki. Has tried everything in his power to help Russia.\n\n•\t⁠Is known for his racism, including telling members of Congress who were born in the USA but were not caucasian, to go back to their own country (like dude, USA is their own country). Was also called a racist by the Republican speaker of the House during the 2016 election, for his comments made on Judge Curiel.\n\n•\t⁠Was determined by a jury of his peers to have sexually assaulted E. Jean Carroll. The judge on that case, actually called his actions as \"rape,\" even though it didn't technically fit the legal definition of rape in New York.\n\n•\t⁠Admitted on tape that he \"grabs women by the p*ssy\" without their consent\n\n•\t⁠Suggested to Americans that ingesting disinfectant could cure themselves of covid (leading to the makers of disinfectant like Lysol, to clearly rebuke this statement and tell the public to not drink disinfectant because it is dangerous)\n\n•\t⁠Was impeached twice, once for extorting Ukraine to find dirt on a political opponent, a second time for his coup on January 6th\n\n•\t⁠Has been indicted on 91 felony counts\n\nI think it’s pretty straightforward as to why Ol’ Donny will go down in history as one of the worst. What do you guys think? \n\n","title":"154 Presidential scholars rank Biden 14th best President in American history. Donald ranked worst by significant margin.","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/1aupspd\/154_presidential_scholars_rank_biden_14th_best\/"}
{"author":"molotov__cocktease","created_utc":1721870689000,"id":"1eb768l","num_comments":51,"permalink":"\/r\/Discussion\/comments\/1eb768l\/even_without_trumps_project_2025_it_cant_be\/","score":121,"selftext":"Man, just what a bunch of juiceless losers these people are.  Trumps RNC speech [was the meandering nonsense of an obviously senile, braindead man who shouldn't be forced to campaign like this](https:\/\/www.nytimes.com\/2024\/07\/19\/us\/politics\/trump-rnc-speech-transcript.html), even before getting into his felony convictions and increasingly awful ties to Jeffrey Epstein.\n\nThe Republican VP, JD Vance, [is the least popular VP pick in decades](https:\/\/www.newsweek.com\/jd-vance-least-liked-vp-nominee-decades-polls-1929470). Vance, a deeply offputting and unlikeable  fake-hillbilly who was hand-picked by [the authors of Trump's project 2025](https:\/\/heritageaction.com\/scorecard\/members\/v000137) and demented billionaire [Peter Thiel](https:\/\/www.salon.com\/2024\/07\/22\/jd-vance-owes-almost-everything-to-peter-thiel-a-pro-billionaire-and-new-right-ideologue\/), couldn't even get laughs at [an audience so openly astroturfed that it was like striking out while playing tee ball.](https:\/\/kotaku.com\/jd-vance-mountain-dew-racism-racist-trump-vp-speech-1851601858)  Vance also [wrote a forward to a book promoting Trump's project 2025, so that is another nail in the coffin of the idea that Trump doesn't know about or endorse the plan.](https:\/\/newrepublic.com\/post\/184182\/jd-vance-trouble-heritage-foundation-project-2025-book-foreword) When he isn't fucking couches and telling 10 year old rape victims that they can't get abortions, he also [draws influence from people like Curtis Yarvin, an absolute loser who thinks we should bring back monarchies and believes that African American slavery was a good thing](https:\/\/www.politico.com\/news\/magazine\/2024\/07\/18\/jd-vance-world-view-sources-00168984), and followed [multiple white supremacists, including Steve Sailer.](https:\/\/www.threads.net\/@jbouie\/post\/C9w9mxQJFU1)\n\nOther Republicans recently [got caught saying they intend to make Abortion completely illegal because women \"Need to be punished\".](https:\/\/dfl.org\/gop-legislator-unwanted-pregnancy-punish-women-for-partying\/) and [again called for civil war if their obviously senile candidate loses.](https:\/\/www.msnbc.com\/rachel-maddow-show\/maddowblog\/ohio-republican-forced-scramble-civil-war-comments-rcna163189) Meanwhile, a director at the Heritage Foundation [gleefully threatens a hacker with rape and doubles down with an Eminem song for some reason](https:\/\/www.rollingstone.com\/culture\/culture-news\/heritage-foundation-gay-furry-hackers-texts-1235057421\/). \n\nTruly an entire administration of sheltered, completely unlikeable losers. Breathtaking stuff.","title":"Even without Trump's Project 2025, it can't be overstated what offputting freaks make up the Trump movement ","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/1eb768l\/even_without_trumps_project_2025_it_cant_be\/"}
{"author":"molotov__cocktease","created_utc":1731747541000,"id":"1gsbp3t","num_comments":34,"permalink":"\/r\/Discussion\/comments\/1gsbp3t\/matt_gaetz_resigned_to_prevent_the_house_ethics\/","score":114,"selftext":"https:\/\/abcnews.go.com\/US\/exclusive-woman-told-house-ethics-panel-witnessed-gaetz\/story?id=115897603\n\nAnd this is who Trump picked to be his attorney general. \n\nWhy would Republicans collude to protect people like Gaetz [and Trump?](https:\/\/www.theguardian.com\/us-news\/2024\/nov\/01\/trump-jeffrey-epstein-tapes)\n\nIn the time between posting this the [deus vult tattooed chode, Pete Hegseth, also received credible accusations of sexual assault.](https:\/\/www.cnn.com\/2024\/11\/15\/politics\/trump-transition-hegseth-allegations\/index.html). Just an entire administration of diddlers.","title":"Matt Gaetz resigned to prevent the house ethics committee from releasing a report where multiple women testified seeing him have sex with at least one minor.","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/1gsbp3t\/matt_gaetz_resigned_to_prevent_the_house_ethics\/"}
{"author":"JetTheMaster1","created_utc":1712354263000,"id":"1bwiprx","num_comments":321,"permalink":"\/r\/Discussion\/comments\/1bwiprx\/charlie_kirk_says_women_in_their_early_30s_are\/","score":117,"selftext":"This is a really weird way for Charlie Kirk to let his 33yo wife, and mother of his child, know that he finds her too old and unattractive.\n\nStuff like this makes me feel so bad for conservative women. Even if they're conservative themselves, it's likely because they don't realize the degree to which they are voting against their own interests and freedoms, and that gets my empathy even if it is self-inflicted.\n\nOnce again, I have to ask the question: Are conservatives getting more fucked up over time, or are they just saying what they've always thought secretly? I started paying attention to politics around 2015, before voting in my first ever election (what a disaster) and I swear these people were not this weird back then.","title":"Charlie Kirk says women in their early 30’s are “not at their prime” and “not as attractive in the dating pool.”","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/1bwiprx\/charlie_kirk_says_women_in_their_early_30s_are\/"}
{"author":"GREENadmiral_314159","created_utc":1703234401000,"id":"18o231u","num_comments":383,"permalink":"\/r\/Discussion\/comments\/18o231u\/whats_with_all_the_men_vs_women\/","score":114,"selftext":"Whenever someone brings up how one gender is affected by an issue, there is invariably someone who says \"but the other gender is affected by this too!\". Some people seem to take it like an attack on their gender when the other gender's problems are brought up. \n\nWhy? Why do people act like this? Why does it always have to be a conflict between the two?","title":"What's with all the men vs women?","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/18o231u\/whats_with_all_the_men_vs_women\/"}
{"author":"AppropriateGround623","created_utc":1705257433000,"id":"196d3tw","num_comments":131,"permalink":"\/r\/Discussion\/comments\/196d3tw\/western_conservative_men_are_literally_no\/","score":96,"selftext":"I have been arguing with Western conservative crowd for a long number of years online. Recently, I was scrolling through a Facebook group titled something like where are all the good men. The feed was filled with posts dunking on single white moms with biracial kids. There were so many posts that were screenshots of white women with bruises and white men in comments making racist comments as if white men don't commit violence against women. I don't get their moral superiority. I guess the group should be renamed to where all the good white men are. This is just one example. It's even worse on Twitter. \n\nHow are these men in any shape or form different from the men in the third world countries whom they accuse of being barbaric and abusive towards women? When you claim that women's suffrage was a mistake, a woman's purpose is to act as a baby producing machine, and support other forms of similar \"traditional\" values, how are you any different from men you hate? \n\nIt also angers me when some people don't take the existence of such men seriously and state they are just in minority when they exist in significant numbers","title":"Western conservative men are literally no different from their counterparts in the third world countries","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/196d3tw\/western_conservative_men_are_literally_no\/"}
{"author":"anonymous_girl1227","created_utc":1714589816000,"id":"1chj95v","num_comments":187,"permalink":"\/r\/Discussion\/comments\/1chj95v\/trump_told_time_magazine_that_he_will_let_states\/","score":92,"selftext":"First of all that is a complete violation of women’s privacy. Second of all, this is a dangerous attitude that trump has, and this is why he cannot be president. Trump is a facist dictator who WILL NOT leave office after four years. Trump will start killing people, he will not fix the economy, he will not lower prices. He won’t. He will control women’s bodies, he will put Christianity in the government, he will prosecute the LGBTQ community. Pay attention people! ","title":"Trump told time magazine that he will let states monitor women’s pregnancies. If that doesn’t scare you, you’re not paying attention. ","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/1chj95v\/trump_told_time_magazine_that_he_will_let_states\/"}
{"author":"JetTheDawg","created_utc":1731451925000,"id":"1gpmgj4","num_comments":56,"permalink":"\/r\/Discussion\/comments\/1gpmgj4\/gen_z_women_are_abandoning_religion_and_leaving\/","score":82,"selftext":"https:\/\/www.usatoday.com\/story\/news\/nation\/2024\/08\/13\/gen-z-women-less-religious\/74673083007\/\n\nGreat news! Religion always tries to oppress women. \n\nHey u\/AgitatedBarbie, would you like to chime in on this easily verifiable facts? ","title":"Gen Z women are abandoning religion and leaving churches in huge numbers","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/1gpmgj4\/gen_z_women_are_abandoning_religion_and_leaving\/"}
{"author":"Susgatuan","created_utc":1708049131000,"id":"1arlt1x","num_comments":276,"permalink":"\/r\/Discussion\/comments\/1arlt1x\/onlyfans_is_a_predatory_business_which_is\/","score":78,"selftext":"OnlyFans product is comprised mostly of desperate young women and their consumer is mostly porn addicted boys\/men of literally any age that can lie on an age verification.\n\nI understand that for a very slim minority of \"Models\" on OF the financial gains are immense and *potentially* overshadows the social harm of being a popular porn star. But I always equate OF to twitch streaming, for every super famous multi-millionaire there are 10s of thousands of people whose only viewers are their friends and families. For every super sexy 20 something making 300k a month there are thousands of young women who made an OF out of financial desperation or in search of a short cut to pay their bills.\n\nMany young women are drawn to the marketing popularity in the same way that young men are drawn to Twitch's marketing. It's a seemingly easy way to make a lot of money doing something you already do on your spare time. But just like twitch, most people see minimal if any success before moving on to a regular job and hoping the subject doesn't come up. The only difference is that twitch streamers may be embarrassed of cringe video content while OF girls have their most intimate interactions and body parts plastered for any creepy family member or snooping coworker to find reverse image search. It does serious harm to young women who may have had a lapse of judgement in a moment of desperation.\n\nOnlyFans knows this, they have a target demographic for both models and consumers. They want to attract a plethora of young women to the platform. They want the average woman to publish content that pulls the coworker, acquittance, or classmate to the platform. People who want to see that woman naked but don't have a chance at them in real life.\n\nAs for its consumer base, my opinion remains the same as any porn in the US. Its target demographic is mostly young men ages 12-28 who have no self control of their consumption rate. There's a reason its so easy to access these websites but that's another discussion entirely.\n\nFinally, its harmful to society as a whole because it took the rather small scale harm porn had on women who produced it and marketed it to every young woman who had a phone. It normalized the production of pornographic content. Where porn previously targeted nearly all men and women indirectly, it now reached out to every woman of voting age.\n\nI know this is going to be a very unpopular opinion on Reddit specifically and the common argument is \"Well that's a society problem\" but the harm it does to these women is severe and can't be understated. You can't change that by screaming about how employers and men need to be accepting and women shouldn't feel ashamed. But you can change it by acknowledging that OF directly markets to desperate young women and destroys many lives and relationships to make its financial goals. It's digital prostitution.","title":"OnlyFans is a predatory business which is objectively harmful to society","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/1arlt1x\/onlyfans_is_a_predatory_business_which_is\/"}
{"author":"GitmoGrrl1","created_utc":1743337428000,"id":"1jn4og3","num_comments":110,"permalink":"\/r\/Discussion\/comments\/1jn4og3\/after_hearing_trump_say_he_will_have_greenland\/","score":71,"selftext":"When Trump talks about Greenland, he started by saying he was \"asking\" but it quickly became \"I will take Greenland one way or another.\" Trump talks like a rapist. 45 women and girls have accused him of sexual assault. That includes the 13 year old who claims Trump and Epstein gang raped her most cruelly.\n\nIs there anybody who still doubts that Trump is a serial rapist? Everything he's been accused of is a reflection of how he acts and talks. ","title":"After Hearing Trump Say He \"Will Have Greenland One Way Or Another\" Is There Anybody Who Still Doubts That He Raped E Jean Carroll?","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/1jn4og3\/after_hearing_trump_say_he_will_have_greenland\/"}
{"author":"usefulidiot579","created_utc":1736903074000,"id":"1i1asj4","num_comments":97,"permalink":"\/r\/Discussion\/comments\/1i1asj4\/i_am_worried_about_the_rise_of_far_right_ideology\/","score":70,"selftext":"This is serious,  not a joke anymore. I can see so many parralels with pre ww2 Europe. \n\nHowever,  this time, the hate is directed towards immigrants, Muslims, anyone who doesn't adhere to their ideology, they used anti wokism as an excuse to justify hate. Especially in Europe,  there's an angry white minority which is stuck on eco chambers and are being riled up by powerful people around the world like musk.\n\nFrom demonisation of everyone who doesn't agree with them to actual violence based on ideological, religious and racial lines, and it's only growing, and I don't think the government's are taking this seriously. \n\nThere's serious problems, and  far right radicalisation is on the rise, and I feel it, I see it online and see hate towards others being normalised. This isn't good news to anyone.\n\nI'm genuinely worried about the future for everyone and my own family which happens to be African. Eventhough I work full time and pay taxes and follow the law, been living here for years and well integrated, all that doesn't matter to far right people, what matters to them is the colour of my skin. And they are especially violent toward women and women of of ethnic backgrounds. Cowards. I deeply love my mother and sister and I don't know what I'd do if they were attacked, cuz my mom wears a scarf and it happened to my aunt before, she was shoved out of the bus by guys calling her taliban.\n\n\nI have no issue with anyone who loves their country and wants a safe, secure future for themselves and family. We all do. But going to blame and scapegoat the wrong people sounds and feels very familiar \n\nMaybe I'm being too paranoid. Who knows, if shit like 1930s eurprean happened before, why can't it happen again? Especially with social media and people like musk pouring fuel into every fucking fire he can see, if there's no fire, he will start it.","title":"I am worried about the rise of far right ideology in young people ","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/1i1asj4\/i_am_worried_about_the_rise_of_far_right_ideology\/"}
{"author":"GitmoGrrl1","created_utc":1733008958000,"id":"1h3esnr","num_comments":101,"permalink":"\/r\/Discussion\/comments\/1h3esnr\/trump_wants_a_war_with_the_us_military_it_will_be\/","score":73,"selftext":"Trump and his minions are surprisingly naive. It comes from their ignorance of history. In contrast, US military officers are well schooled in history and tradition. They will not obey an illegal order. And the generals in Washington have been at war with politicians since Concord and Lexington. They know all the tricks.\n\nThe men and women of the US Military are sworn to protect the constitution and the country from ALL enemies, foreign and domestic. Donald Trump has revealed himself.  Unlike Trump, the officers all know who Claus von Stauffenberg was. They know he was shot as a traitor and is now revered as a patriot in Germany.\n\nTrump wants to court-martial military commanders who were involved in the withdrawal from Afghanistan. That's a blunder. The officers on the court martial will exonerate their brethren while pointing fingers directly at President Trump - who's signature is on the Doha Surrender to the Taliban. The military will close ranks and dare Trump to fire the entire Joint Chiefs of Staff. Draft Dodger Doni will back down - of course. It's what he does.\n\n","title":"Trump Wants A War With The US Military. It Will Be His Waterloo.","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/1h3esnr\/trump_wants_a_war_with_the_us_military_it_will_be\/"}
{"author":"Due-Ad7722","created_utc":1707104131000,"id":"1aiwazq","num_comments":295,"permalink":"\/r\/Discussion\/comments\/1aiwazq\/the_phrase_men_are_trash\/","score":66,"selftext":"I understand how you feel but it gets annoying to hear that generalization for every single situation..\n\nSometimes, women say it when they get hurt in a relationships as if we don't get hurt because of women.\n\nThe whole thing is stupid because actually all humans are trash.. it's just pointless to say.\n\nThoughts? \nEnlighten me, I'm open to discussion","title":"The phrase \"Men are trash\"..","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/1aiwazq\/the_phrase_men_are_trash\/"}
{"author":"Scary-Economist-2024","created_utc":1697446440000,"id":"178tupu","num_comments":504,"permalink":"\/r\/Discussion\/comments\/178tupu\/lately_ive_been_hearing_that_woman_is_a_social\/","score":66,"selftext":"I just ask them what are the socially constructed norms, roles and behaviours of men and women, and if they can give a few examples. They always seem to follow up with insults even if they were being polite up until I asked them, or telling me to Google it but they won't give a proper reply in the Twitter threads. English isn't my first language so I prefer Twitter over Google which can bring up long pages with hard to understand words.","title":"Lately, I've been hearing that woman is a social construct, a gender, and that gender is the norms, roles and behaviours associated with men and women. Why do people get angry or avoid the question when I ask them to give examples of these norms, roles and behaviours?","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/178tupu\/lately_ive_been_hearing_that_woman_is_a_social\/"}
{"author":"Hero-Firefighter-24","created_utc":1753150929000,"id":"1m5qnzi","num_comments":55,"permalink":"\/r\/Discussion\/comments\/1m5qnzi\/could_trumps_connection_to_epstein_be_worst_than\/","score":68,"selftext":"Many people rightfully assume Trump was an Epstein client. Considering his demeanor towards women, I do too, and it’s not like he’s not acting like a guilty person.\n\nBut could he have been more than just a client? Is it possible that he worked alongside Epstein to traffick girls? Could he have actually given some of Epstein’s victims?\n\nCall me a conspiracy theorist if you want, but this sounds plausible. Trump looks like the kind of person who would do sex trafficking, and considering he and Epstein were close… food for thought.","title":"Could Trump’s connection to Epstein be worst than we think?","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/1m5qnzi\/could_trumps_connection_to_epstein_be_worst_than\/"}
{"author":"deleted","created_utc":1720011088000,"id":"1du62rp","num_comments":249,"permalink":"\/r\/Discussion\/comments\/1du62rp\/is_the_us_heading_towards_a_dictatorship\/","score":70,"selftext":"The recent Supreme Court ruling on presidential immunity combined with project 2025 genuinely has be scared shitless that the US along with the rest of the world is going to fall to global fascism if Trump wins, which seems to be becoming increasingly likely. It’s not just crazy MAGA cultists anymore. The average person along with people in my own family seem to think everything that’s happened is either completely acceptable or they’re just ignorant and uncaring to what’s going on. \n\nI feel like nobody is going to be safe. And not just women and minorities, but people with left-wing progressive views in general. Can anyone inject some hope into my mind??? ","title":"Is the US heading towards a dictatorship?","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/1du62rp\/is_the_us_heading_towards_a_dictatorship\/"}
{"author":"rubysmama16","created_utc":1594976181000,"id":"hsm84j","num_comments":19,"permalink":"\/r\/Discussion\/comments\/hsm84j\/i_just_realized_who_liza_minnellis_mother_was_and\/","score":68,"selftext":"Because her mother is Judy fucking Garland.\nI had NO idea, like at all. I just went on Google and typed it in and up popped a bunch of pictures of Judy and Liza when Liza was a baby.\nThe very next thing I looked up were the symptoms of fetal alcohol syndrome, because it was obvious her eyes were veerryy far apart.\nSure enough Liza has all the signs of FAS, then I remembered that Judy has a legacy of being an alcoholic and it hit me that it was probably so bad she couldn't slow down long enough so that her kid wasn't effected. \nI know that back then women drank and smoked during pregnancy but as a new born Liza looked rough.. \nWas Judy's drinking during her pregnancy talked about by anybody? Does anyone know if Lizas appearance was talked about right after she was born?","title":"I just realized who Liza Minnelli's mother was and why everyone jokes about her never living up to her mother.","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/hsm84j\/i_just_realized_who_liza_minnellis_mother_was_and\/"}
{"author":"JetTheDawg","created_utc":1745528047000,"id":"1k6rh3l","num_comments":59,"permalink":"\/r\/Discussion\/comments\/1k6rh3l\/we_are_nearing_100_days_of_trumps_presidency_lets\/","score":67,"selftext":"First 100 days so far…\n\nPardons all violent Jan 6th criminals\n\n2 Israeli ceasefires collapse\n\nUkrainian ceasefire collapse\/fail to launch\n\nWar with houthis\/ signal gate 1.0 and 2.0\n\nLets houthis shoot down 10+ reaper drones\n\nThreatens invasion of partner countries\/alienates allies (Greenland, Canada, Mexico and Panama)\n\nThreatens war with Iran\n\nThreatens NATO alliance\n\nDoes Russia’s bidding against Ukraine\/propaganda, pulling aid, intel, capitulation to land demands\n\nMark Fogal released for Russian cyber criminal\n\nDismantles foreign cyber crime defense\n\nMultiple aviation accidents\/blames DEI\n\nDEI historical removals like Jackie Robinson\/ Enola gay\n\nReleases millions of gallons of water in CA to wrong place after fires\n\nAddresses none of deadly tornadoes in central plains (busy winning his own golf tournament)\n\nMarkets down 10-20% \/ worse month since depression\/market manipulation\n\nBlows up his own trade deals and erases trillions from the market with dollar down 9%\n\nGiant tariff tax \/ global trade war \/ *no tariffs on Russia\n\nCrypto scams \/ Trump and Melania coins\n\nPardons Silk Road creator and crypto crooks\n\nUS boycotts\/travel warnings\/prolonged detainment\n\nFroze NIH research grants and preventing federally funded scientists from travelling or talking about their work.\n\nGutted USAID wasting billions in aid and costing lives\n\nCuts funding to public media like npr + pbs\n\nTook over Kennedy center\n\nHangs mug shot in White House\n\nLet’s elons kid put a booger on resolute desk\n\nDoge chainsaw to fed agencies with no DOD cuts and an actual increase in federal spending \/mass “DEI firings”\n\nStops loans and programs like farm to school\n\nInvites dictators to the White House\n\nLoss of 1st and 5th amendment rights\/deporting for opinions\/due process\/deporting homegrown criminals\n\nEl salvadorian detention camps\/ Guantanamo bay failure\n\nThreatens loss of 14th amendment - birthright citizenship\n\nThreatens 16th amendment rights- congress setting tax rules\n\nThreatens 19th amendment - save act\/women’s voting rights\n\nThreatens 22nd amendment - 3rd term\n\nWeaponizes justice department\/ Tesla vandalism = terrorism\/ Jan 6 revenge\n\nMeasles + bird flu\n\nWasted 30k real eggs on Easter\n\nF-47 jet and proposals for his image on currency, Rushmore, airport naming\n\nCanceled Ebola prevention funding\n\nEliminates FDA regulations on food\n\nOpens federal forests for logging and opens protected ocean space for fishing\/drilling\n\nWhite House = Tesla dealership\n\nGolf trips EVERY weekend and some weekdays\n\nWastes millions attending Super Bowl, NASCAR, and ufc events\n\nTrump Gaza \/wants to create golden idols of himself\n\nAttacks and sues private, state, and federal entities over constitutional rights\/extortion\n\nAttacks on trans including troops\n\nAttacks the independence of the FED\n\nPro Child labor legislation\n\nGets rid of price caps on medicine like insulin\n\nReverses student loan forgiveness\n\nTries to reverse overdraft fee protection\n\nReverses climate legislation\/guts epa\n\nViolation of Separation of powers \/criminal contempt\n\nMass Illegal Deportations\n\nMasked secret police kidnapping people\n\nRevoked citizenship for hundreds of thousands of refugees\n\nMass protests in all 50 states\n\nDidn’t know about dead soldiers in Lithuania\/golfed with Saudis instead of being there for dignified transfer of bodies\n\nDidn’t release Epstein Files\n\nSays “these things happen” after Florida school shooting\n\nNo “no tax on tips\/overtime”\n\nBrain worm autism theory\/ persons list\n\nFruit loops made with real colors\n\nSOH gets robbed and does glam shoot with foreign prisoners\n\nDOI lies under oath\n\nA1 sauce secretary of education\n\nTrump GOLD card for Russian oligarchs\n\nAnnounces military parade for his birthday\n\n“Got rid” of PaPer straWs\n\nMade shower heads Great Again\n\nBaby bonus\/mommy medals\n\n100ft flag pole at the White House\n\nGulF of AmEriCA\n\nSo I’m not feeling great. Get this guy OUT\n\nIf anyone has any more points to add, feel free! ","title":"We are nearing 100 days of Trumps presidency. Let’s go over what’s happened in those 100 days, shall we?","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/1k6rh3l\/we_are_nearing_100_days_of_trumps_presidency_lets\/"}
{"author":"ShafordoDrForgone","created_utc":1728699888000,"id":"1g1gj88","num_comments":59,"permalink":"\/r\/Discussion\/comments\/1g1gj88\/the_sexual_abuse_trump_is_liable_for_us_in_fact\/","score":68,"selftext":"A lot of people hear \"sexual abuse\" from our cowardly pundits and think \"at least it's not rape\"\n\nThe difference between the civil claims of \"sexual abuse\" and \"rape\" at the time distinguished between penetration of the penis and everything else\n\nThe jury unanimously concluded that \"sexual abuse\" was committed based on the fact that Trump had a clear propensity to \"grab women by the pussy\" where \"[he doesn't] even wait\". E Jean Carroll described his fingers inside of her in detail. \n\nShe told many people immediately afterward. Other victims confirmed his modus operandi. He also bragged about those acts\n\nNew York law has since been legally changed to include digital rape as rape\n\nTrump filed a defamation suit against the claim of \"rape\". Judge Kaplan wrote in his dismissal that the jury in May established that \"Mr. Trump 'raped her,' albeit digitally rather than with his penis.\"\n\n\"In fact, both acts constitute 'rape' in common parlance, its definition in some dictionaries, in some federal and state criminal statutes, and elsewhere,\" he wrote.\n\nDonald Trump is a rapist\n\nTrump voters are rapist voters\n\n","title":"The \"sexual abuse\" Trump is liable for us in fact r*pe. Trump is an actual r*pist (trigger warning)","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/1g1gj88\/the_sexual_abuse_trump_is_liable_for_us_in_fact\/"}
{"author":"HEMIfan17","created_utc":1705722594000,"id":"19arxpy","num_comments":317,"permalink":"\/r\/Discussion\/comments\/19arxpy\/by_passing_a_6week_abortion_ban_fl_governor_ron\/","score":67,"selftext":"Especially in places like Miami-Dade. Don't know if it's a cultural thing or what, but there is a subset of women down here that don't like using birth control because it \"messes with their mood,\" don't like their partners using condoms because they \"don't like the feeling\" and instead insist their men use the \"pull out and prey\" (POP) method. When this doesn't work and they fall pregnant, they head right down to the nearest women's clinic and get an abortion.\n\nHere's the problem. If the 6 week ban goes into effect, they will not be able to do that. They most likely will not afford to be able to travel to a state that kept abortion legal. So what happens when they give birth to all those unwanted kids? They will abuse and neglect them, the kids will go into an already overworked foster care system where they will likely age out, be angry at the world, start committing crimes and finally, wind up incarcerated. Even if they don't abuse and\/or neglect them, they will likely have to go on government assistance which unfortunately makes them a target for DCF (Because that agency knows they won't be able to hire a good lawyer to fight against false abuse\/neglect allegations) leading to... kids being put into foster care, then the cycle repeats.\n\nSo I hope that Desantis has a plan in place to hire more cops and expand the jails in 14-21 years because he wanted to \"save the babies.\"\n\nSource: I live here.\n\nPS: Texas is going to have the same issue.  Pro-lifers bragging about \"10,000 babies saved in TX\" too ignorant to realize that 9000 of those children will go into the foster care system where they will come out pissed off and itching to go on a crime spree.  Ten minutes of research shows that after Roe V Wade was first decided in 1973, the crime rate plummeted because women were not forced to have kids they didn't want who would have otherwise gone into foster care.","title":"By passing a 6-week abortion ban FL governor Ron DeSantis has unknowingly increased crime in his state.","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/19arxpy\/by_passing_a_6week_abortion_ban_fl_governor_ron\/"}
{"author":"rgc6075k","created_utc":1707937715000,"id":"1aqkep7","num_comments":179,"permalink":"\/r\/Discussion\/comments\/1aqkep7\/is_republican_success_dependent_upon_ignorance\/","score":62,"selftext":"After observing all of the book bans around the US which seem largely to be perpetrated by \"Far Right\" groups and Republican dominated politicians, is the success of the Republican party dependent upon an ignorant population?  Is keeping Americans ignorant and uneducated a conscious part of Republican planning or is it incidental to religious or other views?  Science denial, anti-immigrant racism and prejudice, oppression of women and various minority groups may all suggest a strong dependency on ignorance and a failed education system for Republican success.  Libraries seem to be a current focus as suggested by this [NPR article](https:\/\/www.npr.org\/2023\/05\/04\/1173274834\/book-bans-library-funding-missouri-texas-ashcroft).  School boards and [school curriculum](https:\/\/time.com\/6299290\/florida-slavery-curriculum-college-board-controversy\/) have also been common targets.  If ignorance hurts the long term success and competitiveness of America and it's people, is the Republican plan just a short-sighted path to the downfall of America?  Could it be that many failed civilizations were simply the result of an effort to maintain the power and superiority of a minority ruling class through ignorance?","title":"Is Republican Success Dependent Upon Ignorance?","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/1aqkep7\/is_republican_success_dependent_upon_ignorance\/"}
{"author":"molotov__cocktease","created_utc":1734496392000,"id":"1hgk3nd","num_comments":48,"permalink":"\/r\/Discussion\/comments\/1hgk3nd\/the_reversal_of_roe_and_dobbs_has_led_to_an\/","score":60,"selftext":"[Availabile data on the post-Dobbs landscape shows a 7% increase in total infant mortality, 10% increase when specifically looking at infants with congential anomolies.](https:\/\/www.ajmc.com\/view\/infant-mortality-increases-across-us-following-dobbs-decision) This was, actually, completely predicted by pro-choice activists. [Deaths among pregnant women in Texas have skyrocketed, as well](https:\/\/www.nbcnews.com\/health\/womens-health\/texas-abortion-ban-deaths-pregnant-women-sb8-analysis-rcna171631). \n\nIs it time to acknowledge that \"Pro-L:ife\" is a misnomer, given that the real-world application of their policies \\*increases\\* mortality?\n\nWhat would a health system premised on harm reduction do differently? ","title":"The reversal of Roe and Dobbs has led to an increase in infant mortality, not a decrease. ","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/1hgk3nd\/the_reversal_of_roe_and_dobbs_has_led_to_an\/"}
{"author":"JetTheDawg","created_utc":1726960651000,"id":"1fm5buj","num_comments":198,"permalink":"\/r\/Discussion\/comments\/1fm5buj\/can_any_loyal_maga_members_please_give_the_rest\/","score":62,"selftext":"This one's a doozy \n\nWOMEN ARE POORER THAN THEY WERE FOUR YEARS AGO, ARE LESS HEALTHY THAN THEY WERE FOUR YEARS AGO, ARE LESS SAFE ON THE STREETS THAN THEY WERE FOUR YEARS AGO, ARE MORE DEPRESSED AND UNHAPPY THAN THEY WERE FOUR YEARS AGO, AND ARE LESS OPTIMISTIC AND CONFIDENT IN THE FUTURE THAN THEY WERE FOUR YEARS AGO! I WILL FIX ALL OF THAT, AND FAST, AND AT LONG LAST THIS NATIONAL NIGHTMARE WILL BE OVER. WOMEN WILL BE HAPPY, HEALTHY, CONFIDENT AND FREE! YOU WILL NO LONGER BE THINKING ABOUT ABORTION, BECAUSE IT IS NOW WHERE IT ALWAYS HAD TO BE, WITH THE STATES, AND A VOTE OF THE PEOPLE - AND WITH POWERFUL EXCEPTIONS, LIKE THOSE THAT RONALD REAGAN INSISTED ON, FOR RAPE, INCEST, AND THE LIFE OF THE MOTHER - BUT NOT ALLOWING FOR DEMOCRAT DEMANDED LATE TERM ABORTION IN THE 7TH, 8TH, OR 9TH MONTH, OR EVEN EXECUTION OF A BABY AFTER BIRTH. I WILL PROTECT WOMEN AT A LEVEL NEVER SEEN BEFORE. THEY WILL FINALLY BE HEALTHY, HOPEFUL, SAFE, AND SECURE. THEIR LIVES WILL BE HAPPY, BEAUTIFUL, AND GREAT AGAIN!\n\nAny insight from the stable geniuses of the MAGA party would be welcome, specifically towards the \"they will never think about abortions again\" part\n\nBonus points if you can explain where it's possible to \"execute\" a baby at 9 months or after they are born \n\nPlease, MAGA, let us know! ","title":"Can any loyal MAGA members please give the rest of us some insight into the latest Trump word salad post? ","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/1fm5buj\/can_any_loyal_maga_members_please_give_the_rest\/"}
{"author":"GitmoGrrl1","created_utc":1738613285000,"id":"1ignlrm","num_comments":38,"permalink":"\/r\/Discussion\/comments\/1ignlrm\/remember_the_good_old_days_when_joe_biden_was\/","score":59,"selftext":"Remember the good old days when Joe Biden was president? 3% unemployment became the Biden Standard. One great jobs report after another. The stock market hitting new highs week after week after week. Scientists respected. Women's rights protected. Civil rights legislation enforced. No one was above the law. Nobody was afraid to fly on airlines. Nobody worried about being targeted by the federal government and being fired. We had a government that looked like the people. We had a president who consoled Americans when they grieved. People were proud to call themselves Americans.\n\nWhile Republicans screamed that President Biden used Executive Orders too often, in fact, Biden got more bi-partisan legislation passed than any president since LBJ. Republicans screamed that unknown people were really in charge - now we know exactly who is giving the orders and it's not the POTUS. Elon Musk is in charge and this administration is filled with billionaires. The constitution is being trampled on.\n\nI warned people on this subreddit for the last four years that \"these are the good old days.\" Now they are gone forever. Remember the shining city on the hill? The lights are out and nobody's home.","title":"Remember The Good Old Days When Joe Biden Was President?","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/1ignlrm\/remember_the_good_old_days_when_joe_biden_was\/"}
{"author":"Xander707","created_utc":1730505322000,"id":"1gh8p56","num_comments":81,"permalink":"\/r\/Discussion\/comments\/1gh8p56\/republican_men_and_leaders_despise_the_idea_of\/","score":57,"selftext":"Aside from their horrific policies of stripping abortion and healthcare rights from women, Republican men also can’t stand the idea of women voting independently and differently than their husbands command.\n\nTom Cox, a Republican said “that’s why I make my wife do a mail in ballot, so I can make sure she votes for Trump, she’s not gonna vote behind my back.”\n\n\nCharlie Kirk - said it is “repulsive”, “disastrous”, and “nauseating” that it is being suggested women can vote differently from their husband - who “probably works his tail off to make sure she can go have a nice life”\n\nJesse Waters - said “if he found out his wife was going into the voting booth and pulling the lever for Harris, that’s the same thing as having an affair”\n\nMAGA types often float the idea of repealing the 19th amendment, saying America would be much better off.\n\n\nThey want women to be subservient again. They want women to be property. They hate the idea of free, independent women.","title":"Republican men and leaders despise the idea of women having agency.","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/1gh8p56\/republican_men_and_leaders_despise_the_idea_of\/"}
{"author":"geetar_man","created_utc":1722668531000,"id":"1einy70","num_comments":73,"permalink":"\/r\/Discussion\/comments\/1einy70\/how_people_are_reacting_to_the_algerian_boxer\/","score":56,"selftext":"There’s a lot we do know and a bit we don’t.\n\nHere’s what we do know:\n\nShe’s not trans. She’s from Algeria, where sex reassignment surgery is not permitted and LGBT culture is seen as bad.\n\nShe has female body parts. It says she is a female on her birth certificate after her mother gave birth, doctors saw she had female body parts and were like “yup, it’s a girl.”\n\nShe likely has elevated testosterone levels. There’s no specific test out there that we can read the results of, but we can assume she’s telling the truth.\n\nHere’s what we don’t know: Her chromosomal makeup. \n\nSo back to what we know: the IBA, a Russian organization, permitted her to fight in a tournament, and only banned her AFTER she beat a Russian—citing an “unspecified genetic test” that they refuse to give ANY information on. People are referencing this ban and automatically assume she has an XY makeup.\n\nThe IOC says her testosterone levels were low enough to compete.\n\nShe’s also lost to women 9 times, so it’s not like she’s some invincible Mike Tyson fighting small women.\n\nSo much misinformation on there — all from people who believe women shouldn’t have to fight men. Yet here they are…shouting that this WOMAN should fight against men.","title":"How people are reacting to the Algerian boxer situation is frustrating","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/1einy70\/how_people_are_reacting_to_the_algerian_boxer\/"}
{"author":"Giverherhell","created_utc":1740179739000,"id":"1iut7sz","num_comments":63,"permalink":"\/r\/Discussion\/comments\/1iut7sz\/apparently_dei_recipients_are_white_ppl\/","score":53,"selftext":"So apparently after doing some research, the ppl DEI hires have hired the most are conservative white women. Which explains why I've been seeing a lot angry conservative white women who lost their jobs posting online. \n\nNot only that. The least hired group is black 🤣🤣. Racism is funny. Like that because even i Believe DEI was benefiting black ppl more, come to find out DEI is more beneficial to white women, Asians, white LGBT, and Latinos. This also explains whi conservatives are becoming more sympathetic to the ppl who work in the government that are loosing their jobs. Learn something new every day. ","title":"Apparently DEI recipients are white ppl.","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/1iut7sz\/apparently_dei_recipients_are_white_ppl\/"}
{"author":"Joeylaptop12","created_utc":1721837176000,"id":"1eavwzc","num_comments":350,"permalink":"\/r\/Discussion\/comments\/1eavwzc\/trump_and_the_gop_are_about_to_get_to_racist_and\/","score":54,"selftext":"Kamala being a women of color is going to be too much for them. Subconciously or otherwise \n\nThey won't be able to contain themselves wnd will soon start calling her worse things then even a DEI hire.\n\nThis will alienate enough white moderates in the suburbs and throw the election to Kamala. ","title":"Trump and the GOP are about to get to racist and blow the election ","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/1eavwzc\/trump_and_the_gop_are_about_to_get_to_racist_and\/"}
{"author":"Apart_Attention8279","created_utc":1713498413000,"id":"1c7clti","num_comments":174,"permalink":"\/r\/Discussion\/comments\/1c7clti\/republicans_are_going_to_lose_big_come_november\/","score":56,"selftext":"No, both sides are not alike.  Anyone who comes in saying ‘both sides suck’ obviously hasn’t looked at how any big ticket issues have been voted on.  \n\nDemocrats wanted to keep gas prices down, republicans voted against it.  \n\nRepublicans stripped women of pregnancy rights and battle every day to limit them more.  \n\nRepublicans spew hate speech that puts my friends and family in danger. \n\nThe economy has done well under Democratic leadership in my lifetime, and substantially worse under Republican leadership.  \n\nThe choice is clear.  Vote for sanity, humanity, and personal well being.  Vote Democrat.  ","title":"Republicans are going to lose big come November, and their only argument over issues right now is ‘What, everyone’s like that, right?!”","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/1c7clti\/republicans_are_going_to_lose_big_come_november\/"}
{"author":"leonitaa","created_utc":1597274868000,"id":"i8fr3n","num_comments":21,"permalink":"\/r\/Discussion\/comments\/i8fr3n\/hypersexuality_after_rape_is_not_talked_about\/","score":54,"selftext":"I would not say that this statement is perhaps controversial because it is indeed factual, but a lot of people believe it is and I want to hear people's thought on both sides. Following rape, there are typically 2 paths women\/men go down (not always, but typically): they either avoid sexual encounters for a short or extended period of time or they become hyper-sexual and have sex more frequently with different partners. The reason why this is a controversial statement is because people use hyper-sexuality to say the victim is lying. How could she\/he have been raped if she is having sleeping around?? This deep-rooted perception on rape victims has greatly impacted the way we view victims and if the rapist is convicted or not. What are your thoughts about this? Were you aware of hyper-sexuality as a response to rape trauma?","title":"Hyper-sexuality after rape is not talked about enough.","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/i8fr3n\/hypersexuality_after_rape_is_not_talked_about\/"}
{"author":"AbyssWankerArtorias","created_utc":1744443199000,"id":"1jx3ta8","num_comments":287,"permalink":"\/r\/Discussion\/comments\/1jx3ta8\/if_you_want_trans_women_banned_from_womens_sports\/","score":52,"selftext":"Title says it all. Don't use \"protecting women\" as an excuse for your desire to attack trans people when you don't actually care about women. ","title":"If you want trans women banned from women's sports but don't want Abortion to be a protected right and for women to be able to vote without jumping through hurdles like the SAVE act just passed requires, you don't actually care about women. You just want to attack trans people.","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/1jx3ta8\/if_you_want_trans_women_banned_from_womens_sports\/"}
{"author":"TSllama","created_utc":1740676440000,"id":"1izbpxy","num_comments":88,"permalink":"\/r\/Discussion\/comments\/1izbpxy\/republicans_trying_to_stop_many_women_trans\/","score":52,"selftext":"MAGAs keep saying that this government isn't going to restrict people from voting, that they're not targeting women or anything. But it's only a few weeks into this administration and here we are. How on earth can anyone support this bullshit?\n\n[https:\/\/indivisibleteam.medium.com\/maga-has-a-bill-that-would-disenfranchise-someone-you-know-64cf24d0fcf5](https:\/\/indivisibleteam.medium.com\/maga-has-a-bill-that-would-disenfranchise-someone-you-know-64cf24d0fcf5)\n\nThe SAVE Act is an attempt at mass disenfranchisement disguised as an election integrity bill. It would require every voter to show proof of citizenship bearing their current name when registering to vote — which might not seem like a big deal, unless you spend two seconds thinking about the ramifications.\n\n* Overnight, it’d essentially end online and mail-in voter registration.\n* Proof of citizenship doesn’t mean a simple driver’s license. It means a birth certificate or a passport — documents that tens of millions of citizens simply don’t have access to.\n* Married people who’ve changed their names wouldn’t be able to register using their original birth certificates — effectively disenfranchising millions of women.\n* Trans and nonbinary people who’ve changed their names to reflect their gender identity would also face massive challenges to voting — and the State Department’s ban on updating sex designations on passports (if upheld in court) would add to the difficulty of satisfying the bill’s proof of citizenship requirements.\n* The burdensome requirements would disproportionately impact younger voters (how many college students do you know who have a birth certificate stashed in their dorm rooms?), voters of color, low-income voters, and elder voters.\n* Arizona and Kansas tried similar legislation and [tens of thousands of eligible voters were disenfranchised](https:\/\/www.brennancenter.org\/our-work\/analysis-opinion\/house-bill-would-hurt-american-voters).","title":"Republicans trying to stop many women, trans people, and others from voting","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/1izbpxy\/republicans_trying_to_stop_many_women_trans\/"}
{"author":"WeAllPerish","created_utc":1732942998000,"id":"1h2vsnt","num_comments":23,"permalink":"\/r\/Discussion\/comments\/1h2vsnt\/i_cant_stand_the_gender_war_on_social_media\/","score":52,"selftext":"The men hate the women, and the women hate the men. It’s a never ending cycle, and frankly, it’s exhausting. Both sides love to pretend their hands are clean, like they’re innocent victims in the downfall of modern relationships. \n\nMen blame women, ranting about “modern women” being too promiscuous, living easy lives because they “can profit off their bodies,” calling them gold diggers who cheat and expect men to pay for everything without offering anything in return. They truly believe women only care about money, reducing every issue down to this tired stereotype.\n\nMeanwhile, women blame men for being emotionally unavailable, disrespectful in how they talk to and view women in general, refusing to commit, and only engaging with women for sex. They label men as “incels” and shame them over age gaps, throwing out blanket accusations without considering individual circumstances. It’s like everyone’s reading from the same worn out script, just swapping out who they’re mad at.\n\nAnd here’s the kicker, neither side can admit that both are part of the problem. It’s easier to sit on social media, screaming into the void about how “all men are trash” or “all women are gold diggers” than to face the bigger issue. Newsflash, modern dating  is broken, and it’s not because of just one gender. It’s broken because everyone contributes to this toxic mess. Until we stop playing the blame game and start addressing the real, collective problems, nothing’s going to change.","title":" I Can’t Stand the Gender War on Social Media","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/1h2vsnt\/i_cant_stand_the_gender_war_on_social_media\/"}
{"author":"Diligent_Ass67","created_utc":1721426411000,"id":"1e74fv7","num_comments":68,"permalink":"\/r\/Discussion\/comments\/1e74fv7\/republicans_are_worried_women_will_elect\/","score":50,"selftext":"https:\/\/dailyboulder.com\/republicans-are-worried-women-will-elect-democrats-in-a-landslide\/\n\nWhy would they be worried? It's not like the GOP is full of old white men trying to tell women what to do with their bodies, nor do they have a man liable for rape running their party. \n\nOh wait.... ","title":"Republicans Are Worried Women Will Elect Democrats In a Landslide","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/1e74fv7\/republicans_are_worried_women_will_elect\/"}
{"author":"Indrid_Cold23","created_utc":1722558697000,"id":"1ehl2tw","num_comments":328,"permalink":"\/r\/Discussion\/comments\/1ehl2tw\/why_do_republicans_insist_on_saying_harris_was\/","score":51,"selftext":"Biden asked Harris to lead diplomatic efforts to reduce poverty, violence and corruption in Central America's Northern Triangle countries of Guatemala, Honduras and El Salvador, as well as engage with Mexico on the issue.\n\nHarris helped engineer $4 billion in government aid and commitments of $5.2 billion in private investment to create or support an estimated 250,000 jobs in Guatemala, Honduras and El Salvador.\n\nNespresso started sourcing coffee from El Salvador and Honduras in 2021. Gap Inc said it is on pace to meet a pledge to invest $150 million by 2025 to source textiles in the region and that it had increased yarn production in Guatemala and provided skills training to women in Guatemala and Honduras.\n\nIt's not a lot, but lasting change takes time. I'm just confused at how Republicans thought this was some kind of mission to secure the border. \n\nInstead it's to make sure people have enough in their own countries so they don't need to cross the border.","title":"Why do Republicans insist on saying Harris was the \"border czar?\"","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/1ehl2tw\/why_do_republicans_insist_on_saying_harris_was\/"}
{"author":"deleted","created_utc":1706577256000,"id":"1ae0hcd","num_comments":675,"permalink":"\/r\/Discussion\/comments\/1ae0hcd\/the_trans_bathroom_debate_is_stupid_and_funny\/","score":49,"selftext":"Something I've found really funny recently during these trans discussion posts is how incredibly stupid the bathroom debate is. In particular, it's interesting to me how people have these 'concerns' about where trans people go to pee.\n\nI am trans. I find these conversations entertaining because of how strong the opinions of anti-trans people are, yet on the other hand, this is an 'issue' which their opinion has no real bearing on anything at all regardless of how they feel about it. It's a guilty pleasure of mine to get stoned, read these anti-trans dipshit's comments, and laugh at how stupid they are.\n\n> **\"bathrooms are and have always been single sex spaces\"**\n\nIt's weird people assume these things. Trans people have been using the bathroom of their gender for decades. That hasn't really changed since the recent panic fabricated as a wedge issue by the Republican party. The way things are is the way things have been. Conveniently I think this rephrasing of the past is either based on ignorance or to frame trans people as some kind of invaders in spaces they've always been in.\n\n> **\"well, if we let trans people into the bathroom of their gender, they might assault someone\"**\n\nWe should also get rid of guns since people might shoot someone. We should operate on presumption of guilt for people and assume guilty until innocent. If we do this, maybe we can start by assuming all cis men are guilty of assault until proven innocent since that demographic seems to assault women the most... any issues with this?\n\nAssault is illegal.\n\n> **\"this allows people to pretend they are trans and go into the bathroom and assault someone\"**\n\nIf someone is going to rape or assault someone, a sign on the door won't change that. We don't have to strip someone's access to public facilities due to concerns about some unrelated bad actor possibly performing acts of evil. If someone wants to pretend to be trans and go assault a bunch of people, that's not great... but what the fuck does that have to do with people like me though. I'm just tryina pee.\n\n> **\"but what if there's a penis\"**\n\nThis one always makes me laugh because of how juvenile the concern is. Yeah... what if there *was* a penis? Is this covid related? And if so, *what do we do about it?*\n\nI donno about you people, but I've never seen a penis in the bathroom. Even in the men's room, when men use the urinal, seeing someone's junk means someone is doing something wrong. Indecent exposure last I checked is already a crime. A dick isn't required (except the person being one); a cis woman can go out in public and riff off her vag like she's playing a guitar and people are gonna have a problem with it (I would fucking hope). When you act unhinged and like a psycho, I don't think genitals or having a penis has much to do with it. Can we stop worrying about what's in someone's pants? You don't need to know what's in mine. I don't want to know what's in yours. You could be hiding a subway sandwich in there for later and I don't need to know about it because you'll be using a bathroom stall.\n\n> **\"why cant they just use the men's room. they make me uncomfortable\"**\n\nYes, I agree. As a trans woman, cis women make me uncomfortable and I think they should just use the men's room. Society does not need to cater towards the comfort of cis women. There isn't any safety concern with men using the men's room, so why can't cis women also use the men's room? If people don't want cis women using the men's room, why should I use the men's room? I know who and what I am. I don't need other people's help taking a shit.\n\nWe could go over these stupid talking points all day but at the end of the day, the funny thing is, these are talking points.\n\n**This leads to my final point**, that these anti trans bathroom talking points are incredibly stupid, but *they also don't fucking matter*. People can carry their opinions about where people like myself pee to the grave. Their opinions are irrelevant. We can have a 3 hour discussion about the nuance about where people like myself choose to take a shit and I'll continue to not give one, but at the end of the day, these discussions won't change a damn thing. At best, an anti trans reactionary becomes marginally more afraid to go out in public (a good thing lmao), and at worst, collectively, society decides to implement more unenforceable laws that primarily affect and hurt gender nonconforming (and often cis, butch) women.\n\nI look like a woman, am a woman. I've used the women's restroom. I've never had a problem.\n\nPeople can have these discussions about where people should pee all day but I already know which bathroom to use. Please, spend hours debating over what bathroom you think trans people should use. It's entertaining to me, and at the end of the day, it won't change a damn thing.\n\nOr maybe we can find a better discussion topic.\n\nPS: Can't wait for the next \/u\/lilqueerkid post here. Shoutout to my fellow trans homies o\/","title":"The trans bathroom debate is stupid and funny","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/1ae0hcd\/the_trans_bathroom_debate_is_stupid_and_funny\/"}
{"author":"Indrid_Cold23","created_utc":1730414177000,"id":"1ggg173","num_comments":84,"permalink":"\/r\/Discussion\/comments\/1ggg173\/the_reason_conservatives_are_so_obsessed_with\/","score":48,"selftext":"If they SA someone that appears to be a woman and they turn out to be a trans-woman, that would make them gay.\n\nThis is why they're so obsessed with \"defining women.\" They need to know what's in your pants so they can assault you without damaging their own sense of self. ","title":"The reason conservatives are so obsessed with trans folk is because they don't know who to SA anymore.","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/1ggg173\/the_reason_conservatives_are_so_obsessed_with\/"}
{"author":"WhatsAButterz","created_utc":1600076888000,"id":"isbjal","num_comments":27,"permalink":"\/r\/Discussion\/comments\/isbjal\/the_term_karen_is_becoming_too_broad_not_every\/","score":49,"selftext":"I love watching Karen freak outs but there are a lot of Karen freak out videos where the female is not acting like a Karen. Just because you are angry and yelling doesnt mean that you are acting like a Karen. Everybody gets mad. We are all human.\n\nTo me, this is the definition of a Karen: an entitled woman who thinks that they can verbally bully others into getting their way via screaming and spouting their rights that nobody cares about. A Karen is almost always the aggressor who started the drama.\n\nIf we let the word Karen become too broad then all women (and men) are subject to being called a Karen (or Gary) the next time they get upset in public and I dont think that is fair. Let us focus our hate on the TRUE Karens that need to be exposed for acting like big crybabies in public.\n\nWhat do y'all think?","title":"The term Karen is becoming too broad. Not every angry female is a Karen.","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/isbjal\/the_term_karen_is_becoming_too_broad_not_every\/"}
{"author":"molotov__cocktease","created_utc":1730499004000,"id":"1gh6au5","num_comments":77,"permalink":"\/r\/Discussion\/comments\/1gh6au5\/republican_policy_continues_to_kill_women\/","score":48,"selftext":"\"Nevaeh Crain was crying in pain, too weak to walk, blood staining her thighs. Feverish and vomiting the day of her baby shower, the 18-year-old had gone to two different emergency rooms within 12 hours, returning home each time worse than before.\n\nThe first hospital diagnosed her with strep throat without investigating her sharp abdominal cramps. At the second, she screened positive for sepsis, a life-threatening and fast-moving reaction to an infection, medical records show. But doctors said her six-month fetus had a heartbeat and that Crain was fine to leave.\n\nNow on Crain’s third hospital visit, an obstetrician insisted on two ultrasounds to “confirm fetal demise,” a nurse wrote, before moving her to intensive care.\n\nBy then, more than two hours after her arrival, Crain’s blood pressure had plummeted and a nurse had noted that her lips were “blue and dusky.” Her organs began failing.\n\nHours later, she was dead.\"\n\nhttps:\/\/www.propublica.org\/article\/nevaeh-crain-death-texas-abortion-ban-emtala\n\nThis completely preventable death was the extremely obvious result of Republican abortion policy, which does not view women as inherently people, but property. \n\nA braindead, childlike calculation of harm reduction - banning abortion and treatment for miscarriages will save fetuses - has (again, extremely obviously) INCREASED harm by killing both the mother and the child.\n\nTrump has flip flopped on wanting a national abortion ban (https:\/\/www.npr.org\/2024\/04\/10\/1243942019\/trump-abortion-ban-arizona-supreme-court-florida-6-week-ban), but the man is senile, a serial liar, and an opportunist, so it's probable he would allow one. \n\nJD Vance, a heritage foundation lackey who promotes project 2025, has advocated for a national abortion ban throughout his career (https:\/\/www.cnn.com\/2024\/07\/17\/politics\/kfile-jd-vance-abortion-comments\/index.html).\n\nDiscussion:\n\nWhy do Americans refuse to believe what Republicans will do if elected, even if Republicans directly say it?\n\nNevaeh Crain should still be alive. How would you sell rational, serious harm reduction policy to convince pro-forced birth people?\n\nHow does any rational person see the perpetually negative impacts of Republican policy and decide that \"Both parties are the same\"?\n\nIs it *purely* misogyny that guides Republican policy towards women?","title":"Republican policy continues to kill women.","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/1gh6au5\/republican_policy_continues_to_kill_women\/"}
{"author":"deleted","created_utc":1704278749000,"id":"18x8bie","num_comments":1124,"permalink":"\/r\/Discussion\/comments\/18x8bie\/republicans_are_a_threat_to_our_way_of_life\/","score":50,"selftext":"This is a fight between good vs. evil. Educated vs. ignorant. Right vs. wrong. Facts vs. feelings. Empathy vs. apathy. Democracy vs. Fascism. And we need to STOP pretending otherwise. I mean look at the jobs they take: \n\nHigher percentage Republican: Missionary (88%), Logger (86%), Electrical Contractor (83%), Trucker (79%), Roofer (78%), Mason (75%), Orthodontist (70%), Police Officer (68%), Catholic Priest (66%), Bond Trader (65%), Neurosurgeon (65%), Finance Advisor (64%), Surgeon (58%), Investment Banker (54%)  \n\nHigher Percentage Democrat: Union Organizer (96%), Data Scientist (95%), Environmentalist (93%), Clinical Social Worker (91%), High School Teacher (95%), Nanny (82%), Woodworker (80%), Programmer (76%), Cook (75%), Ob\/Gyn (72%), Factory Worker (52%), Founder\/CEO (71%), Custodian (52%) \n\nAfter evaluating the evidence there's only one logical conclusion: \n\n**\"Look voters, one side deeply cares about others: our children, our downtrodden, our workers, our women, our environment. Yet that never blinds them to the cold hard facts. And even though many are just average joes like yourself trying to make their way, they have no trouble being successful self starters when they set their minds to it.**\n\n**Now the other side, well, they clearly only care about themselves and harming others: it's all money, religion, and law and order with these guys. It is obvious many lack higher education, enjoy power tools, and exhibit anti social behavior. They hide on roofs and in trucks, and the only time you'll ever see them in a humanity field is to cut them up.\"**\n\nWAKE UP PEOPLE. Before it's too late... \n\nSource: a comment listing those jobs based on this article \n\nhttps:\/\/www.zippia.com\/advice\/democratic-vs-republican-jobs\/","title":"Republicans are a threat to our way of life","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/18x8bie\/republicans_are_a_threat_to_our_way_of_life\/"}
{"author":"JetTheMaster1","created_utc":1713047963000,"id":"1c33h40","num_comments":67,"permalink":"\/r\/Discussion\/comments\/1c33h40\/more_and_more_its_looking_like_republicans_will\/","score":47,"selftext":"Putting aside that their candidate is a legally answerable sexual assaulter ( https:\/\/www.documentcloud.org\/documents\/23317687-e-jean-carroll-v-donald-trump-112422 ) I think that republicans are in for a world of hurt come November, and they will need a miracle to win the presidential election. \n\nThe country is overwhelmingly supportive of abortion in at least some cases; only 13% say it should always be illegal.  ( https:\/\/news.gallup.com\/poll\/321143\/americans-stand-abortion.aspx ) Abortion was a fantastic issue for the right for decades, because it was always low-hanging fruit to get voters to the polls. When the Republican party married itself to Evangelical Christianity in the late 70s and early 80s, they made restricting abortion a political, moral, and spiritual cornerstone of their party. Save babies - vote Republican!\n\nBut ever since Roe was repealed, it's been a double-whammy against the GOP. First, now their voters aren't as motivated to vote. Why would they be? The one issue that single-issue voters cared about has now been \"solved.\" And since the Supreme Court made it so that it's up to states to decide what restrictions should be on abortion access, once a red state enacts a huge restriction or ban on abortion, there's no risk of it being overturned unless a Constitutional amendment passes - which won't happen at a federal level.\n\nThe shoe is now on the other foot - now voters who DO care about abortion are especially motivated to vote. And why would they vote for the GOP politicians who overturned their right to an abortion in the first place? Since Roe was repealed, the GOP has seen massive backlashes in several states that once leaned red or were deep purple. ( https:\/\/www.reuters.com\/world\/us\/how-abortion-could-impact-2024-us-elections-2023-12-14\/ ) The 2022 election, which had been expected to deliver a large amount of seats to Republicans, fell flat for them instead. Conservative states like Ohio, Kansas and Kentucky have had election results turn in favor of pro-reproductive right initiatives (and thus Democrats over Republicans). And horror stories about the \"unintended\" consequences of banning abortion - which were screamed from the rooftops by liberals and widely ignored or mocked as being unrealistic by conservatives - are constantly popping up in the news, keeping the issue fresh in the minds of voters. People are horrified when reading about women forced to keep miscarried fetuses, or birth children who die within days in horrible pain, or forcing underage rape victims to give birth. Doctors - especially those involved in OB-GYN capacities, are fleeing from the states with the worst restrictions, impacting everyone seeking healthcare.\n\nhttps:\/\/www.vanityfair.com\/news\/roe-gop-abortion-restrictions\n\nhttps:\/\/www.nytimes.com\/2023\/09\/06\/us\/politics\/abortion-obstetricians-maternity-care.html\n\nArizona in particular is a good example because the state is very narrowly blue and Trump lost there last election. It was expected to be a key battleground state for the 2024 election, but with the AZ Supreme Court ruling, AZ voters are extremely riled up. Riled up people tend to turn out to vote, making the GOP campaigns both locally and nationally much more difficult.\n\nSo yes, any republican you hear saying that there is going to be a “red wave” or some such nonsense this November is coping on levels never seen before. They are going to need a miracle to win the election. \n\n","title":"More and more it’s looking like Republicans will need a miracle to win the election this year","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/1c33h40\/more_and_more_its_looking_like_republicans_will\/"}
{"author":"NaturalCard","created_utc":1708642522000,"id":"1ax8bjx","num_comments":211,"permalink":"\/r\/Discussion\/comments\/1ax8bjx\/both_the_israeli_government_and_hamas_are_in_the\/","score":47,"selftext":"Hamas are a terrorist organisation which kidnaps Israelis and uses Palestinians as human shields. This obviously is bad.\n\nThe IDF has a 29000 death total, 2\/3s of which are women and children, with a daily death rate higher than any other 21st century conflict. This also is obviously bad.\n\nThoughts?","title":"Both the Israeli government and Hamas are in the wrong.","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/1ax8bjx\/both_the_israeli_government_and_hamas_are_in_the\/"}
{"author":"MenLover4","created_utc":1668994102000,"id":"z09u83","num_comments":187,"permalink":"\/r\/Discussion\/comments\/z09u83\/unpopular_opinion_people_who_respects_jamie_vardy\/","score":46,"selftext":"Why can't these people accept us for who we are? They need to stop discriminating us. Just bcuz people are used to seeing a man and a women together. Doesn't mean you have to be a bitch about it. They don't understand why people like us is being celebrated. Bcuz being attracted to people your own gender used to be a crime back in the old days and it still is in some countries.\n\nIdk why Jamie did what he did. only he and the people who are close to him knows. But i understand that LGBTQ doesn't have to do anything with soccer. But as a gay person myself it hurts my feelings seeing alot of people thinking what this guy did was a good thing.\n\nAnd people are tweeting that he was forced to sign the flag bcuz these stupid brainless homophobic are assuming that the man was forced to sign the flag bcuz they want him to be homophobic. Probably the homophobic Gen Zs\n\nI am not mad at Jamie Vardy for breaking that flag during soccer match. I just don't trust anyone who supports what he did.\n\nSorry for my bad english btw, it's not my everyday language","title":"unpopular opinion: people who respects Jamie Vardy for breaking that rainbow flag during soccer match are dumb toxic homophobic jerks.","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/z09u83\/unpopular_opinion_people_who_respects_jamie_vardy\/"}
{"author":"lilqueerkid","created_utc":1711346104000,"id":"1bmwnrq","num_comments":1203,"permalink":"\/r\/Discussion\/comments\/1bmwnrq\/do_transphobes_really_want_trans_women_in_the\/","score":48,"selftext":"Imagine you're going to the pool. You bring your son to the men's room and immediately see a trans woman in a state of undress. Do you think it's appropriate for your son to see a a naked woman while getting dressed at a locker room? Do you think it's appropriate for trans men with beards and muscles to enter the women's restroom? Seriously think about the ramifications of what you're asking for. It doesn't protect anyone.","title":"Do transphobes REALLY want trans women in the mens facilities and trans men is the women's?","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/1bmwnrq\/do_transphobes_really_want_trans_women_in_the\/"}
{"author":"Complex-Judgment-420","created_utc":1697836183000,"id":"17cax79","num_comments":379,"permalink":"\/r\/Discussion\/comments\/17cax79\/the_change_in_toxic_gender_behavior\/","score":46,"selftext":"Ive noticed sooo many more comments about women being sluts who only want tall rich guys and who are completely emotionally and morally  depraved. Its pretty crazy how much abuse women are getting on the internet, and its far more widespread than hate towards men. The justification is \"well women have toxic standards too\", but you don't see those standards in the comments of every youtube video, other than those written by disgruntled men? Comment after comment about why guys can't get a girlfriend because they're all \"used up hoes\" who can't \"pair bond\" like we're some animal is becoming such a prevalent belief.  Its such a complicated mess at this point, the misogyny is starting to get worse than the women with unrealistic standards. Men don't get told anything they say is irrelevant because they're men, women are devalued just for being women\n\n&#x200B;\n\nWe all need do better. Revenge and bitterness only breeds more insecurity. Assumptions and judgement prevent personal growth\n\n&#x200B;\n\n&#x200B;\n\nEdit: Bunch of boys come in saying exactly what I was talking about \"women don't understand, most women are too fat for our standards, women only want muscles, women will leave you for the next tinder swipe\" its so stupid its unbearable","title":"The change in toxic gender behavior","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/17cax79\/the_change_in_toxic_gender_behavior\/"}
{"author":"deleted","created_utc":1711890506000,"id":"1bs2hay","num_comments":197,"permalink":"\/r\/Discussion\/comments\/1bs2hay\/do_guys_and_girls_like_innies_or_outies_better\/","score":47,"selftext":"I’m 20F and bisexual. I recently discovered that not everyone has the same type of vagina and am becoming a little insecure.\n\nThis question is for both straight men and gay women: When it comes to sex what do you guys prefer, outie or innie vaginas? \n\nMy lesbian friend said that most gay girls hate innies cuz they’re hard to work with in bed. I have never had sex with a girl before so this made me scared to now\n\nTwo of my male friends also said they prefer outies so, is this what majority of people prefer?\n\nI am aware men will have sex with a McDonalds McChicken I am not looking for those type of answers. I just am curious what your individual personal preferences are or what majority of men\/women’s are","title":"Do guys and girls like innies or outies better?","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/1bs2hay\/do_guys_and_girls_like_innies_or_outies_better\/"}
{"author":"bluelifesacrifice","created_utc":1750996999000,"id":"1lla44r","num_comments":37,"permalink":"\/r\/Discussion\/comments\/1lla44r\/its_weird_how_the_christian_right_are_scared_of\/","score":44,"selftext":"This really is just Theocratic Tribalism of Despot leaders trying to antagonize and attack everyone else while we all suffer the consequences of their violence. \n\nBoth demand a strict personal moral code such as prayer, how you spend your time, how you dress, what you say and even how you date. \n\nBoth have strict controls over women in general, pushing to empower men over women. \n\nBoth demand religious texts replacing history and science in terms of education and behavior. \n\nBoth demand forced indoctrination of religious beliefs and obedience. \n\nIt's a lot of picking and choosing but at the surface level, we see these same, poverty creating controls applied to the masses by those in power. Casually ignoring anything that challenges power such as limited interest rates, abolishing poverty, helping the poor and even allowing for religious freedom. \n\nThis propaganda front of using a religious text to control the masses is incredibly effective. We see it time and again with the rise of some \"Strong man\" Despot leader that blames minorities for problems the wealthy created and promise the wealthy power, freedom and safety while keeping the masses in so much debt and poverty they can't even advocate for a basic living. \n\nWe watch these leaders arm their obedient, hopeful followers with guns, flags and glory to their religion to self sacrifice all to serve their leaders and ensure those leaders never have to work a real day in their lives. \n\nI don't know how to teach the masses methods of fighting this bs but it is an ongoing, persistent problem that I've grown up with in the States. It's everywhere. Its in our social media, our news, social events and it's always the same kind of people who are glory eyed to worship and self sacrifice to serve fraudsters. \n\nThe same, bs arguments to keep people underpaid, overworked, over charged and blaming others for artificial problems. ","title":"It's weird how the Christian Right are scared of Sharia law which is basically a rebranded, slightly different version of the Christian laws they are trying to pass.","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/1lla44r\/its_weird_how_the_christian_right_are_scared_of\/"}
{"author":"Electrical_Crew_6352","created_utc":1723774218000,"id":"1et23hz","num_comments":210,"permalink":"\/r\/Discussion\/comments\/1et23hz\/christian_voting_for_kamala\/","score":44,"selftext":"I saw a clip of Matt Walsh saying that if you’re christian you have a moral obligation to vote against Kamala because she’s evil and doesn’t align with our values. Obviously the usual laughable and ridiculous content from Matt Walsh. However, I was surprised to see that there are actually conservatives that agree with this line of thinking and are voting for trump for this specific reason and this couldn’t be more funny to me. Like the lack of self awareness from these people is insane to me. Donald Trump has lived one of the least christian lives of any president we’ve ever had. If we just put policy aside this is a guy who has had sex with a pornstar, objectifies women, talks about sleeping with his own daughter, has multiple baby mothers, has made of fun of disabled people, is gluttonous, a liar, and not to forget an adjudicated rapist. Like at this point it has to be pure projection from conservatives. It also makes me wonder how do evangelical conservatives reconcile with the fact that their movement has become completely and totally centered around a man who doesn’t align with any of their values. I’m a christian and I’m voting for Kamala because I know to seperate the politics from religion. Even if I didn’t though I’m pretty sure the choice is still pretty clearly Kamala.  Don’t let trump fool you christian conservatives that man does not care about you guys, because as we all know that man only cares about himself and his image. ","title":"Christian voting for kamala","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/1et23hz\/christian_voting_for_kamala\/"}
{"author":"Rare-Tie5548","created_utc":1703676186000,"id":"18rqh37","num_comments":290,"permalink":"\/r\/Discussion\/comments\/18rqh37\/scientific_research_shows_sex_to_be_a_better\/","score":43,"selftext":"https:\/\/www.kcl.ac.uk\/news\/indicators-of-sports-performance\n\nhttps:\/\/thecritic.co.uk\/when-sex-matters-more-than-gender-identity\n\nThat is, men outperform women by the same margin even if they call themselves non-binary. In other news, water is wet. I look forward to further papers in this series: 'Sex is a better predictor than gender identity of ability to become pregnant', 'Sex is a better predictor than gender identity of propensity to be violent' and other fascinating insights.","title":"Scientific research shows sex to be a better predictor of sports performance than gender identity","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/18rqh37\/scientific_research_shows_sex_to_be_a_better\/"}
{"author":"deleted","created_utc":1701652949000,"id":"189y8t6","num_comments":961,"permalink":"\/r\/Discussion\/comments\/189y8t6\/why_do_people_get_so_upset_about_the_concept_of\/","score":45,"selftext":"It's almost like trans people want to be thought of as just men and women, rather than also being trans men and trans women.\n\nBut isn't that just rejecting themselves as trans? I think there is nothing wrong with being trans. So why not embrace it? It's like if Gay men wanted to be thought of just as straight men, and no different.\n\nI mean, that idea makes sense to me. Who cares what your fucking sexuality is? But at the same time, we make distinctions in language for a very practical reason: distinctions exist!\n\nSo if people say there are no differences between biological women and trans women, how do they not realize they, themselves, are saying there is something less about being trans? Or something wrong with it?\n\nIt's not wrong and it's not less. It's just different to be trans. And that's not an opinion. It's a fact.\n\nIf we keep rejecting facts, how do we think we're ever going to grow as a society?","title":"Why do people get so upset about the concept of biological vs. trans men and women?","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/189y8t6\/why_do_people_get_so_upset_about_the_concept_of\/"}
{"author":"deleted","created_utc":1687731876000,"id":"14inkdq","num_comments":84,"permalink":"\/r\/Discussion\/comments\/14inkdq\/many_men_dont_actually_love_revere_or_respect\/","score":45,"selftext":"Many men don’t truly respect or love their S\/O. They enjoy their partner bc of what they can DO FOR THEM or how they make them appear to the rest of the world.  Much more-so than women, who more often, seem to genuinely love there husband as a person.\n\nThis is likely why 21% of men leave a spouse if she becomes chronically ill as compared to on 3% of women who leave a chronically ill husband. Likewise, 25% of men cheat on their wives as compared to 10% of women that cheat on their husbands.\n\nAlso, many men don’t really care if their wife\/Significant Other is unhappy. As long is doesn’t impede on his time or impair his life, they are indifferent. They often prefer her to just suffer in silence than to address any issues with their own behavior or actions. They will also turn her expression of a need or want around on her and call her a b*tch or a nag.\n\nTHIS is likely why 70% of divorces are initiated by a woman. They simply get SICK AND TIRED (and often quite literally ill) of the endless drudgery of providing so much free labor, labor on so many levels. It’s especially frustrating bc most women ALSO WORK. \n\nIt’s also a big contributing factor to why an established older woman would rather “live alone with her cats” than remarry or even cohabitate. Plus let’s face it, even an old, heavy and\/or not traditionally attractive woman can still ALWAYS catch a D!  \n\nIt is also probably why men have had to subjugate women throughout history. Women don’t need men the way men need women! If she has the means, she can simply hire any brawn she needs to and not have to play nurse\/maid to another grown adult.\n\nEDIT- only ONE comment replied to this with with RESEARCH. That RESEARCH furthered my assertion. \n\nI am not a man hater. I am calling out what I have SEEN, backing up with research, and asserting some reasons as, from my observations and experience, why the STATISTICS are what they are.","title":"MANY men don’t ACTUALLY love, revere, or respect their S\/O’s-wives and that’s why there’s so many divorces","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/14inkdq\/many_men_dont_actually_love_revere_or_respect\/"}
{"author":"Plus-Trick-9849","created_utc":1735430520000,"id":"1ho8m77","num_comments":67,"permalink":"\/r\/Discussion\/comments\/1ho8m77\/so_why_are_women_still_looked_at_negatively_for\/","score":43,"selftext":"With how sexualized a society we have become. It surprises me that women are still called “promiscuous” or “used” because we have sex. I don’t understand how men hold it against us when they are the ones having sex with us! Maybe if we stop having sex with them, then they don’t have anyone to have sex with, no longer get sex, so they will stop complaining about us having sex. We either have sex & men get sex or we “save ourselves” & men can complain about us being prude. Can’t win. ","title":"So why are women still looked at negatively for having sex?","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/1ho8m77\/so_why_are_women_still_looked_at_negatively_for\/"}
{"author":"deleted","created_utc":1724999367000,"id":"1f4fgoq","num_comments":69,"permalink":"\/r\/Discussion\/comments\/1f4fgoq\/how_would_you_break_this_down\/","score":42,"selftext":"Mom sent me this after I called out Trump using dead veterans as a photo op. I don’t even know where to start.\n\n“Again you are literally just giving me democrat talking points. Its ok if you don't see things like i do. I am not changing my mind and will be voting for trump over a women that no one even voted for thatvdid not follow the democratic process and is too retarded to say anything off script. Im voting for lower taxes, lower interest rates so maybe i can buy a home. Lower gas and food prices. A better economy where people can actually thrive instead of survive. You are making the mistake thinking im just voting for a person. I am voting for policies that i believe in and that will help this country. Im voting to close our borders to illegal immigrants, drugs and sex trafficking.  Im voting for an america that has a backbone and can stand up to and for our enemies and allies. I am not voting for Trump because he is a perfect person but because he is an intelligent businessman with a backbone who can make America better. Who will stand up for the constitution.  Who will fight for our first and second amendments. If kamala is voted in this country will only get worse as they keep handing more power over us off to the globalists and try to make us a marxist and communist country. Id rather not be Venezuela. Although we are already awfully close to it”\n\nEdit: After some more back and forth Ive given up as everything even slightly critical of Trump or the repubs is now just a “democrat talking point”.","title":"How would you break this down?","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/1f4fgoq\/how_would_you_break_this_down\/"}
{"author":"ask3r","created_utc":1598512750000,"id":"ih9ueg","num_comments":132,"permalink":"\/r\/Discussion\/comments\/ih9ueg\/why_do_many_people_say_german_women_are_ugly\/","score":42,"selftext":"I think it’s a stereotype based on the anti-German sentiments. There are many beautiful women in Germany and there is about the same percentage of beautiful women in every nation IMO.\n\nAlso, the perception of beauty is subjective ...","title":"Why do many people say German women are ugly?","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/ih9ueg\/why_do_many_people_say_german_women_are_ugly\/"}
{"author":"Joeylaptop12","created_utc":1738805046000,"id":"1iifdue","num_comments":39,"permalink":"\/r\/Discussion\/comments\/1iifdue\/the_right_wing_republicans_were_always_awful\/","score":38,"selftext":"Trump is merely a continuation. Believing otherwise is ahistorical. Whether being evil is a historical norm is another issue \n\nThe first iteration of the Republican party started noble enough. Wanting to free slaves and such.  The second iteration was pro-business, workers be damned. The third iteration was isolationist, pro-tariff, and sometimes even pro-hitler. To the point that Prescott Bush, George W Bush’s grandfather, did business with the nazis\n\nThe fourth iteration was Ike and Nixon trying to fit into the new deal consensus with an occasional goldwater\/john birch type waiting in the wings. The fifth iteration was pro business, invade everyone with Reagan\/Bush\/Bush. \n\nThe sixth and most current iteration reminds me most of the third iteration Isolationist, pro tariff, and [yes sometimes pro-hitler](https:\/\/www.nbcnews.com\/news\/amp\/rcna189316)\n\nAll this to say, saying the republicans were ever “sane” is incorrect. The stability of the system was based on agreement to suppress women and people of color. Now that they have more say the system is crumbling \n\nWith the exception of the abolitionist, Lincoln,  and Theodore Roosevelt  ","title":"The right wing Republicans were always awful","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/1iifdue\/the_right_wing_republicans_were_always_awful\/"}
{"author":"cassla3rd","created_utc":1717553896000,"id":"1d842ak","num_comments":496,"permalink":"\/r\/Discussion\/comments\/1d842ak\/why_do_conservatives_hate_people_being\/","score":41,"selftext":"I don't understand how what used to be the small government party has become what it is. I mean last year they pitched a fit over a trans women being on a can of beer that never even hit store shelves.\n\nNow they advocate for bans for the proven most effective treatment for gender dysphoria, try to restrict access to said treatment until after it's lost all it's effectiveness, and try to lump trans and queer people in with predators.\n\nWe just wanna be comfortable in our own damn bodies, why is that wrong in their eyes?","title":"Why do conservatives hate people being comfortable in their own bodies?","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/1d842ak\/why_do_conservatives_hate_people_being\/"}
{"author":"deleted","created_utc":1735761100000,"id":"1hr1if9","num_comments":104,"permalink":"\/r\/Discussion\/comments\/1hr1if9\/would_you_agree_that_one_of_the_reasons_some_men\/","score":39,"selftext":"Would you agree that one reason some men are hesitant to approach women and say “hi” is the fear of being labeled as creepy or accused of sexual harassment, given the current social climate?\n\nHere in the UK, the criminal justice system is quite complex, and if someone is accused of anything related to sexual harassment, proving innocence can be incredibly difficult. The system is already overwhelmed, with significant court backlogs, making the process even more daunting. As a result, some men—particularly those who are aware of how the system works—choose not to take the risk at all.\n\nSo, I believe it’s better for women who are interested in someone to take the initiative. If you like a guy and want to date him, just go ahead and say “hi,” because the chances of men approaching you first have become much lower in this environment.","title":"Would you agree that one of the reasons some men no longer approach women is the fear of being labeled as creepy?","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/1hr1if9\/would_you_agree_that_one_of_the_reasons_some_men\/"}
{"author":"MwahMwahKitteh","created_utc":1588358094000,"id":"gbfqn6","num_comments":47,"permalink":"\/r\/Discussion\/comments\/gbfqn6\/banning_abortion_promotes_undeveloped_fetuses_to\/","score":38,"selftext":"If we take away women's right to decide what they do with their own bodies, and outlaw abortion, we're reducing them to mere incubators. Objects, not humans. So why are the undeveloped fetuses treated as more human than the mothers are, with more rights? \n\nThe argument that the \"baby killers\" don't deserve human rights but the babies do isn't sound bc personality and behavior isn't just nurture, it's also nature. Meaning they share many of the same traits and tendencies as their maternal parent. They might very well do the same thing when they grow up.\n\nAnd why does the paternal parent get off scott free in all of this? Why isn't he denied rights or punished for his part? \n\nWhy is a not fully formed fetus entitled to more choices and control over their bodies than their mothers? \n\nAnd why is anyone else's body anyone else's business in the first place?","title":"Banning abortion promotes undeveloped fetuses to human status while demoting women to incubators.","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/gbfqn6\/banning_abortion_promotes_undeveloped_fetuses_to\/"}
{"author":"Natural-Word-6456","created_utc":1702832257000,"id":"18kd7y3","num_comments":751,"permalink":"\/r\/Discussion\/comments\/18kd7y3\/feeling_helpless\/","score":40,"selftext":"I am so sad about where women’s rights are going in this country. I barely talk to any of my family and friends anymore because even the ones who agree with me don’t seem to really care. Everyone is like “ move on, live your life”. \n\nI can’t believe there are people who actually believe I don’t deserve to control what happens to me because I have a uterus….and it’s socially acceptable to say that out loud….\n\nI don’t think I will ever get over it. Has anyone else dealt with this intense prolonged mourning after realizing how others actually perceived you? I can’t believe they think women should be regulated in this way against their will. It feels like complete lack of respect.","title":"Feeling helpless","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/18kd7y3\/feeling_helpless\/"}
{"author":"DebtApprehensive1510","created_utc":1739506940000,"id":"1iosjuo","num_comments":135,"permalink":"\/r\/Discussion\/comments\/1iosjuo\/people_who_are_against_abortion_are_completely\/","score":36,"selftext":"I mean, yes, we already know that typical cuckservatist response of \"abortion only works for unwanted babies\", but what about women who end up pregnant after having been raped before?, What about lower class women who end up pregnant even when using condoms because those are of poor quality? What about that?","title":"People who are against abortion are completely stupid.","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/1iosjuo\/people_who_are_against_abortion_are_completely\/"}
{"author":"CockySpeedFreak33","created_utc":1721619865000,"id":"1e8uqft","num_comments":51,"permalink":"\/r\/Discussion\/comments\/1e8uqft\/what_have_republicans_done_the_last_35_years_to\/","score":37,"selftext":"Can ordinary Americans relate to these rich old Republicans who talk down on the poor? Are women pissed at Republicans? Will there be a blue wave in November?","title":"What have Republicans done the last 35 years to help ordinary Americans? Why do they always cause recessions?","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/1e8uqft\/what_have_republicans_done_the_last_35_years_to\/"}
{"author":"ShafordoDrForgone","created_utc":1720903083000,"id":"1e29ft8","num_comments":61,"permalink":"\/r\/Discussion\/comments\/1e29ft8\/worried_about_gaffes_im_worried_about_criminality\/","score":35,"selftext":"* He sent an armed mob to threaten our elected representatives. He removed the metal detectors to allow them to bring weapons. He refused to call in support for the police. And at any time, he could have called them off. He waited for hours to do so\n* He sent fraudulent electors to submit fraudulent votes for him\n* He called the governor of Georgia and attempted to coerce him into doctoring the vote tally\n* He is, was, and always had been aware of the fact that he lost the 2020 election. Every Trump supporter and their mom, with the presidency on the line, filed every lawsuit they possibly could. Not one of them provided evidence of any kind. Multiple states wasted millions of tax dollars on multiple audits, also finding absolutely nothing\n* He kept boxes of classified documents. He refused to return them when asked, subpoenaed, and then even after a warranted search. He lied that he had more and had his employees try to hide them. He showed those leaked documents to at least one reporter and another foreign national\n* He held up aid for Ukraine appropriated by law by Congress, in an attempt to extort Zelensky into lying about Biden\n* He raped E Jean Carroll, at the very least digitally (with his fingers), according to \"a preponderance of evidence\" as determined by a jury. The entire country heard him say that he grabs women \"by the pussy\". He \"doesn't even wait\". When you're famous \"you can do anything\"\n* He committed election fraud by failing to report the money used to silence the porn star, Stormy Daniels, from making public the extramarital affair they had. Again, determined by a jury, this time \"beyond a reasonable doubt\" making Trump a felon\n* He committed tax fraud by reporting his worth in one place differently than another place, often with values multiple times an easily measured value. For example, square footage.\n* I'll stop here, but I'm leaving out plenty: running a fraudulent university, stealing from his own charity, among a lifetime of other scams\n\nAll of this, before he was granted total immunity for anything \"official\" while in office","title":"Worried about gaffes? I'm worried about criminality and total immunity","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/1e29ft8\/worried_about_gaffes_im_worried_about_criminality\/"}
{"author":"AppropriateGround623","created_utc":1712125674000,"id":"1bubyv0","num_comments":80,"permalink":"\/r\/Discussion\/comments\/1bubyv0\/shakira_says_her_11_year_son_found_barbie\/","score":35,"selftext":"She says in her interview that we can empower women without taking away from men what it means to be a man, that is protecting and providing. Goes on to repeat conservative mantra that men and women have complementary roles, and is raising her two boys to be masculine. \n\nBen Shapiro also made a 43 mins long video criticising the movie. Elon made a mockery tweet about it. \n\n\nFirst, how come an 11 year old even knows the term emasculation? It’s actually your own belief. Own it instead of shooting your gun off your child’s shoulder. \n\nSecond, no conservative is obligated to watch the barbie. Make your children watch American Psycho or plethora of other movies if you want them to feel masculine. \n\nThird, what did you expected from the movie named barbie? It was supposed to be feminine. It’s like me expecting movies regarding wars or history not be more masculine than feminine. \n\nLast but not least, if your masculinity or femininity, whatever that means to you, is threatened by a movie, it’s very fragile to begin with. ","title":"Shakira says her 11 year son found Barbie emasculating. What is this conservative obsession with the movie?","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/1bubyv0\/shakira_says_her_11_year_son_found_barbie\/"}
{"author":"bill-nyethespy1","created_utc":1731093831000,"id":"1gmgbd9","num_comments":40,"permalink":"\/r\/Discussion\/comments\/1gmgbd9\/the_taliban_is_legit_gay_and_not_gay_as_a_slur_i\/","score":34,"selftext":"How come no one has pieced together the hate for women for years when it’s clear as day that they are not only hateful but revolted by women. Please watch a documentary about the Bachs Bazi epidemic in Afghanistan. It’s more common than you would assume. On top of them being grossed out by women they prey on little boys. Those same boys are grooming to dance and work as male dancers when they get older. For heaven’s sake they have a saying that’s, “men are for pleasure and women are for babies.” It’s sort of a well known hidden secret but since in Islam being gay is prohibited they are very secretive about it yet everyone knows about it. I also want to mention this also proves that this much of a culture issue and not a religious one obviously. I’m not sure what it is but a lot of afghan men even here tend to be on the down low or openly gay but the number is sort of staggering, I don’t know why that is. ","title":"the Taliban is legit gay and not gay as a slur. I mean homosexual. ","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/1gmgbd9\/the_taliban_is_legit_gay_and_not_gay_as_a_slur_i\/"}
{"author":"GitmoGrrl1","created_utc":1724181646000,"id":"1ewsyci","num_comments":54,"permalink":"\/r\/Discussion\/comments\/1ewsyci\/joe_biden_is_a_credit_to_his_race\/","score":32,"selftext":"Traditionally, when an African-American has proven themselves to be a good person, patriotic or selfless, white Americans have said \"he's a credit to his race.\"\n\nA lot of white politicians have made promises to the black community only to fail to do anything. Then they come around at the next election and say \"sorry about that but elect me this time and I promise to do what I didn't do before.\" Rinse and repeat endlessly.\n\nJoe Biden has kept his promises. He chose Kamala Harris as his vice President. He's put an incredibly qualified African-American woman on the Supreme Court. He's appointed more African-American women to the Judiciary than all previous presidents combined.\n\nJoe Biden has kept his promises to the African-American community. He's a credit to his race.","title":"Joe Biden Is A Credit To His Race","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/1ewsyci\/joe_biden_is_a_credit_to_his_race\/"}
{"author":"Jaster22101","created_utc":1744984378000,"id":"1k1xr7t","num_comments":135,"permalink":"\/r\/Discussion\/comments\/1k1xr7t\/i_tried_to_speak_up_about_the_phrase_its_all_men\/","score":34,"selftext":"I just need to get this off my chest because it’s been eating at me.\n\nI joined a TikTok Live recently where the topic was patriarchy and the phrase “it’s all men.” I came in respectfully, calmly, and in full support of the bigger picture—I said straight up that I believe patriarchy exists, that men benefit from it, and that women’s anger and fear are valid.\n\nBut I raised a point about the language being used. I said that when we use phrases like “it’s all men,” we run the risk of alienating people who might actually be open to learning—but aren’t fully informed yet. That kind of broad messaging, while emotionally charged and understandable, often pushes people away who otherwise might have listened.\n\nI said that when people feel lumped in or talked down to, it creates resentment, and that resentment is exactly the kind of thing people like Andrew Tate feed on. He positions himself as the guy who “gets” them when everyone else calls them trash. And sadly, that works.\n\nWhat happened next?\nI got told to shut the fuck up.\nI got lectured on patriarchy like I hadn’t already acknowledged it.\nI got dismissed as “part of the problem” just for suggesting that strategy and communication matter.\n\nAnd here’s the part that really pisses me off: I’ve been hurt by women, too. Manipulated. Lied to. Emotionally torn apart. But I’ve never walked away saying “it’s all women.” I didn’t become bitter. I didn’t stop caring. I stuck around. I tried to be better. And when I finally speak up—calmly, mind you—just to say, “Hey, maybe there’s a more effective way to reach people,” I get shut down like I’m the damn enemy.\n\nApparently, trying to critique the language means I’m tone policing.\nApparently, giving a damn about how the message is received means I’m fragile.\nApparently, caring about the cause but wanting it to actually work means I’m just another guy in denial.\n\nI’m not. I’m just tired.\n\nTired of trying to be thoughtful and getting talked over.\nTired of making space for everyone else’s experience while being told mine doesn’t matter.\nTired of being treated like a punching bag just because I had the nerve to speak from the heart.\n\nCritique is not opposition.\nAsking if the message is effective is not tone policing.\nTrying to reach people who aren’t already in the choir isn’t betrayal—it’s strategy.\n\nAnd here’s the thing a lot of people don’t want to hear: this exact dynamic is part of why so many young men are being pushed into right-wing spaces and even voted for Trump.\nNot because they’re inherently evil or hate women—but because they feel unheard, dismissed, and villainized no matter what they say. When the only people who will “listen” to them are the loudest extremists, it creates a pipeline no one wants to admit exists.\n\nBut it doesn’t stop there.\nThis isn’t just about Tate. It’s not just about Trump.\nThis kind of messaging—and the way criticism of it is shut down—is feeding a broader feedback loop on social media that is actively worsening the gender divide. You can see it everywhere: men and women talking past each other, mocking each other, retreating into increasingly hostile echo chambers.\nAnd it’s not just digital noise. It’s having real-world consequences. Loneliness. Extremism. Distrust. Broken relationships. Polarization. And if we keep pretending that pushing away nuance is the right path forward, things are only going to get worse.\n\nI care about this. I care about people. I care about real change.\n\nBut sometimes, it feels like caring just makes you a target.\n\nThanks for letting me get this off my chest.\n\n\nTL;DR:\nI tried to respectfully critique the phrase “it’s all men” and got shut down, insulted, and labeled part of the problem. I wasn’t denying patriarchy—I was pointing out that this kind of language can alienate potential allies, fuel resentment, and feed toxic figures like Andrew Tate. It’s not tone policing to ask if the message is actually working. This kind of one-sided messaging is worsening the gender divide on social media and in real life, and it’s already having serious consequences. I care—and I’m exhausted from being treated like the enemy just for saying so.","title":"I tried to speak up about the phrase “it’s all men” and got told to shut the f*** up. I’m sick of being treated like the enemy just for caring.","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/1k1xr7t\/i_tried_to_speak_up_about_the_phrase_its_all_men\/"}
{"author":"ShafordoDrForgone","created_utc":1717545932000,"id":"1d80vv2","num_comments":72,"permalink":"\/r\/Discussion\/comments\/1d80vv2\/we_need_to_stop_demonizing_education_in_this\/","score":35,"selftext":"Look at where it has gotten us: half the country does not recognize even the most obvious lies from the most obvious career conman\n\nAnd if it's not clear that education is being attacked:\n\n* 900 (5% and growing) school districts have switched to 4-day school weeks\n* College is being described as an unnecessary scam to start young adults in debt\n* Moms For Liberty is out to burn any book that has anything to think about\n* Texas is turning libraries into detention centers (and no one thinks that's a clear sign of a larger problem)\n* Christian Nationalists are winning the fight to [turn public school into Sunday school](https:\/\/www.cnn.com\/2024\/05\/29\/politics\/louisiana-ten-commandments-classrooms\/index.html), and we have already seen [what happens when religion directs education](https:\/\/apnews.com\/article\/yeshiva-new-york-hasidic-investigation-224546cc4a2c654d0309acb959727ff6)\n* The push for Charter Schools sends public money to private companies with little to no oversight. It's fine for some communities, but is a vehicle for massive fraud in others\n* And more and more, both public and private schools are being directed by the loudest parents who themselves are uneducated. They have been trying to claim that anything they don't believe in is indoctrination (and with no irony at all). They are deciding for everyone else what children should learn\n\nAnd it all results in a country where most people (democrats included) are incapable of having the two most bare minimum of thoughts: \"why, really?\" and \"am I wrong?\"\n\nIf you don't believe me. Look at the next response you type and the one right below it. Do they show any signs of consideration for either justification or self reflection?\n\nI don't think it is a crime to be stupid or ignorant. It isn't even worthy of disrespect. What is abhorrent is the mass of loudly self righteous morons who actively avoid learning anything that might contradict what they believe. \n\nJust as an example: *\"gender\" means \"male\" or \"female\" and that's it*. Pure stupidity. Literally afraid of the number 3. Somehow they (kinda) made it past men putting their penises in other men's assholes, but men putting on women clothing is too much. And they call it \"science\"\n\nThing is, you don't have to know what science is. All you have to do to realize just how stupid it is is to ask \"why, really?\" Who wrote the dictionary definitions (plural) of \"gender\"? Why is it disrespectful to call someone a nickname they don't want to be called, but not disrespectful to call someone a name they don't want to be called? Why is it harmful for a child to see a man in woman's clothing but not to see a man in an easter buddy costume or in the lion king on broadway? If a transgender person walks into the men's room and no one knows he was assigned female at birth, does he make a sound?\n\nThese people who cannot ask themselves \"why, really\" do not know the difference between justified and arbitrary. That's why education looks like indoctrination: they've only ever known indoctrination. That's why they and we as a country need to be building education up. Not breaking it down as we have been","title":"We need to stop demonizing education in this country","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/1d80vv2\/we_need_to_stop_demonizing_education_in_this\/"}
{"author":"deleted","created_utc":1714792638000,"id":"1cjgxqn","num_comments":75,"permalink":"\/r\/Discussion\/comments\/1cjgxqn\/a_risk_expert_on_why_the_man_or_bear_thought\/","score":33,"selftext":"I have 26 years’ experience in conducting environmental and human health risk assessments, and added to that experience in human rights risk assessments in supply chains over the past five years. If all that has taught me anything, it’s that human beings are reliably terrible at innately comprehending and gauging risk. We are at the same time prone to grossly overestimate the actual risk of certain threats, while vastly underestimating other threats. Take vocal opposition to nuclear energy, for instance. A lot of people are terrified of the prospect of being near or downwind of a nuclear meltdown. Fair enough, however, in the 70 years since the first full scale civilian nuclear power plant went active, nuclear energy has proven to be far and away the safest source of electricity we have, with fewer attributable deaths per megawatt hour produced than any other electricity source, including wind and power. The problem is, people mistake “hazard” for “risk.” What would happen to you if you were exposed to radiation from a nuclear meltdown is the hazard, but risk is more than just hazard. Risk is the intersection of hazard and exposure; it factors in the severity of the hazard something presents along with the likelihood of being exposed to that hazard.\n\nThe ”man or bear” so-called “thought experiment” attempts to exploit humans’ misunderstanding of hazard vs risk, especially a common overestimation of the risk of wild animal attacks, but gets hazard\/risk wrong in every way possible. This isn’t just a matter of semantics, or an academic nitpick; the confusion the “thought experiment” creates is actually counterproductive to the important end goal of women being able to be safer in society.\n\nThe conclusion behind this viral meme is that most women would feel safer encountering a bear in the woods than a man because of the low number of bear attacks and the high number of cases of violence against women. This is the first major mistake this meme makes, and it’s all about exposure. The reason there are so few bear attacks is because there are only about \\~300,000 bears in all of North America to begin with, and those bears a dispersed throughout rural and wilderness areas where human population is low, while the vast majority of people spend most or all of their time in urbanized areas where there are no bears to be exposed to. Conversely, there are \\~165 million men in the US alone, and a woman is likely to cross paths with multiple men every day, that’s a level of exposure many orders of magnitude higher than exposure to a bear, so of course risk is going to be higher across a population even in hazard is much lower, that’s just how the math works.\n\nBut once a woman is out in the woods, and actually encounters a bear, or a man,  the relative exposure factor of the risk equation is out the window, you’re already exposed, and now it’s all about raw hazard. And this is where the meme makes its second major, and arguably more serious blunder – its misunderstanding of hazard. The hazard bears (or any other large animal you might encounter in the wild) present to humans they encounter is pretty evenly distributed across all bears. Sure, a mother bear, or a bear that has been habituated to human presence may present a somewhat elevated hazard, but by and large, any individual bear you come across has a relatively high hazard quotient by virtue of being several times larger and stronger than us, with big sharp pointy teeth and claws, and being wild animals and thus their behavior not being very predictable (even those not on cocaine) by the average hiker. The average individual human male, on the other hand, has a much lower hazard quotient – not only are we much closer to human females in size and lacking in teeth and claws, but we also have culture, social mores, and laws that the vast majority of human males abide by, and on top of that, because men and women are of the same species women innately understand human behavior better than they do bear behavior and can better judge whether a man might be a high hazard man or not. That’s the key thing, while bears are high hazard animals across the board, and present that hazard equally to any human who encounters them, hazard is not evenly distributed in men at all, nor is vulnerability to high-hazard men evenly distributed among all women. Unprovoked assault of strangers is heavily concentrated among men from low socioeconomic groups, vulnerability to violence, especially sexual violence, is heavily concentrated among women, and – here is the big one – a woman is FAR more likely to be victimized by a man she knows than by a stranger.\n\nThe fact that a woman is far more likely to be sexually victimized by someone she knows, far more likely to be assaulted or killed by an intimate partner than a stranger, is particularly damning of the “bear or man” so-called “thought experiment.” I was a little kid in the early 1980s when cases like the murder of Adam Walsh (son of John Walsh of “America’s Most Wanted”) helped ignite the “Stranger Danger” moral panic.  Cases of children being kidnapped by strangers were and still are extremely rare, but that didn’t stop parents from focusing on that hazard, while the country neglected the fact that most child sexual abuse and kidnapping is committed by a member of the family or a close friend of the family, just as the “man or bear” meme perpetuates an idea about men being potential rapists of any women they come across, while neglecting to focus on the real problems of acquaintance rape and intimate partner abuse\/murder. That’s the problem with simplistic, sensationalistic, and poorly conceived talking points like the “man or bear” meme.\n\nIdeas like these aren’t just unhelpful, they are harmful and counterproductive. The focus on “stranger danger” didn’t just set back awareness of family\/friend\/teacher sexual abuse, it led to more punitive criminal justice and mass incarceration across the board for all infractions, not just sexual crimes. It also fundamentally changed the way parents raised their children, more fearfully, more supervision, less independence, more structure. And those children now are raising children – many of whom are already college age or older, a generation that reports through the roof levels of anxiety and depression. We are just coming up on four years since the beginning of the MeToo movement, we need to be mindful of the potential long term consequences of focusing on the wrong things, the wrong men in some cases. Some might argue that this viral meme is about “awareness” and would lead men to reconsider their beliefs, but all spreading memes like this accomplishes is se;f-congratulatory preaching to the choir. Men who rape or assault women have something broken in them; hearing other men make mildly misogynistic jokes didn’t make them rapists any more than playing violent video games “creates” mass shooters, and hearing some guy respond “that’s not cool, bro” to a misogynistic comment isn’t going to fix what’s wrong with them. And contrary to the pastiches of male culture some people have constructed in their heads, normal, decent guys don’t sit around in groups letting misogynistic comments pass. I wouldn’t stick around a group of guys where that was norm long enough to try to “change” the men there, I just pick better friend groups than that. And any guy who is in a friend group that is bad enough that happens, if it’s that pervasive, that friend group is already toxic,  all him calling it out will do it make him a target. The only men who both need to be convinced and also are capable of being convinced are men who aren’t necessarily misogynistic, but don’t give a lot of thought to the issue, and frankly, this hamfisted simplistic meme that paints all men with a broad brush is just going to turn those guys off. You can say “they should look past that and understand the intent” or something like that, and maybe in an ideal world they should do that, but if they aren’t doing that, you need to change your tactics. Do you want to be “right”, or do you want to successfully persuade people?","title":"A Risk Expert on why the “Man or Bear” “thought experiment” is worse than unhelpful","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/1cjgxqn\/a_risk_expert_on_why_the_man_or_bear_thought\/"}
{"author":"WomanArentMicrowaves","created_utc":1703730630000,"id":"18s7i71","num_comments":40,"permalink":"\/r\/Discussion\/comments\/18s7i71\/surrogacy_is_inherently_exploitative_and_unethical\/","score":33,"selftext":"It's a form of sexual slavery and human trafficking, and creates a baby with the full knowledge that the baby will suffer the deep trauma of being separated from its mother. Purposeful creation of traumatised children.\n\nMost women who do surrogacy are doing it out of financial desperation. It often has terrible implications for their families too.\n\nIt reduces a woman to the state of a brood mare, even the word surrogate is used to eliminate the reminder that this is a woman, a person, not an incubator. Women who do this are often kept under tight control, and the baby buyers are often very demanding of complete control over her body. When Ukraine was invaded, the women were forced to do what their buyers wanted, either be evacuated or remain in one location, even separated from family.\n\nThere's also the fact that pregnancy carries very high risks including death, especially true in poorer countries where this is more likely to be common. Sometimes the baby is born the 'wrong' sex or with a medical condition and then the buyer rejects it. It's important to know that women make babies using our own flesh and blood and bones, not just a bit of DNA.\n\nThe bond the mother and child will have will be no different to that of her own related child.\n\nWhen one woman is for sale, we are all potentially for sale.","title":"Surrogacy is inherently exploitative and unethical","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/18s7i71\/surrogacy_is_inherently_exploitative_and_unethical\/"}
{"author":"Bill_lives","created_utc":1626223471000,"id":"ojjilt","num_comments":41,"permalink":"\/r\/Discussion\/comments\/ojjilt\/i_think_sexy_bathing_suits_for_young_girls\/","score":33,"selftext":"Context - I'm a grandfather to four young girls; the oldest is under 10 and wants to wear what she see other girls her age (and a bit older) wear.\n\nOne such style is a string bikini.  I thought maybe - being rather \"old\" - I was way out of touch.  But no - every article I looked up regarding that very early on referred to the \"sexiness\" of the suit.  Just what I thought - more so than a regular two piece (even one that exposes a lot of hip, breast, and below the navel but above the pubic area.  In my (maybe ignorant) view - it's the subliminal suggestion of the string (tied in a bow that can easily be undone) that creates the extra \"sexiness\".\n\nOne article had a comment from a mom \"I tell my daughter to double knot it so it can't be untied easily.  Whoah - obviously anyone who would do that ought to be arrested - but still, it acknowledges the subliminal suggestion.\n\nNow I won't say that many young girls make that choice but it IS available to them.  But that's only the most vivid case.  There are also \"cheeky\" suits (the actual term), and others that on a girl much older would definitely be considered \"sexy\".\n\nOK - what's the dilemma?  Telling her \"no\" to a two piece is body shaming IMO.  But at her age, she simply doesn't know what \"sexy\" even is.  So how do you steer her away from the \"sexy\" ones?  I told my son they probably need to be prepared to have a talk about sexuality etc much earlier than they expected.  Preventing her from wearing what she wants \"just because\" is worse than giving in (imo).\n\nBut those can't be the only two choices.\n\nIt's a shame (no pun intended) that we talk about \"body positivity\" so much.  I FULLY agree no one should feel NEGATIVE about their body.  But why is one or the other?  Why not \"body neutrality?  It seems so many girls\/women are PROUD of their bodies to the extent of revealing a lot of it in dress commonly considered \"sexy\".  I don't' think that's healthy either.  It's their right - obviously.  But really, what is there to be proud of?  (I'm not talking about healthy or athletic bodies of course - only those that display themselves in a way commonly considered \"sexy\" by both men AND women.)\n\nIf - for example - a woman displays a lot of their breasts and they are above average - might that send a message to OTHER women that \"bigger really IS better\"?  I read comments saying \"sexiness\" makes them feel confident and empowered.  Confident and empowered to do what?  Succeed in their career?    \n\nWill my grandgirls all need to feel proud of their bodies (and sexuality) to do well in life?  Of course not.  NOT feel bad - yes.  Not feel guilty about sexuality - yes.  \n\nFlaunt it?  I would think not, and yet, to hear some women talk, it IS an advantage to them.\n\nWhy do women do that to themselves?  Or am I really out of touch.\n\nPlease - I'm NOT a prude or religious zealot.  And I'm not trying to be critical.  I really need information that might help me help my kids (who have often and still come to me and my wife for our thoughts on child raising - since they all feel we did a decent job with them.)","title":"I think \"sexy\" bathing suits for young girls, especially preteens, present a very difficult dilemma for parents","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/ojjilt\/i_think_sexy_bathing_suits_for_young_girls\/"}
{"author":"ryhaltswhiskey","created_utc":1732777825000,"id":"1h1hqzv","num_comments":158,"permalink":"\/r\/Discussion\/comments\/1h1hqzv\/what_do_you_think_is_going_on_with_young_men\/","score":32,"selftext":"https:\/\/circle.tufts.edu\/2024-election#youth-vote-+4-for-harris,-major-differences-by-race-and-gender\n\n>The Gender Gap: Young Women +17 for Harris, Young Men +14 for Trump\nAs many observers expected before the election, there was a significant gender gap among young voters. Young women preferred Harris to Trump by a 17-point margin: 58% to 41%. **But young men preferred Trump by a 14-point margin: 56% to 42%.**\n\nI'm a parent of a young young man in his early twenties. He's disgusted by this. But some of his friends like Trump. \n\nTo me, Trump is a rapist and a misogynist. He is on tape bragging about sexual assault. He said all kinds of terrible things about women in the past, on video. It seems obvious that he has a special kind of vitriol for women who talk back to him. \n\nI don't get why young men would accept a rapist\/misogynist just because he \"speaks to their values\"  or whatever it is. I'd like to think that someone being a rapist* would be a bridge too far for young men, especially considering that we've spent so much time talking about respecting women's bodily autonomy over the past 20 years.\n\nSo what do you think is going on here?\n\n\\* I refuse to debate this point. The legal system has spoken and a judge who had access to all of the evidence said that Trump is a rapist. He was not found guilty of rape because that civil trial was not about rape, it was about defamation.","title":"What do you think is going on with young men breaking hard for Trump in 2024?","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/1h1hqzv\/what_do_you_think_is_going_on_with_young_men\/"}
{"author":"Joeylaptop12","created_utc":1732250299000,"id":"1gwpnb8","num_comments":691,"permalink":"\/r\/Discussion\/comments\/1gwpnb8\/why_is_so_hard_for_society_to_have_sympathy_for\/","score":32,"selftext":"When I was younger, most guys my age were Democrats. I even knew a few redneck guys who voted Obama because we all felt like the GOP didn’t have our back on economic issues. Fast forward 2016 and beyond and being a straight male democrats feels like the last of a dying breed \n\nAnd I hate to say it but I can absolutely see where SOME young men are coming from. Not the incels but casual observers. It does *feel* even if its not the full picture that Democrats\/ the left hate young men or men in general\n\nWhy? Anecdotally, I’ve experienced what people are talking about in terms of misandrist dogma. Joking or not, saying you h**te men and all men should d*e is pretty common in left wing circles\n\nSome data has suggested that a good chunk of younger people view asking to buy someone a drink at the bar is harassment\n\nMen notoriously struggle on dating apps that are unironically rigged against the vast majority of them \n\nWe no longer live in a world of graduating high school, getting a factory job that you can support a family of 3 on, finding a wife and settling down. It’s created a segment of young men who are increasingly finding misogynist morons like A*******w T******e attractive because they don’t know their place in society\n\nAnd asking and questioning why is met with a barrage of accusations of being an incel or worse \n\nI have sympathy for feminism and womens rights but why is hard for many of them and those in the left in general to see some young men and yes even some incels as victims in a changing culture? \n\nIt even extends to men of color at times with feminists basically parading borderline r*cist statements as well anecdotally? What is going on here? \n\nEdit: I am not a white male. This wasn’t intended to be a post defending them. But I do think Dems have got to do better communicating with men in general","title":"Why is so hard for society to have sympathy for young men? ","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/1gwpnb8\/why_is_so_hard_for_society_to_have_sympathy_for\/"}
{"author":"FlightlessDodo369","created_utc":1643699010000,"id":"shf44u","num_comments":154,"permalink":"\/r\/Discussion\/comments\/shf44u\/people_who_think_racism_doesnt_come_both_ways_are\/","score":32,"selftext":"There are some people out there that believe people such as black, Chinese or Mexican (just to name a few) can't be racist. This ideology just boggles my mind because there are groups such as a small group called The Nation of Islam (and no it's not the actual nation of Islam) that believe in full black supremacy. There has been racial killings of white people such as Kriss Donald. Asian men\/women have been attacked by black people on the streets. And yes, there has been truly horrific atrocities that were done by the hands of white people, but that doesn't mean we're the only ones that can be racist or perform racially motivated attacks. Some even believe that all white people are racist which is just not true. Then there's some people that believe coloured people can't be racist which is stupid and absurd. These are my thoughts and I would like to hear your side.","title":"People who think racism doesn't come both ways are morons.","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/shf44u\/people_who_think_racism_doesnt_come_both_ways_are\/"}
{"author":"Drumsat1","created_utc":1596590507000,"id":"i3ni4p","num_comments":13,"permalink":"\/r\/Discussion\/comments\/i3ni4p\/i_just_got_banned_from_roffmychest_for_calling\/","score":29,"selftext":"The post which has now been locked claimed that white women cant be raped because they are white, I pointed out that deciding whether rape is rape or not based on the color of the victims skin sounds awfully racist and they banned me. What do you all think about this?","title":"I just got banned from r\/offmychest for calling out racism","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/i3ni4p\/i_just_got_banned_from_roffmychest_for_calling\/"}
