{"author":"GaryOak7","body":"I’m willing to bet overstimulation plays a major role in this. Not that humans have been necessarily kind before, but values are appearing to have shifted in a negative way. \n\nYou’re bombarded with negative news daily. Whether this is a post on Reddit, a shooting, or seeing on the news an elderly couple can’t afford their home. \n\nAll of this takes a toll on the brain and the confusion of politics does not help this matter since both parties tend to blame each other but no matter who is elected we still can’t afford basic services. \n\nPeople do better amongst communities and interacting with those you know. Bonds are able to be formed and people look out for one another. \n\nNow, everyone is interacting with random people and expecting them to be honorable and show the same courtesy they would a friend whom they’ve known. Doesn’t work like that unfortunately.","created_utc":1736118994000,"comment_id":"m5j4ev8","parent_id":"t3_1hu3asf","score":9,"submission_id":"1hu3asf"}
{"author":"CaptainTegg","body":"Trump showed Americans that it's cool to be an asshole. Trump, being the president of the most powerful country in the world, makes that kind of behavior spread fast. So with social media, lots of idiots spread the Trump hatred around. Then billionaires buying all the news media to agree with trump because it makes them money.\nThere's always been assholes, most just kept quiet because people would call them out. Now they are emboldened due to trumps shit behavior.","created_utc":1736113223000,"comment_id":"m5ipj0c","parent_id":"t3_1hu3asf","score":34,"submission_id":"1hu3asf"}
{"author":"artful_todger_502","body":"Not just you.  As an old person, we are living in a mean, apathetic and antagonist society.  It really was not like this before the 90s.  A population that doubled from 1970 to 1990 alone, and still exploding like a feral cat colony combined with the anonymity, antipathy and violence brought about of the internet and car-based society, are all major eroders of empathy.  It's a mean, mean world now.","created_utc":1736127001000,"comment_id":"m5jtrkr","parent_id":"t3_1hu3asf","score":7,"submission_id":"1hu3asf"}
{"author":"bad_ukulele_player","body":"I'm so glad I'm not the only one who thinks this. People have become far more cynical, mean and lacking in compassion on Facebook. I think it's one of two things - the majority of people who comment are negative (so I don't know if they represent society as a whole). They've been emboldened by Trump and  the MAGA mindset to see the worst in others. If someone like me should say something warm or supportive of a person suffering, for example, they accuse me of virtue-signaling or being a social justice warrior (SJW). They laugh at things that hurt others, especially people of different nationalities or gender orientations. ALSO, I think that younger people are far more cynical and less likely to show kindness. It's a sign of weakness to them? I don't know. Maybe it's that they were brought up on social media. It's SO different now than it was before the internet. The world was not only more simple and sane but people were just more chill with each other. There was political division but not 1\/10th of how it is now. I used to \"love everybody\". Now I can honestly not say that any longer. Young people hate boomers (as if we everyday older people caused the world's problems. It wasn't us, it was greedy corporations. Just like there are greedy corporations today that young people have no control over), young men don't know how to talk to young women. It's all a shit show. I had hope for our society when Kamala\/Walz had a chance at winning. Now, I just want to go into hibernation until another Dem is back in power. Because I can't do that, I need to keep my sanity by getting off of social media myself. I want to spend quality time with my loved ones and dear friends. We can all support and uplift one other, and be there for each other when times are hard. Let's bring back kindness one household at a time, one community at a time.","created_utc":1736133763000,"comment_id":"m5khrj9","parent_id":"t3_1hu3asf","score":7,"submission_id":"1hu3asf"}
{"author":"darthatheos","body":"The only mean thing I do is be nice out of spite. Either that or it stoicism.","created_utc":1736121101000,"comment_id":"m5japmc","parent_id":"t3_1hu3asf","score":6,"submission_id":"1hu3asf"}
{"author":"Fluffy_Vacation1332","body":"Lack of human contact is the culprit, social media and the internet has made it significantly easier to speak to people and connect, but without the human connection is increasingly becomes a situation where impulse and negativity are their first instinct instead of logic rationale, decency and empathy that you would normally get with you in contact.\n\nThere have been studies on this . People are getting worse because of technology.","created_utc":1736134858000,"comment_id":"m5kllay","parent_id":"t3_1hu3asf","score":6,"submission_id":"1hu3asf"}
{"author":"Plagueofmemes","body":"I remember being online as a teen on forums and as a young adult on Tumblr and I think 5% of what I saw was negativity and the rest was silly memes and people having fun. I miss the internet being mostly fun unless you were actively looking for a fight.","created_utc":1736147894000,"comment_id":"m5ltqgw","parent_id":"t3_1hu3asf","score":6,"submission_id":"1hu3asf"}
{"author":"Better-Salad-1442","body":"It’s a couple things: Rise of reality TV rewards the worst people on the planet, people see that and think that behavior is normal\/try to emulate in real life without realizing it’s all manufactured by producers, etc.\n\n\nBillionaires distracting the proletariat with divisiveness in order to get tax cuts. This has created an atmosphere where(similar to reality tv) you’re rewarded for creating controversy\/drama even if it’s via lies. Which has given rise to people like Trump who know how to succeed with shameless lying, people see this and think they can succeed in life doing the same stuff.","created_utc":1736121908000,"comment_id":"m5jd7oh","parent_id":"t3_1hu3asf","score":6,"submission_id":"1hu3asf"}
{"author":"TastiSqueeze","body":"Stress in daily life makes people turn into grouchy grumpy windigos.","created_utc":1736129056000,"comment_id":"m5k0rlt","parent_id":"t3_1hu3asf","score":3,"submission_id":"1hu3asf"}
{"author":"digger39-","body":"Welcome to trumps world. The angriest  winners you'll ever see","created_utc":1736143876000,"comment_id":"m5lgsan","parent_id":"t3_1hu3asf","score":4,"submission_id":"1hu3asf"}
