{"author":"DukeTikus","body":"You were on a tiktok live. That's about as useful as trying to convince people of facts on r \/ conservative or asking for empathy on twitter.\n  \nThis kind of rhetoric is ultimately harmful and most people doing actual activism in the real world are very aware of that. On the Internet people get more attention for extreme and divisive opinions and it's easier to build yourself an echo chamber where you get rewarded for saying the most stupid shit.\n  \nI did a fair bunch of feminist organizing in real life and I have encountered people like that only on the Internet. I'm pretty sure had you talked to any single person on that live offline and face to face the conversation would have gone a whole lot differently. People generally think more about what they say when they say it to someone's face and when they don't try to look like feminisms bravest little soldier in front of their Internet friends.","created_utc":1744988221000,"comment_id":"mnpyi8c","parent_id":"t3_1k1xr7t","score":12,"submission_id":"1k1xr7t"}
{"author":"Inevitable-Plant-584","body":"I did not expect to stumble upon the Karen hive today. Holy f.","created_utc":1745019344000,"comment_id":"mnrwbq0","parent_id":"t3_1k1xr7t","score":5,"submission_id":"1k1xr7t"}
{"author":"azhriaz12421","body":"You had me until you added the \"it's the type of thing that makes men turn to groups with misogynistic and racist-leaning beliefs\" comment. I mean, what they did was wrong.\n\nWhen somebody wrongs me, I don't look for comfort with haters who happen to have a list that I'm not on.\n\nI look for better people and groups with which to associate.","created_utc":1745005176000,"comment_id":"mnqrc61","parent_id":"t3_1k1xr7t","score":16,"submission_id":"1k1xr7t"}
{"author":"GitmoGrrl1","body":"\"And here’s the thing a lot of people don’t want to hear: this exact dynamic is part of why so many young men are being pushed into right-wing spaces and even voted for Trump.\"\n\nI hear you loud and clear. Now hear me: I think you are full of shit. Nobody can \"push\" you into voting for Trump. If women's civil rights matter to you, you aren't going to suddenly become a magat because some idiot offended you.","created_utc":1744996862000,"comment_id":"mnqc7hd","parent_id":"t3_1k1xr7t","score":29,"submission_id":"1k1xr7t"}
{"author":"onefornought","body":"A lot of conversations aren't really conversations. They're gripe-fests.\n\nThe responses you get in the latter might as well be \"Look, I didn't come here to be persuaded!\"","created_utc":1745008352000,"comment_id":"mnqytqa","parent_id":"t3_1k1xr7t","score":3,"submission_id":"1k1xr7t"}
{"author":"Andre_iTg_oof","body":"Disclaimer: I originally wrote this in a Word document and copy-pasted it here in the comments section. Why? Because I find the topic genuinely interesting, and I believe the most respectful way to engage with it is by giving fair response.\n\nI could have written much more—and included far more primary sources—but chose to keep it concise for now. That could be an interesting future project (especially considering how Byzantine women of power did some pretty wicked stuff!).\n\nIn any case, this is my counter-perspective on the concept of patriarchy, both in today’s world and within a broader historical context.\n\n \n\nI understand that you believe in the patriarchy. However, I want to offer you a different lens to view the world trough. \"patriarchy\"—a system in which men have historically dominated power and status. It’s true that, across most of recorded history, men have often occupied the highest positions in society. However, this fact alone doesn’t fully capture the nuances of how power has functioned, especially when we consider the many women who have also held immense authority and influence.\n\nThere are plenty of examples of queens, empresses, who has wielded significant power in most corners of the earth. Hatshepsut, Cleopatra VII, Amina of Zazzau, Eleanor of Aquitaine, Isabella I of Castile, Maria Theresa of Austria, Wu Zetian, Empress Suiko, Rani Durgavati, Anacaona, Tomyris, Zenobia, and Shajar al-Durr prove that women not only participate in power structures. But they actively change and shape them.\n\nThis forms the groundwork of my argument. the concept of “patriarchy” is flawed, not because men haven’t dominated in many areas, but because it applies a binary, gendered lens to something much more complex.\n\nTake a typical monarchy: the king may be the top authority, but the queen isn’t simply a powerless accessory. In many societies, a queen ranked above almost all other men. Likewise, nobility, regardless of gender, outranked the vast majority of society. So, while a man may sit at the top, this does not mean that all men are above all women. Power is not, and has never been, evenly distributed within gender categories.\n\nWhile male leadership may be the historical norm, it’s not a rule without exception. And more importantly, the presence of powerful women disrupts the notion that patriarchy explains all societal power dynamics. A queen, after all, is above male peasants. A female noble may outrank a male knight. A concubine or consort may wield behind-the-scenes power far exceeding that of public officials. These are not fringe examples they’re repeated across history.\n\nThat’s why I argue we should move beyond viewing society through the lens of patriarchy or matriarchy. Instead, I propose using the lens of hierarchy. This framework better captures how power is distributed—not by gender alone, but by class, rank, influence, and individual relationships.\n\nEven in modern contexts, this view holds. Consider the First Lady of the United States or the spouse of a prime minister. While they may not be elected officials, their proximity to power places them above the vast majority of the population—men included. The same could be said for business dynasties, royal families, or high society in general.\n\nTo further support this shift in perspective, let’s look at education. In Western countries, women are now outpacing men in higher education attainment. According to Eurostat, 48% of women aged 25–34 held tertiary degrees in 2021, compared to only 37% of men. The American Institutes for Research also notes that women earn the majority of bachelor's, master’s, and increasingly, doctoral degrees. This educational advantage is not insignificant—it shapes access to jobs, income, and leadership opportunities.\n\n \n\nInterestingly, the belief in patriarchy is most vocal in Western societies—the very societies where women have made the greatest strides in power, education, and autonomy. While inequalities certainly still exist, the “patriarchy” label may obscure more than it reveals.\n\nIn summary, power structures throughout history and today are better understood through hierarchy than patriarchy. The nuance matters. Not all men are powerful. Not all women are subordinate. Power is layered, relational, and often situational—and the lens of hierarchy gives us a more accurate, less binary way to understand it.\n\n(sources: [https:\/\/ec.europa.eu\/eurostat\/web\/products-eurostat-news\/-\/ddn-20220524-2?utm\\_source=chatgpt.com](https:\/\/ec.europa.eu\/eurostat\/web\/products-eurostat-news\/-\/ddn-20220524-2?utm_source=chatgpt.com)\n\nhttps:\/\/www.air.org\/resource\/blog-post\/nces-forecast-degrees-increase-and-women-predominate)","created_utc":1745029208000,"comment_id":"mnstd3t","parent_id":"t3_1k1xr7t","score":3,"submission_id":"1k1xr7t"}
{"author":"omni42","body":"It's extremely important to understand something. I understand how you feel. It's exhausting often feeling like the enemy for existing. But that conversation was not a place to express that. You don't walk into a room full of assault victims and try to be a counterpoint to their experience. That's what a lot of men try to do. But you are a real person unless you actually know someone, you're just an abstract representation of a group that has traumatized those people.\n\nSometimes that desperation to get acknowledgement or validation can backfire hard, don't even try. Keep scrolling.\n\nWe all don't have to exist in everyone else's space. I'm very wary as a big white guy activist when I'm at black community events because I know I look like someone that might have inflicted violence on some people in the room. It's not their fault, it's not mine. Sometimes that's just how it is. And online? Just nope on out of there.","created_utc":1745047940000,"comment_id":"mnue695","parent_id":"t3_1k1xr7t","score":3,"submission_id":"1k1xr7t"}
{"author":"Ok_Reach_4329","body":"The problem that I see from your post is you were talking to the wrong group!! “It’s all men” to me is about our safety! So you should be talking to your friends, co workers, male family members every male in your life and explain to them why it’s ALL MEN because women’s lives depend on men fixing men! Women can not..that’s why it’s all men until it’s no men. It’s not about getting your feelings hurt by men. It’s about the first black eye, or if I can’t have you no one will, or what are you gonna do for me to get this promotion you worked long and hard for and deserve..it’s “the cervix does have any nerve ending so women don’t need pain meds for Pap smears, something we have to endure on a yearly bases from age 21, it’s the fact that they are thousands more studies on male pattern baldness then there are on endometriosis, it’s the expectations that women are care givers and should give up their careers for the family, it’s the fact that men are paid more in general, paid more if they are married…it’s the fact take women dont have maturity leave at most jobs,  and much much more…..i say all this to say it’s not about just romantic relationships.. patriarchy runs women’s lives from birth to death..we must endure the perspective of the male…how they see us, in all aspects of our lives…and the only ones that can change that perspective is ALL MEN. I hope this helps you see some of women’s perspectives.","created_utc":1745066143000,"comment_id":"mnvngcx","parent_id":"t3_1k1xr7t","score":3,"submission_id":"1k1xr7t"}
{"author":"TSllama","body":"I've never heard that phrase and I'm a feminist. But I also never go on tiktok. Sounds like you got shut down by 12-year-olds, so honestly probably doesn't really mean anything.","created_utc":1744999305000,"comment_id":"mnqg5i2","parent_id":"t3_1k1xr7t","score":8,"submission_id":"1k1xr7t"}
{"author":"Wall-Florist","body":"You showed up in someone’s echo chamber with one of these and they don’t like that:\n\nhttps:\/\/soundproofstore.com\/products\/red-black-acoustic-foam-panels?variant=39492197449894&country=US&currency=USD&utm_medium=product_sync&utm_source=google&utm_content=sag_organic&utm_campaign=sag_organic&utm_campaign=gs-2021-05-03&utm_source=google&utm_medium=smart_campaign&gad_source=1&gbraid=0AAAAADvetjLVeCymmsrfdhDE-JSgcXfyx&gclid=EAIaIQobChMIjK6l_vngjAMVKExHAR2GvS8wEA0YASABEgI5bfD_BwE\n\nListen, I agree with you that everything is systemic, and it takes a self-aware person to step back and understand that nuance and foresight into each other’s psyche is the path forward- it’s not “reaching across an aisle,” it’s fucking coexistence. But, TikTok, so…","created_utc":1744986792000,"comment_id":"mnpw55d","parent_id":"t3_1k1xr7t","score":4,"submission_id":"1k1xr7t"}
