{"author":"molotov__cocktease","created_utc":1730499004000,"id":"1gh6au5","num_comments":77,"permalink":"\/r\/Discussion\/comments\/1gh6au5\/republican_policy_continues_to_kill_women\/","score":47,"selftext":"\"Nevaeh Crain was crying in pain, too weak to walk, blood staining her thighs. Feverish and vomiting the day of her baby shower, the 18-year-old had gone to two different emergency rooms within 12 hours, returning home each time worse than before.\n\nThe first hospital diagnosed her with strep throat without investigating her sharp abdominal cramps. At the second, she screened positive for sepsis, a life-threatening and fast-moving reaction to an infection, medical records show. But doctors said her six-month fetus had a heartbeat and that Crain was fine to leave.\n\nNow on Crain’s third hospital visit, an obstetrician insisted on two ultrasounds to “confirm fetal demise,” a nurse wrote, before moving her to intensive care.\n\nBy then, more than two hours after her arrival, Crain’s blood pressure had plummeted and a nurse had noted that her lips were “blue and dusky.” Her organs began failing.\n\nHours later, she was dead.\"\n\nhttps:\/\/www.propublica.org\/article\/nevaeh-crain-death-texas-abortion-ban-emtala\n\nThis completely preventable death was the extremely obvious result of Republican abortion policy, which does not view women as inherently people, but property. \n\nA braindead, childlike calculation of harm reduction - banning abortion and treatment for miscarriages will save fetuses - has (again, extremely obviously) INCREASED harm by killing both the mother and the child.\n\nTrump has flip flopped on wanting a national abortion ban (https:\/\/www.npr.org\/2024\/04\/10\/1243942019\/trump-abortion-ban-arizona-supreme-court-florida-6-week-ban), but the man is senile, a serial liar, and an opportunist, so it's probable he would allow one. \n\nJD Vance, a heritage foundation lackey who promotes project 2025, has advocated for a national abortion ban throughout his career (https:\/\/www.cnn.com\/2024\/07\/17\/politics\/kfile-jd-vance-abortion-comments\/index.html).\n\nDiscussion:\n\nWhy do Americans refuse to believe what Republicans will do if elected, even if Republicans directly say it?\n\nNevaeh Crain should still be alive. How would you sell rational, serious harm reduction policy to convince pro-forced birth people?\n\nHow does any rational person see the perpetually negative impacts of Republican policy and decide that \"Both parties are the same\"?\n\nIs it *purely* misogyny that guides Republican policy towards women?","title":"Republican policy continues to kill women.","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/1gh6au5\/republican_policy_continues_to_kill_women\/","upvote_ratio":0.82,"over_18":false}
{"author":"Complex-Judgment-420","created_utc":1697836183000,"id":"17cax79","num_comments":379,"permalink":"\/r\/Discussion\/comments\/17cax79\/the_change_in_toxic_gender_behavior\/","score":48,"selftext":"Ive noticed sooo many more comments about women being sluts who only want tall rich guys and who are completely emotionally and morally  depraved. Its pretty crazy how much abuse women are getting on the internet, and its far more widespread than hate towards men. The justification is \"well women have toxic standards too\", but you don't see those standards in the comments of every youtube video, other than those written by disgruntled men? Comment after comment about why guys can't get a girlfriend because they're all \"used up hoes\" who can't \"pair bond\" like we're some animal is becoming such a prevalent belief.  Its such a complicated mess at this point, the misogyny is starting to get worse than the women with unrealistic standards. Men don't get told anything they say is irrelevant because they're men, women are devalued just for being women\n\n&#x200B;\n\nWe all need do better. Revenge and bitterness only breeds more insecurity. Assumptions and judgement prevent personal growth\n\n&#x200B;\n\n&#x200B;\n\nEdit: Bunch of boys come in saying exactly what I was talking about \"women don't understand, most women are too fat for our standards, women only want muscles, women will leave you for the next tinder swipe\" its so stupid its unbearable","title":"The change in toxic gender behavior","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/17cax79\/the_change_in_toxic_gender_behavior\/","upvote_ratio":0.7,"over_18":false}
{"author":"deleted","created_utc":1727896703000,"id":"1fudpmg","num_comments":55,"permalink":"\/r\/Discussion\/comments\/1fudpmg\/jd_vance_spent_the_entire_debate_mansplaining\/","score":43,"selftext":"Yes Vance’s delivery was polished, and he spoke in complete sentences, which is a novel act for team maga these days. However, nothing he said was substantive, he dodged questions, he lied, he doubled down on racism and misogyny, and he spent most of his time gaslighting. \n\nIt was classic mansplaining, as if the rest of us need to ‘taught’ the ‘truth’ about maga, because Mr. Ivy League knows better than the rest of us. His performance was polished, credit where it’s due, but his performance was both insincere and condescending. \n\nWith four weeks until election day, last night’s debate won’t move a single vote in either direction. There are no legitimate ‘undecided’ voters in this very unique presidential election. This election is not actually republican vs democrat, this election is maga vs. non-maga. Nothing that happened last night will change that dynamic. ","title":"JD Vance spent the entire debate mansplaining Trump. ","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/1fudpmg\/jd_vance_spent_the_entire_debate_mansplaining\/","upvote_ratio":0.82,"over_18":false}
