{"author":"Indrid_Cold23","body":"Anecdotally, I have had close family members lose children in childbirth, I have had a number of friends lose their babies as well, all up to and around the act of giving birth.\n\nA lot of men are shielded from how deadly giving birth can be for both the mother and child. Babies die; it's sad, but it's part of nature. If we keep women healthy and in charge of their own health, they can try again.\n\nPolitics have NO business in this area. This should be between a woman, her family and her medical care professionals. Not senators, not lawyers, not judges. Conservatism is mental regression and illness.","created_utc":1730499966000,"comment_id":"luv18eq","parent_id":"t3_1gh6au5","score":23,"submission_id":"1gh6au5"}
{"author":"Xander707","body":"I remember vividly MAGA republicans said liberals were totally over-reacting that anything was going to happen to abortion rights when Trump was elected. Then as each new Trump appointed Supreme Court Justice was confirmed, liberals were once again assured that, like the Justices said, Roe has been settled law for decades. Calm down. Relax. Trump is going to save America and he’s not going to strip your rights away…\n\n\nThen they celebrated when those rights were, just as feared, stripped away. They didn’t care it had all been a lie, and they don’t care about the needless deaths that have been caused in the wake of it all. This is what MAGA does; they tell us that our fears are unfounded. Fears about Trump taking away rights, fears about Trump using the military against his political opponents, fears that Trump is a fascist, they are all irrational fears, they say. And when those fears are in fact proven legitimate and vindicated, *they celebrate.*\n\nThey celebrate.\n\n\nRemember that.","created_utc":1730500150000,"comment_id":"luv1sjl","parent_id":"t3_1gh6au5","score":13,"submission_id":"1gh6au5"}
{"author":"hematite2","body":"This is why people touting \"well they have exceptions for the health of the mother!\" doesn't work. Because those health exceptions are (deliberately) vague on what actually counts, and doctors aren't qualified to make those legal decisions. They end up only kicking in when the woman is literally dying right there, as opposed to 'health is in imminent danger and could fail at any moment\". Not to mention cases where they know in advancd the fetus is 100% **going** to die, but since it isn't dead **yet** you can't get an abortion, you just have to wait and risk your health (and future fertility) until then.\n\nLook at the Cox case in Texas. A woman knows her fetus is going to die and there's nothing she can do about it. She actually goes to a court, and they rule that she qualifies for a health exception. But then SCOTX intervenes and says 'no, that doesn't count, we'll prosecute anyone who attempts this\". Meanwhile, Cox is in and out of emergency rooms with her health constantly in danger, while courts argue back and forth over her rights compared to an **already dying** fetus.  If courts are arguing about it, how can you expect doctors to make those decisions when someone's life hangs in the balance?","created_utc":1730502843000,"comment_id":"luva4cu","parent_id":"t3_1gh6au5","score":6,"submission_id":"1gh6au5"}
{"author":"Styrene_Addict1965","body":"Pro-birth, then fuck you.","created_utc":1730508401000,"comment_id":"luvrp92","parent_id":"t3_1gh6au5","score":3,"submission_id":"1gh6au5"}
{"author":"king_hutton","body":"Republicans don’t care. They’ll just deflect away from the issue.","created_utc":1730505644000,"comment_id":"luvizks","parent_id":"t3_1gh6au5","score":2,"submission_id":"1gh6au5"}
{"author":"Silver_Top9612","body":"She was pro-life, believed abortion was morally wrong, and reportedly didn’t care whether or not the government banned abortions. One day women will learn about the consequences of going against their own interests in the name of morality and religion.","created_utc":1730559351000,"comment_id":"luzfdp9","parent_id":"t3_1gh6au5","score":1,"submission_id":"1gh6au5"}
{"author":"Fantastic-Leopard131","body":"On February 22, 2024, Laken Riley, a 22-year-old Augusta University nursing student, was killed while she was jogging at the University of Georgia. At 12:38 p.m., Riley’s body was discovered by UGA police in Oconee Forest Park behind Lake Herrick. Her death was caused by blunt force trauma and asphyxiation. The man who not just killed her, but sexually assaulted her, beat her, and then strangled her to death, was an illegal immigrate that was let in by the biden\/harris administration. He has 3 counts of felony murder, one malice murder, aggravated battery, aggravated assault with intent to rape, kidnapping, hindering a 911 call and tampering with evidence. \n\nIf my options as a women are either to die in a nice hospital bed, or to be sexually assaulted and then brutally and violently murdered, id take dying in a hospital bed with my mother by my side any day. This is what Kamals America looks like, raping and violently murdering women who went out for a nice run bc shes too weak to close our boarder and protect Americans. Add in the things like fentanyl deaths due to drugs passing through the border and there’s no question about which candidate has the far greater death count on their hands. \n\nDying in a hospital under Trump sounds like a dream compared to the death Kamala is offering me. Think about that, cause if i were you id be careful bring up the death toll if youre voting for kamala bc its very hypocritical to turn around and ignore the deaths she has on her hands.\n\nSecond point - https:\/\/en.m.wikipedia.org\/wiki\/List_of_wrongful_convictions_in_the_United_States \nConsider this list of wrongful convictions. A number of ppl here were innocent but convicted  and served time in prison due to a wrongful conviction. Is the right course of action to just legalize murder and rape bc under those laws some ppl face unintended and wrong outcomes? Anyone with common sense would say no, that its an absurd argument to say we should do away with the whole law just bc some ppl are adversely affected by it. The right argument would be to push for a better system and more checks and balances to make sure we minimize these unintended harmful consequences of the laws, its not to do away with the law altogether. That same logic applies here, it’s entirely ignorant to use a case like this to argue against a law’s existence bc the only valid thing it can support is an argument to clean up the law to make sure ppl like this arent wrongfully getting caught up in it. In no valid line of logic does this provide support to the argument that the law shouldn’t exist. If thats your argument you need to also be pushing to do away with any law that unfairly affects someone, aka you better be supporting murder being legal bc some ppl are punished unfairly under it.","created_utc":1730617025000,"comment_id":"lv3ctkv","parent_id":"t3_1gh6au5","score":0,"submission_id":"1gh6au5"}
{"author":"Prestigious-Safety80","body":"Since when are abortions used to treat sepsis?\n\nIf the child was alive, and she was given a sepsis diagnosis, then according to medical literature they should have been treated with antibiotics to both stabilize the condition of the mother and ensure fetal vitality. Instead, she was sent home without any antibiotic treatment. \n\nSo Texas' abortion laws appear irrelevant in this case. The cause of her death was the initial misdiagnosis combined with the fact she was sent home without treatment after being properly diagnosed. This is either medical malpractice or there is some missing context behind her release, but either way it was not abortion related.","created_utc":1730508122000,"comment_id":"luvqt57","parent_id":"t3_1gh6au5","score":-2,"submission_id":"1gh6au5"}
{"author":"centurion762","body":"How did the abortion ban cause her death? From the info given looks like a bad diagnosis.","created_utc":1730501881000,"comment_id":"luv74xn","parent_id":"t3_1gh6au5","score":-5,"submission_id":"1gh6au5"}
{"author":"pinner52","body":"serious modern teeny makeshift payment flowery liquid voracious seemly steer\n\n *This post was mass deleted and anonymized with [Redact](https:\/\/redact.dev\/home)*","created_utc":1730501338000,"comment_id":"luv5fnv","parent_id":"t1_luv18eq","score":-18,"submission_id":"1gh6au5"}
{"author":"penzos","body":"People are morons. Nothing new in that.","created_utc":1697854674000,"comment_id":"k5q1g0o","parent_id":"t3_17cax79","score":11,"submission_id":"17cax79"}
{"author":"Baseball_ApplePie","body":"\"Decent\" guys generally don't trash talk women like this. \n\nGuys who have nothing to offer a woman but think they deserve at least an 8 in the looks department love to trash talk women.  You know...the usual assorted losers and incels.","created_utc":1697871856000,"comment_id":"k5r9lgg","parent_id":"t3_17cax79","score":9,"submission_id":"17cax79"}
{"author":"Biggest-Possum","body":"I'm happily married and I feel like I caught the last chopper out of Vietnam honestly.\n\nSingle men these days are dating in a pool where a woman who is not overweight or obese, making median salary and no kids is only 4% of the available pool. (Roughly 1 million women in the U.S. meet these standards )\n\n*Just a fun fact, but this number of women is roughly the same as active female content creators on Onlyfans, a number nearly equal to the total force of the entire US Army, which is some interesting commentary on the state of our culture.*\n\nThere's no easy way to correlate the two statistics, so please view it only anecdotally, but what this throws some weight behind is that for any man who desires a level of modesty or privacy in their relationship, that their chances of finding a satisfying relationship are even slimmer. Our society has shifted away from a lot of values that brought people a sense of security and safety in their relationships, and now the dating scene reflects that change in values.\n\nWhen you consider additional differences in religion, political views, or just plain old character compatibility, dating at this time is really, really difficult.\n\nGuys these days really do have it hard, and women don't understand it because their view of the dating pool is different. Women get twice as many matches on dating apps, but only initiate a third of relationships.\n\nMen are frustrated emotionally, romantically and physically, and consequently the consumption of pornographic material has skyrocketed, which further contributes to a variety of intimacy issues and unhealthy and unrealistic romantic expectations.\n\nIt's of course unfair for men to turn around and blame this all entirely on women, or to verbally berate or attack them for all the petty stuff that goes around, but I just wanted to explain where a lot of the anger and resentment is coming from. It doesn't make it right at all, and I don't condone bad behavior in any sort, but I just wanted to share some of its underlying current.\n\nGuys are hurting, and they live in a society that terribly fails to understand their troubles or needs on the most basic of social, emotional and romantic levels. This same culture is similarly destructive towards the representation and interactions that women receive, which is creating a feedback loop of toxicity and unrealistic expectations.\n\n(Disclaimer: Again, I don't support attacking women or disparaging them in any way. If you're a guy and you're reading this and you think \"Oh man, we do have it bad, and I'm frustrated so I'm going to go blame it on women and be a jerk!\" Then just stop and imagine how much less attractive and functional a bad attitude makes you. Hating women isn't going to make you less lonely.)","created_utc":1697858864000,"comment_id":"k5qcp0s","parent_id":"t3_17cax79","score":9,"submission_id":"17cax79"}
{"author":"nickatnite511","body":"Yes, this is a tragic symptom of a society full of people completely obsessed with vanity and \"self fulfillment\". We totally miss the reality that genuine connection with another IS where you find fulfillment for the self. We do it backwards, and then instead of empathizing with people who have a different set of issue than we do, we simply dismiss them as somehow being less than. So, women are treating men as sub-human. Men are treating women as sub-human. And instead of breaking the cycle, each individual looks around, sees the shitty behavior so prevalent in our world, and justifies their own shitty behavior by saying, \"well, everyone else gets to do this. I want my little slice of 'happiness' too, I'll just start being shittier to people.\" Then we get old, and die. Shittier than the day we were born, by a mile. It's heartbreaking","created_utc":1697847549000,"comment_id":"k5phyn2","parent_id":"t3_17cax79","score":3,"submission_id":"17cax79"}
{"author":"burnerreturner","body":"I'd imagine most are angsty middle\/highschoolers who got rejected.\n\nThey tend to go for the trashiest women and get upset when they do trashy shit, then retreat to reddit to complain about all women being that way.\n\nWhile they're clearly deluded and wrong, it is a testament to how trashy people have become in general. You can't just say 'oooh all the poor women are being devalued!' when they're just people, and a vast majority of people are low quality.","created_utc":1698016512000,"comment_id":"k5z3dn9","parent_id":"t3_17cax79","score":3,"submission_id":"17cax79"}
{"author":"rezmc","body":"There’s a lot of incel ideology being pushed that guarantees a lot of young men are so misogynist no one will date them.\n\nIt’s getting more common that women are finally learning to dump men who disrespect them, who are inconsiderate or selfish. This means a lot of men just aren’t getting dates, since they haven’t grown to better themselves to be considerate, caring, faithful partners.\n\nIn general, some women who want kids are preferring to date men who have decent jobs, a car, and are financially responsible. If they were to have kids with broke men and wind up with deadbeat fathers, they’d be shamed by all of society, so these standards are understandable. (Personally, I care way too much about the emotional side of thing to care much about finances, so long as a guy isn’t irresponsible, & fully expect my next bf to be broke tbh ha.)\n\nAt the same time, we’re all suffering under obnoxiously high rents and companies that want people to be in massive student debt to be paid peanuts, so this unfortunately puts a huge emotional strain on everyone, which then makes the dating world even more stressful.\n\nThat said, it’s sad that young men and boys who could simply invest in building their emotional intelligence, and heal themselves to develop a secure attachment style, and end up being deeply loved and valued as partners regardless of their looks or height or income, are ensuring that they’ll become undatable by falling for misogynistic ideologies.","created_utc":1698021723000,"comment_id":"k5zghem","parent_id":"t3_17cax79","score":3,"submission_id":"17cax79"}
{"author":"LowInside1466","body":"It’s because even young women are realizing that being alone is preferable to being with someone who doesn’t enrich their life. These type of men are asking women what we bring to the table without bringing anything to the table that we built.","created_utc":1698125409000,"comment_id":"k65vhkz","parent_id":"t3_17cax79","score":3,"submission_id":"17cax79"}
{"author":"aroace_wholesomeness","body":"Some days I feel like I’m missing out when it comes to being attracted to people, and other days I feel eternally grateful. That doesn’t mean this problem doesn’t affect me, animosity between the genders is still a very real problem, and as a guy who often tries to make female friends, I can say that this animosity goes both ways. Hopefully one day we can live in equality, but until then, both genders have their unique issues relating to sexism, and we all just have to deal with it.","created_utc":1697840082000,"comment_id":"k5oxpqb","parent_id":"t3_17cax79","score":4,"submission_id":"17cax79"}
{"author":"Background-Ad9068","body":"you can blame the likes of andrew tate for that.","created_utc":1697872478000,"comment_id":"k5rb13s","parent_id":"t3_17cax79","score":2,"submission_id":"17cax79"}
{"author":"FanaticEgalitarian","body":"There's a small group of idiots from both sexes who just keep reacting and ramping up based on what the other said.","created_utc":1697903284000,"comment_id":"k5svy0j","parent_id":"t3_17cax79","score":2,"submission_id":"17cax79"}
{"author":"Chuckychinster","body":"JD Vance gave me the impression that he is a robot in human skin (not literally) that was pre-loaded with a series of bullshit conservative distractions. \n\nWhen forced to deviate from his regurgitated lies and bad faith talking points he was unable to provide any sort of answer without going on some weird diatribe. Complaining about being told he's lying, claiming democrats are systematically implementing censorship while he's advocated book bans.\n\nThe dude is a liar and a phoney. I mean he repeated nearly verbatim the same sentence describing his love for his children 3 times. If you have to memorize a line about loving your kids, that's very concerning. \n\nHe blatantly lied, even after being discredited with facts on those same lies, then repeated them.\n\nIt's concerning that in a VP debate he constantly asked why the sitting VP Kamala Harris hasn't fixed all these issues. The VP doesn't make laws, the VP doesn't legislate, and the VP is NOT an autocrat. The dude showed up to an interview and doesn't even understand the job he's applying for.\n\nWalz was nervous, genuine, and clear. I relate to that. He spoke the truth and backed his points up with facts. He laid out the ticket's ideas and plans. \n\nThe choice could not be more obvious.","created_utc":1727900575000,"comment_id":"lpyri30","parent_id":"t3_1fudpmg","score":5,"submission_id":"1fudpmg"}
{"author":"ZealousidealArm160","body":"Register to vote: https:\/\/vote.gov\/ Volunteer: https:\/\/www.mobilize.us\/ Donate: https:\/\/secure.actblue.com\/","created_utc":1727914152000,"comment_id":"lpzu9d4","parent_id":"t3_1fudpmg","score":2,"submission_id":"1fudpmg"}
{"author":"hoaryvervain","body":"The way he said the moderators’ names over and over creeped me out. So patronizing. \n\nI had a sort of random take on the debate. Even though Vance is evil and lies through his teeth, he speaks in complete sentences and can (sort of) have a normal conversation with another person. He reminded me that three of the four candidates are like that—and then there’s unhinged man-baby Trump. \n\nEven if someone fell for Vance’s faux empathy and “reasonableness,” there is no explaining why he would hitch himself to Trump’s horse..unless the master plan is to get rid of him soon after the election (if they win).","created_utc":1727901299000,"comment_id":"lpyt6wd","parent_id":"t3_1fudpmg","score":2,"submission_id":"1fudpmg"}
{"author":"GunMuratIlban","body":"You call him misogynistic, right after using the word \"mansplaining\" yourself. How ironic...","created_utc":1727900182000,"comment_id":"lpyqluf","parent_id":"t3_1fudpmg","score":3,"submission_id":"1fudpmg"}
{"author":"ADHDbroo","body":"Nothing he said was substantial ? after the debate dude literally posted proof for alot of the things like he promised. The copium your huffing is unreal. He won the debate against Tim walz and two moderators who tried to play dirty games with him (\"fact checking\" some thing he said then cutting him off to prevent him from responding after they said they wouldn't do that). \n\nAlot of the things he said couldn't even be interpreted in any way but that it appeals to common sense. He brought up the democrats track record, brought up information that can be corroborated by sources, and just over all won the debate. You must be huffing that good copium to arrive to the conclusion that you did.","created_utc":1727938626000,"comment_id":"lq1wr8d","parent_id":"t3_1fudpmg","score":1,"submission_id":"1fudpmg"}
{"author":"DrivingMyLifeAway1","body":"Mansplaining?   What a weird way to categorize his approach. He was definitely deceitful but that is one of the last words I would use to characterize his debate tactics against another MAN.","created_utc":1727912001000,"comment_id":"lpznf2i","parent_id":"t3_1fudpmg","score":0,"submission_id":"1fudpmg"}
{"author":"Bushmaster1988","body":"“To balance out her being a DEI hire, Bitch Kamala needed a ‘regular‘ guy as her running mate. Unfortunately, the Democratic Party doesn’t have any of those, so she chose Walz.  At the debate, the main function Walz served was to remind us that some white men *are* mediocre.”    — said by female friend of wife, over dinner.\n\nI laughed so hard!","created_utc":1727950320000,"comment_id":"lq2rdtw","parent_id":"t3_1fudpmg","score":0,"submission_id":"1fudpmg"}
{"author":"errorryy","body":"I didnt watch but heard he said \"Diplomacy is not a weakness.\" Or similar.  \n\nIm no MAGA but thats more sense than Kamala. Media is hiding that we are evil bullies.  World is dedollarizing, most have no idea what is about to hit them.  FAFO.","created_utc":1727902218000,"comment_id":"lpyvfmj","parent_id":"t3_1fudpmg","score":-1,"submission_id":"1fudpmg"}
{"author":"Cool_Radish_7031","body":"When did he use misogyny and racism? We must not have watched the same debate. Tim Walz stumbled the entire first half, dude looked like a panicked idiot blowing up a balloon. Or the white grinch","created_utc":1727899908000,"comment_id":"lpypzp9","parent_id":"t3_1fudpmg","score":-6,"submission_id":"1fudpmg"}
{"author":"Holiman","body":"You need to work on that definition.","created_utc":1727901241000,"comment_id":"lpyt1xi","parent_id":"t1_lpyqluf","score":4,"submission_id":"1fudpmg"}
