{"author":"444Ilovecats444","created_utc":1736099280000,"id":"1hu3asf","num_comments":40,"permalink":"\/r\/Discussion\/comments\/1hu3asf\/why_are_people_becoming_meaner_is_it_just_me_or\/","score":30,"selftext":"I remember 10 years ago or even more I used to use social media as an escape. Back then Facebook was mainstream social media. I was preteen at the time. I remember playing those facebook games and meeting strangers. People were so nice back then and it was so much fun. The downside is that I got addicted to social media at a young age. But I was happy. I vividly remember even 2017. Back then i made so many online friends and i still have 2 of them left to this day. I really loved how easy it was to make friends on social media. Everyone was nicer. Up until 2020 or i guess 2021-2022 because i noticed how meaner people were online around 2021(back then instagram was mainstream social media and instagram reels were introduced, i think, and people in the comments were so mean, they still are). But it’s getting worse every year. After Instagram TikTok became mainstream social media platform and i am using it more than i should but lately I’ve been thinking about deleting it. This used to be the nicest social media but i don’t know what happened. People became too judgmental and rude. And even stupid if you ask me. The video will say something like “Trying curly hair routine on my straight hair” and people will point out that she is delusional for thinking she has curly hair. This is just an example but i see it a lot. It feels like people don’t read the caption or they just don’t watch the video before judging. People are just so judgmental now. They will only hype you up if you’re pretty and skinny. What happened to body positivity? Why are they normalising the usage of Ozempic when they don’t have diabetes? \n\nI was interdicted to reddit by tiktok. You know those text to speech and minecraft videos in the background? I thought reddit would be cool but damn you guys are so mean on here as well but i love how you can anonymously share your thoughts and no one will know who you are. The last thing i want is that former classmate i had in high school or anyone i know finding my reddit account(he is the first person who i learned about reddit from but knowing the type of person he is i assumed this app was full of cp, racism, sexism, homophobia and so on - not that i am wrong though). But that’s why people on here are assholes. It’s anonymous. \n\nBut just because you can’t get beaten up through the screen doesn’t mean that you can be an asshole online. Unfortunately most of the people are so miserable and mean online. I am trying so hard to be positive because i can feel myself slipping into that version of me that lacks empathy because “Why did you even get yourself in this situation?”(yeah the good old victim blaming) instead of being like “I am so sorry this happened to you. It’s not your fault because you had no idea it would happen.” and i hate it. I often catch myself thinking like an asshole without any empathy because people around me(both online and in real life) are like that and “You become what you surround yourself with.” or whatever was the saying. \n\nYeah people in real life also got so much meaner. I am still scared of talking to people because i fear i will be judged because people are more judgmental than ever now. I have no idea why. Was it the COVID pandemic? Is it because people work a job they hate for tons of hours overtime and barely afford to live? Is it because they are jealous of people who have their life together? What is it?\n\n\nTL;DR for the people with damaged attention span: People online and in real life are meaner than they used to be. Most of them lack empathy and sometimes i can feel myself acting like an asshole and i am trying so hard to stay empathetic and positive. I think the pandemic is particularly the reason why but it could be because people spend most of their life working jobs that they hate and don’t pay them enough. ","title":"Why are people becoming meaner? Is it just me or are people now lacking empathy?","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/1hu3asf\/why_are_people_becoming_meaner_is_it_just_me_or\/","upvote_ratio":0.97,"over_18":false}
