{"author":"Joeylaptop12","created_utc":1732250299000,"id":"1gwpnb8","num_comments":691,"permalink":"\/r\/Discussion\/comments\/1gwpnb8\/why_is_so_hard_for_society_to_have_sympathy_for\/","score":31,"selftext":"When I was younger, most guys my age were Democrats. I even knew a few redneck guys who voted Obama because we all felt like the GOP didn’t have our back on economic issues. Fast forward 2016 and beyond and being a straight male democrats feels like the last of a dying breed \n\nAnd I hate to say it but I can absolutely see where SOME young men are coming from. Not the incels but casual observers. It does *feel* even if its not the full picture that Democrats\/ the left hate young men or men in general\n\nWhy? Anecdotally, I’ve experienced what people are talking about in terms of misandrist dogma. Joking or not, saying you h**te men and all men should d*e is pretty common in left wing circles\n\nSome data has suggested that a good chunk of younger people view asking to buy someone a drink at the bar is harassment\n\nMen notoriously struggle on dating apps that are unironically rigged against the vast majority of them \n\nWe no longer live in a world of graduating high school, getting a factory job that you can support a family of 3 on, finding a wife and settling down. It’s created a segment of young men who are increasingly finding misogynist morons like A*******w T******e attractive because they don’t know their place in society\n\nAnd asking and questioning why is met with a barrage of accusations of being an incel or worse \n\nI have sympathy for feminism and womens rights but why is hard for many of them and those in the left in general to see some young men and yes even some incels as victims in a changing culture? \n\nIt even extends to men of color at times with feminists basically parading borderline r*cist statements as well anecdotally? What is going on here? \n\nEdit: I am not a white male. This wasn’t intended to be a post defending them. But I do think Dems have got to do better communicating with men in general","title":"Why is so hard for society to have sympathy for young men? ","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/1gwpnb8\/why_is_so_hard_for_society_to_have_sympathy_for\/","upvote_ratio":0.61,"over_18":false}
