{"author":"Ironwolvessss","created_utc":1701939522000,"id":"18cjd7w","num_comments":573,"permalink":"\/r\/Discussion\/comments\/18cjd7w\/andrew_tate_is_a_disingenuous_narcissist\/","score":193,"selftext":"It's sad that Andrew Tate is so revered by so many in society. I attribute this to the femification of men in today's society. Due to masculinity being attacked. I do think toxic masculinity is a thing and it should be fought against but I believe the fight against toxic masculinity has slowly became a fight against all masculinity. I feel as if this is why so many disinfranchised men are gravitating towards douche bags like Tate. He's a man who's condoned violence towards women and is an out and out liar when it comes to his life. He lied about being a chess champ, he lied about being a kickboxing world champ. He lied about how he made his money. He lied about how much money he has. He lied about abuse allegations, he lied about why he moved from the UK. His most recent lie is that he's a Muslim. Something he's only saying because he's cancelled in the west so he's trying to set up a fan base somewhere else.\n\n\nI think there's a middle ground when it comes to fighting toxic masculinity. We can teach men that it's okay to feel your emotions and even cry. We can teach men that it's okay to embrace traditionally feminine traits like being nurturing and emotive without teaching them that it's okay to wear make up or nail polish. We can fight against mysoginy but at the same time we can also let men know it's okay to be masculine and to embrace being the protector of the house and someone who's in good enough shape to offer some protection in the case of a worse case scenario. No one's saying dedicate yourself to martial arts but I believe a man should be in decent shape. There is a middle ground that should be reached. \n\nThe problem is the pseudo feminists and alt right are so vocal and close minded that they're isolating eachother into echo chambers. They should instead be meeting in the middle. I'm a feminist but not the modern type that cries over man spreading and women having the right to show their breasts in public. I believe in equality and believe there should be more done to tackle issues facing women such as gender based violence and discrimination as well as issues facing men such as stigma around mental health and toxic masculinity. \n\nDue to people on the far left being so quick to cancel people it's driving more and more men towards douchebags like Tate. The far left is inexplicably emboldening the far right. Imagine being a working class man and you finally get into college or uni and all you hear is that everything in the world is your fault and that you should be ashamed of being a man. Rather than trying to educate people are speaking to virtue signal and come off as being right.  \n\nWhile the far left are partly to blame for the isolation of men, men on the far right must realise that those social justice warriors aren't true liberals and that true liberalism isn't about shaming men but about equality and respect for all and that douchebags like Tate are fakes who exploit your feelings for personal gain. They aren't indicative of real men. Real men are kind but strong, real men protect those around them. Real men show their emotions and are a pillar of support for those around them. Real men can wear pink and they can even listen to harry styles and be feminists. What real men can't be are make up wearing, nail polish wearing guilt infused pathetic social justice warrior simps. \n\n\nAnyways my rants over... Ps I'm a liberal centrist 26 year old ex Muslim Asian living in the UK. I love philosophy especially stocisim and Buddhism. I'm not a alt righter nor am I a social justice warrior. I'm just a guy stuck in the middle expressing my thoughts so please don't come at me with attacks.","title":"Andrew Tate is a disingenuous narcissist.","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/18cjd7w\/andrew_tate_is_a_disingenuous_narcissist\/","upvote_ratio":0.67,"over_18":false}
{"author":"Joeylaptop12","created_utc":1732250299000,"id":"1gwpnb8","num_comments":691,"permalink":"\/r\/Discussion\/comments\/1gwpnb8\/why_is_so_hard_for_society_to_have_sympathy_for\/","score":33,"selftext":"When I was younger, most guys my age were Democrats. I even knew a few redneck guys who voted Obama because we all felt like the GOP didn’t have our back on economic issues. Fast forward 2016 and beyond and being a straight male democrats feels like the last of a dying breed \n\nAnd I hate to say it but I can absolutely see where SOME young men are coming from. Not the incels but casual observers. It does *feel* even if its not the full picture that Democrats\/ the left hate young men or men in general\n\nWhy? Anecdotally, I’ve experienced what people are talking about in terms of misandrist dogma. Joking or not, saying you h**te men and all men should d*e is pretty common in left wing circles\n\nSome data has suggested that a good chunk of younger people view asking to buy someone a drink at the bar is harassment\n\nMen notoriously struggle on dating apps that are unironically rigged against the vast majority of them \n\nWe no longer live in a world of graduating high school, getting a factory job that you can support a family of 3 on, finding a wife and settling down. It’s created a segment of young men who are increasingly finding misogynist morons like A*******w T******e attractive because they don’t know their place in society\n\nAnd asking and questioning why is met with a barrage of accusations of being an incel or worse \n\nI have sympathy for feminism and womens rights but why is hard for many of them and those in the left in general to see some young men and yes even some incels as victims in a changing culture? \n\nIt even extends to men of color at times with feminists basically parading borderline r*cist statements as well anecdotally? What is going on here? \n\nEdit: I am not a white male. This wasn’t intended to be a post defending them. But I do think Dems have got to do better communicating with men in general","title":"Why is so hard for society to have sympathy for young men? ","url":"https:\/\/www.reddit.com\/r\/Discussion\/comments\/1gwpnb8\/why_is_so_hard_for_society_to_have_sympathy_for\/","upvote_ratio":0.61,"over_18":false}
