{"author":"dingenium","body":"In case you're just reading the title...here is the abstract: \n\nWe analyzed data from the 2018 Sex in Canada survey (n = 1,015 cisgender men) to examine the association between feminist identification and reported use of prescription ED medication (EDM) during men’s last sexual encounter. Feminist-identified men were substantially more likely to report EDM use than non-feminist men, even after controlling for alcohol use before sex, erection difficulties, sexual arousal, sexual health, mental health, and physical health. One explanation is that feminist men may use EDM to bolster their masculinity when it is otherwise threatened by their identification as feminist. Another is that non-feminist men may be less likely to use prescription EDM because they view accessing healthcare services as a threat to their masculinity. It is also possible that feminist men are more likely to use EDM because they wish to maintain an erection to better please their partner. Lastly, feminist men may be more honest about EDM use than non-feminist men, even though rates are similar. Regardless of the exact reason, therapists can use these results to tailor sexual health messages to clients based on feminist identification. Future work could employ qualitative methods to understand why feminist men report higher rates of EDM use than non-feminist men.","created_utc":1644047661000,"comment_id":"hvms8bm","parent_id":"t3_skeq66","score":1,"submission_id":"skeq66"}
{"author":"Doghead45","body":"The older I get the more I realize viagra is for women, not men","created_utc":1644018973000,"comment_id":"hvkoycq","parent_id":"t3_skeq66","score":273,"submission_id":"skeq66"}
{"author":"onion-nebohodac","body":"Feminist men significantly more likely to REPORT using erectile dysfunction medication than non-feminist men","created_utc":1644018037000,"comment_id":"hvkmgko","parent_id":"t3_skeq66","score":461,"submission_id":"skeq66"}
{"author":"mangarooboo","body":"I believe it. I'm a woman and I work part time in a community pharmacy. My company charges an insane amount for ED medications but there is another company that doesn't. I've been given the OK from my (male, mostly conservative) pharmacist to send people away if their ~~copay~~ cost is too high.\n\nWhat this means is I have to have a frank conversation with men who are picking up ED meds, explain why they're so expensive, and tell them to go away. 99% of the time it's actually a very nice chat. I use respectful language, I never mention the drug by name, I don't even say what type of drug it is out loud (I say \"this kind of drug\" instead of describing what it is for), and I let them know where our nearest competitor is and how to get their prescription transferred there. My pharmacist has given me strict orders to not make someone pay a lot of money for the drug, which I agree with. Sure, some fellas get 6 a month or so for ten bucks, which is nice, but asking someone to pay over $150 for 3 or 4 tablets just so they can have uninterrupted intimacy with someone is just criminal to me.\n\nDisclaimer: ED meds *can* cause issues with your heart, considering it's a vasodilator, and it's generally not all that recommended to take it every day, especially if you're at higher risk for heart issues. I wouldn't do this without my pharmacist's consent.\n\nEdit for clarity: if my patient is paying 150+ for their erectile dysfunction meds, it's because it's NOT covered by insurance. That's the price with no coverage at all. I used the word \"copay\" because that's what I always call my patients' costs when they pick up, even though that isn't always accurate. \n\nWhat IS accurate is that people will use GoodRx to take their price \"down\" but it's not as good as going to our competitor.\n\nThis comment was just supposed to be about the lovely conversations I've had with people regarding ED meds, it was not meant to be a discussion about the flop of a healthcare system the US has. Lol","created_utc":1644020708000,"comment_id":"hvktm7w","parent_id":"t3_skeq66","score":68,"submission_id":"skeq66"}
{"author":"Fight_The_Sun","body":"They controlled for erectile difficulty, so that means that apparently feminist men are more likely to do sth about it. If I were to guess my top picks would be:\n1. Reluctance to acknowledge or admit a ED Problem\n2. Feminist men maybe caring more about the sexual pleasure of their partner\n3. Reluctance to seek medical treatment of any kind in non feminist men\n4. Non feminist men being more okay with ED (i doubt that one though)\n\nWhat are your uneducated guesses?","created_utc":1644017348000,"comment_id":"hvkkobj","parent_id":"t3_skeq66","score":113,"submission_id":"skeq66"}
{"author":"lav__ender","body":"This makes me wonder if porn-induced erectile dysfunction may come into play here. I’d be interested to see porn use factored into a study like this one.","created_utc":1644041492000,"comment_id":"hvmd8x9","parent_id":"t3_skeq66","score":3,"submission_id":"skeq66"}
{"author":"racinefx","body":"I guess that a lot of these is because since the don’t consider themselves « badass manly men », they seek help instead of just suffering in silence.\n\nSimilar to why women reach for help a lot faster: since they are not considered «manly badass », what is there to lose to ask for help and solve the problem as fast as possible?","created_utc":1644016028000,"comment_id":"hvkhcva","parent_id":"t3_skeq66","score":27,"submission_id":"skeq66"}
{"author":"BobbyBoogarBreath","body":"Feminist men more comfortable self reporting about their sexual health. \n\nftfy.","created_utc":1644052922000,"comment_id":"hvn41ns","parent_id":"t3_skeq66","score":3,"submission_id":"skeq66"}
{"author":"owlseeyaround","body":"Did they control for how any man who declares themselves “not a feminist” will also definitely never disclose that they need dick pills?","created_utc":1644018242000,"comment_id":"hvkn06v","parent_id":"t3_skeq66","score":15,"submission_id":"skeq66"}
{"author":"sportsfan42069","body":"\"One explanation is that feminist men may use EDM to bolster their masculinity when it is otherwise threatened by their identification as feminist\"\n\nUm, WHAT? That seems like a reach haha.","created_utc":1644024438000,"comment_id":"hvl3twf","parent_id":"t3_skeq66","score":10,"submission_id":"skeq66"}
{"author":"Kailynna","body":"Playing WoW, I was in a mainly male guild, which was fine with me. I was just there to quest, raid and fight and have fun. I accepted I was in male territory and had no wish to change anything. \n\nOne night the guys in the guild started joking about drugging and raping women. They were surprised when I spoke up, they hadn't realised I was online. Apparently they often talked like that when I was not online. \n\nI spoke to them gently, suggesting their jokes might influence younger players and make them more likely to behave that way. They immediately labelled me as a feminazi and got me kicked out of the guild.","created_utc":1728089308000,"comment_id":"lqbq9yt","parent_id":"t3_1fvzxgi","score":586,"submission_id":"1fvzxgi"}
{"author":"Repulsive_One_2878","body":"I played Wow for years. Around wrath I was actually harassed by a few guys from another guild our guild had combined with for a second to down the lich king on 25-man. Anyway, I was the main healer, and they could hear my voice on discord. I knew my stuff on the fight and stuck to my guns. For about 2 weeks after a few of them sent harassing texts. They changed accounts and re-rolled just to keep this up. I figured they would get bored after a few days since I wasn't interacting with them at all; I couldn't figure out what was in it for them. I was literally just blocking anyone who continued to message me. It took admins  getting involved and temporary bans to get it to stop. It wasn't the first, nor last time I was treated poorly or challenged for being female, but it was probably the most extreme.","created_utc":1728137625000,"comment_id":"lqf40be","parent_id":"t3_1fvzxgi","score":28,"submission_id":"1fvzxgi"}
{"author":"chrisdh79","body":"From the article: A [recent study](https:\/\/link.springer.com\/article\/10.1007\/s11199-024-01506-w) published in the journal Sex Roles highlights a troubling reality for many women in the world of online gaming. The research shows that women gamers who identify as feminists or engage in actions promoting gender equality are often blamed more for experiencing sexist incidents while playing online. Notably, this pattern of blame was most pronounced among participants who held stronger sexist attitudes towards women gamers.\n\nOnline video games have become one of the most popular forms of entertainment worldwide, connecting millions of people in shared virtual environments. Although gaming has historically been viewed as a male-dominated activity, recent data shows that nearly half of gamers are women. Despite this, many women gamers report feeling unwelcome in online gaming spaces and regularly encounter sexist attitudes and behaviors.\n\nThe study’s authors sought to explore why women gamers are often blamed for experiencing sexism in online gaming. They were particularly interested in understanding how certain characteristics of women gamers, such as identifying as feminists or engaging in gender equality activism, might influence perceptions of blame in sexist incidents.","created_utc":1728079449000,"comment_id":"lqavwk7","parent_id":"t3_1fvzxgi","score":115,"submission_id":"1fvzxgi"}
{"author":"Secret-Painter-1079","body":"My recent ex (as in he broke up with me last month) told me it was crazy I was upset that my fifteen year old sister experienced rape threats in Valorant for saying call-outs in the VCs and she should’ve expected it. It was very masks off. \n\nI expressed I was extra upset by what he was saying, he went on to say well women shouldn’t walk at night alone, sucks to suck but it’s reality you can’t stay sad. Called me a radical too. \n\nI just wanted to vent. We were in a ldr. He broke up with me like two weeks later because he took a step back and said he realized he was getting kind of emotionally abusive. Good for him, but also, this whole thing sucked.","created_utc":1728191597000,"comment_id":"lqio2zl","parent_id":"t3_1fvzxgi","score":6,"submission_id":"1fvzxgi"}
{"author":"SaddurdayNightLive","body":"Like racists who don't like their racism called out?","created_utc":1728091912000,"comment_id":"lqbygrn","parent_id":"t3_1fvzxgi","score":36,"submission_id":"1fvzxgi"}
{"author":"RolfMiau","body":"Cry-bullies feel like the victim when someone starts fighting back.\n\nBlaming victims for rape, blaming Jews for being attacked, blaming woman for sexism, the cry-bullies are everywhere.","created_utc":1728087206000,"comment_id":"lqbjq9b","parent_id":"t3_1fvzxgi","score":47,"submission_id":"1fvzxgi"}
{"author":"pcfirstbuild","body":"I'm wondering if some of this can be explained by online gaming being a toxic environment in general, especially now. As people learn things about you, they try to use it against you. Like if you told strangers in a game you are overweight for example, they will roast you for that. If you have different opinions on social or political issues, expect to be personally attacked. If you make a mistake in game, teammates will be brutal towards you and tell you to uninstall the game and throw any slurs that dodge language filters your way.\n\nBeing a long time gamer myself, yeah people always were talking trash anonymously. That being said, it feels like it's been more toxic than ever now. Just a vibe shift I noticed after taking a break from gaming and logging back in around the pandemic. It's only gotten worse since then too it feels like, I don't know a solution but people seem to forget they are competing with and talking with other human beings. I will plug HealthyGamerGG on youtube as a great channel for exploring the rampant mental health issues a lot of gamers struggle with.","created_utc":1728082405000,"comment_id":"lqb4r3a","parent_id":"t3_1fvzxgi","score":51,"submission_id":"1fvzxgi"}
{"author":"alinktothefish","body":"The study actually seems valuable, though this is a horrible title. I suspect there may be some slightly poor translation at work here.\n\nFrom the article:\n\n\"In the first study, the researchers found women who were described as feminists were more likely to be blamed for the sexist incident, but only by participants who held stronger sexist attitudes towards women gamers. In contrast, participants with lower levels of sexist attitudes did not differentiate between the feminist and non-feminist [woman] when assigning blame.\"\n\nSo basically, if people were told that a woman was a feminist, they only victim-blamed if they were sexist. This might seem like a complete no-brainer, but in academia I guess you need hard data or all you have is assumption.","created_utc":1728193853000,"comment_id":"lqiuu6t","parent_id":"t3_1fvzxgi","score":5,"submission_id":"1fvzxgi"}
{"author":"TrishPanda18","body":"Shocking!: the people calling out a problem are blamed for said problem existing\n\/s","created_utc":1728080222000,"comment_id":"lqay5mp","parent_id":"t3_1fvzxgi","score":62,"submission_id":"1fvzxgi"}
{"author":"ohfrackthis","body":"Lolol. I'm a woman gamer. Just...NO. I've played with huge groups of men who were mostly fine but omg I've run into some seriously garbage dudes who derive pleasure screaming extremely sexist things and creating a seriously toxic environment.  The vast majority of men I've played with are mostly fine to excellent and fun people. Then there are the reported and blocked 🚫","created_utc":1728084859000,"comment_id":"lqbccx6","parent_id":"t3_1fvzxgi","score":16,"submission_id":"1fvzxgi"}
